Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Switches to an immersive fullscreen mode so that you can use more of the screen. You can choose between **Hide the system bars** which will hide the system status bar, action bar, and bottom navigation buttons. Alternatively you can choose **Hide the system bars and answer buttons**, which will hide everything except for the actual card content itself. You can temporarily exit fullscreen mode by swiping inwards (i.e. down or up) from the system bars.
ar: التبديل إلى وضع ملء الشاشة الغامض بحيث يمكنك استخدام المزيد من الشاشة. يمكنك الاختيار بين **إخفاء شريط النظام** الذي سيخفي شريط حالة النظام، شريط الإجراءات، وأزرار التنقل السفلي. بدلاً من ذلك، يمكنك اختيار **إخفاء أشرطة النظام وأزرار الإجابة**، التي ستخفي كل شيء باستثناء محتوى البطاقة الفعلي. يمكنك الخروج من وضع ملء الشاشة مؤقتاً عن طريق التمرير إلى الداخل (أي لأسفل أو أعلى) من شريط النظام.
ja: より多くの画面を使用できるように、没入型フルスクリーンモードに切り替えます。 システムのステータスバー、アクションバー、下部のナビゲーションボタンを非表示にする**システムバーを非表示**から選択できます。 あるいは、**システムバーと解答ボタンを非表示にする**を選択すると、実際のカードコンテンツ以外のすべてが非表示になります。 システムバーから内側(下または上)をスワイプすることで、一時的にフルスクリーンモードを終了できます。
ru: Переключает в полноэкранный режим для использования большего количества экрана. Вы можете выбрать **Скрыть системные панели**, которые скрывают системную строку состояния, панель действий и нижнюю кнопку навигации. В качестве альтернативы вы можете выбрать **Скрыть системные панели и кнопки ответа**, которые будут скрывать все, кроме самого контента карты. Вы можете временно выйти из полноэкранного режима, проведя пальцем вверх (т.е. вниз или вверх) на системных барах.

source: _Note that immersive fullscreen mode is only supported on Android 4.4+_
ar: _لاحظ أن وضع ملء الشاشة مدعم فقط على أندرويد 4.4+_
ja: _没入型フルスクリーンモードはAndroid 4.4+_でのみサポートされていることに注意してください
ru: _Обратите внимание, что полноэкранный режим поддерживается только на Android 4.4+_

source: By default AnkiDroid tries to show cards exactly as they are shown on Anki Desktop, however if you prefer your cards to be center aligned vertically in AnkiDroid then you can enable this feature.
ar: بشكل افتراضي يحاول AnkiDroid إظهار البطاقات بالضبط كما تظهر على سطح مكتب أنكي، ومع ذلك، إذا كنت تفضل أن تكون بطاقاتك مركزة رأسياً في AnkiDroid فيمكنك تمكين هذه الميزة.
ja: AnkiDroidはデフォルトで、Ankiデスクトップに表示されているようにカードを正確に表示しようとします。 ただし、AnkiDroidでカードを垂直方向に整列させたい場合は、この機能を有効にすることができます。
ru: По умолчанию AnkiDroid пытается показать карты точно так, как они показаны на Anki Desktop, Однако, если вы хотите, чтобы ваши карты были выровнены по вертикали в AnkiDroid, вы можете включить эту функцию.

source: Show button time
ar: إظهار وقت الزر
ja: ボタンの時刻を表示
ru: Показывать время кнопки

source: By default, the answer buttons will display the time a card will next be shown. If you disable this option, the times will not appear, and only labels like **Again**, **Good** and **Easy** will be shown.
ar: بشكل افتراضي، ستعرض أزرار الإجابة الوقت الذي ستظهر فيه البطاقة التالية. إذا قمت بتعطيل هذا الخيار، فلن تظهر الأوقات، ولن تظهر سوى التسميات مثل **مرة أخرى**، **جيد** و **سهل**.
ja: デフォルトでは、回答ボタンにはカードが次に表示される時間が表示されます。 このオプションを無効にすると、時間は表示されず、**Again** や **Good** や **Easy** のようなラベルだけが表示されます。
ru: По умолчанию, кнопки ответа будут отображать время следующего показа карты. Если вы отключите эту опцию, время не будет появляться и отображаются только ярлыки, такие как **Голосование**, **Хорошо** и **Легко**.

source: Card zoom
ar: تكبير البطاقة
ja: カードのズーム
ru: Масштаб карты

source: Here you can increase the zoom level of the card content (excluding images). You can use this option if you want to increase the font size for all cards.
ar: هنا يمكنك زيادة مستوى تكبير محتوى البطاقة (باستثناء الصور). يمكنك استخدام هذا الخيار إذا كنت ترغب في زيادة حجم الخط لجميع البطاقات.
ja: ここでは、カードの内容(画像を除く)のズームレベルを高めることができます。 すべてのカードのフォントサイズを大きくしたい場合は、このオプションを使用できます。
ru: Здесь вы можете увеличить масштаб содержимого карты (за исключением изображений). Этот параметр можно использовать, если вы хотите увеличить размер шрифта для всех карт.

source: Image zoom
ar: تكبير الصورة
ja: 画像のズーム
ru: Масштаб изображения

source: Here you can increase the zoom level of any images embedded in your cards.
ar: هنا يمكنك زيادة مستوى تكبير أي صور مضمنة في أوراقك.
ja: カードに埋め込まれた画像のズームレベルを上げることができます。
ru: Здесь вы можете увеличить масштаб любого изображения, встроенного в ваши карты.

source: Answer button size
ar: حجم زر الإجابة
ja: 回答ボタンのサイズ
ru: Размер кнопки ответа

source: If you find it difficult to press the answer button, you can use this setting to make it bigger.
ar: إذا وجدت أنه من الصعب الضغط على زر الإجابة، يمكنك استخدام هذا الإعداد لجعله أكبر.
ja: 解答ボタンを押すのが難しい場合は、この設定を使用して大きくすることができます。
ru: Если вы считаете, что трудно нажать на кнопку ответа, вы можете использовать этот параметр, чтобы увеличить его.

source: Show remaining
ar: إظهار الباقي
ja: 残りを表示
ru: Показать оставшиеся

source: Disabling this allows you to hide the card count in the top left of the screen.
ar: تعطيل هذا يسمح لك بإخفاء عدد البطاقات في الجزء العلوي الأيسر من الشاشة.
ja: これを無効にすると、画面左上のカード数を非表示にできます。
ru: Отключение этого параметра позволяет скрыть количество карт в левом верхнем углу экрана.

source: Whiteboard
ar: لوحة بيضاء
ja: ホワイトボード
ru: Белая доска

source: This subsection controls the whiteboard in the reviewer. Note: the whiteboard must be enabled in each deck individually from the menu in the study screen.
ar: هذا القسم الفرعي يتحكم في اللوحة البيضاء في المراجع. ملاحظة: يجب تمكين اللوحة البيضاء في كل مجموعة على حدة من القائمة الموجودة في شاشة الدراسة.
ja: このセクションでは、査読者のホワイトボードを制御します。注意: ホワイトボードは、研究画面のメニューから各デッキで個別に有効にする必要があります。
ru: Этот подраздел контролирует белую доску в редакторе. Внимание: белая доска должна быть включена индивидуально из меню на экране обучения.

source: Stroke width
ar: عرض جرة القلم
ja: ストロークの幅
ru: Ширина штриха

source: Control the stroke width of the whiteboard. Reducing the stroke width may allow you to draw with more detail.
ar: التحكم في عرض السكتة الدماغية للوحة البيضاء. تقليل عرض السكتة الدماغية قد يسمح لك بالرسم بمزيد من التفاصيل.
ja: ホワイトボードのストローク幅を制御します。ストローク幅を減らすと、より詳細に描画することができます。
ru: Настройте ширину штриха на доске. Уменьшение ширины штриха может позволить нарисовать более детально.

source: Black strokes
ar: السكتة السوداء
ja: 黒いストローク
ru: Черные штрихи

source: Use black strokes instead of color, which may reduce memory usage. Note: this setting doesn't apply when night mode is enabled.
ar: استخدام السكتات الدماغية السوداء بدلاً من اللون، مما قد يقلل من استخدام الذاكرة. ملاحظة: لا ينطبق هذا الإعداد عند تمكين الوضع الليلي.
ja: 色の代わりに黒いストロークを使用して、メモリ使用量を減らします。注意: ナイトモードが有効になっている場合、この設定は適用されません。
ru: Использовать черные штрихи вместо цвета, что может уменьшить использование памяти. Внимание: этот параметр не применяется, когда включен ночной режим.

source: Automatic display answer
ar: إجابة العرض التلقائي
ja: 回答を自動的に表示
ru: Автоматически отображать ответ

source: The automatic display answer feature allows you to have the answer shown automatically after some timeout period. You can also have the next question shown automatically; in this case the card is assumed to be failed (i.e. the again button is automatically chosen)
ar: تتيح لك ميزة إجابة العرض التلقائي عرض الإجابة تلقائياً بعد فترة زمنية معينة. يمكنك أيضًا عرض السؤال التالي تلقائياً؛ وفي هذه الحالة يفترض أن البطاقة فاشلة. . يتم اختيار الزر مرة أخرى تلقائياً)
ja: 自動表示解答機能を使用すると、タイムアウト時間が経過すると自動的に解答を表示できます。 次の質問を自動的に表示することもできます。この場合、カードが失敗すると想定されます (i. を選択します。
ru: Функция автоматического отображения ответа позволяет автоматически отобразить ответ по истечении определенного промежутка времени. Вы также можете отобразить следующий вопрос автоматически; в этом случае предполагается, что карта окажется неудачной. . кнопка снова автоматически выбирается)

source: Time to show answer
ar: الوقت لإظهار الإجابة
ja: 回答を表示する時間
ru: Время показать ответ

source: Time to wait until answer is automatically shown
ar: الوقت للانتظار حتى يتم عرض الإجابة تلقائياً
ja: 回答が自動的に表示されるまで待機する時間
ru: Время ожидания автоматического ответа

source: Time to show next question
ar: الوقت لإظهار السؤال التالي
ja: 次の質問を表示する時間
ru: Время показать следующий вопрос

source: Time to wait until next question is automatically shown.
ar: حان الوقت للانتظار حتى يتم عرض السؤال التالي تلقائياً.
ja: 次の質問が自動的に表示されるまで待機する時間。
ru: Время ожидания до следующего вопроса автоматически отображается.

source: Fonts
ar: الخطوط
ja: フォント
ru: Шрифты

source: In this screen you can change the font used by AnkiDroid, and some scaling options related to fonts. See the [custom fonts](advanced-features/custom-fonts.md) section for more information about using custom fonts.
ar: في هذه الشاشة يمكنك تغيير الخط المستخدم من قبل AnkiDroid، وبعض خيارات القياس المتعلقة بالخطوط. راجع قسم [الخطوط المخصصة](Advced-features/custom-fonts.md) لمزيد من المعلومات حول استخدام الخطوط المخصصة.
ja: この画面では、AnkiDroidが使用するフォントと、フォントに関連するいくつかのスケーリングオプションを変更できます。 カスタムフォントの使用方法については、format@@0(advanced-features/custom-fonts.md)のセクションを参照してください。
ru: На этом экране вы можете изменить шрифт, используемый AnkiDroid, и некоторые параметры масштабирования, связанные с шрифтами. Смотрите раздел [пользовательские шрифты](advanced-features/custom-fonts.md) для получения дополнительной информации об использовании пользовательских шрифтов.

source: Choose the default font used by the AnkiDroid reviewer. You can add fonts to this list by copying them to the **fonts** folder.
ar: اختر الخط الافتراضي المستخدم من قبل مستعرض AnkiDroid. يمكنك إضافة الخطوط إلى هذه القائمة عن طريق نسخها إلى مجلد **الخطوط**.
ja: AnkiDroidのレビューアで使用される既定のフォントを選択します。このリストにフォントを追加するには、**fonts** フォルダにコピーします。
ru: Выберите шрифт по умолчанию, используемый обзором AnkiDroid. Вы можете добавить шрифты в этот список, скопировав их в папку **шрифты**.

source: Default font applicability
ar: تطبيق الخط الافتراضي
ja: 既定のフォントの適用
ru: Применимость шрифта по умолчанию

source: The default setting is to only use the default font when no font has been specified in the card styling via Anki Desktop, however you can also force the default font to be applied, ignoring any font specification in the card styling.
ar: الإعداد الافتراضي هو استخدام الخط الافتراضي فقط عندما لا يتم تحديد خط في نمط البطاقة عبر سطح المكتب Anki ، ومع ذلك، يمكنك أيضا إجبار الخط الافتراضي على التطبيق، متجاهلة أي مواصفات خط في نمط البطاقة.
ja: デフォルトの設定は、Anki Desktop経由でカードのスタイルでフォントが指定されていない場合にのみ、デフォルトのフォントを使用することです。 しかし、デフォルトのフォントを強制的に適用することもできますが、カードのスタイルでのフォント指定は無視します。
ru: По умолчанию используется только шрифт по умолчанию, если шрифт не указан в оформлении карты через Anki Desktop, но вы также можете принудительно применить шрифт по умолчанию, игнорируя любую спецификацию шрифта в стилях карты.

source: Browser and editor font
ar: خط المتصفح والمحرر
ja: ブラウザとエディタのフォント
ru: Шрифт браузера и редактора

source: The font to be used by the browser and editor
ar: الخط الذي سيتم استخدامه من قبل المتصفح والمحرر
ja: ブラウザとエディタで使用されるフォント
ru: Шрифт для браузера и редактора

source: Card browser font scaling
ar: حجم خط متصفح البطاقة
ja: ブラウザのフォントの拡大縮小
ru: Масштабирование шрифта браузера карты

source: Lets you change the font size used in the card browser.
ar: يتيح لك تغيير حجم الخط المستخدم في متصفح البطاقة.
ja: ブラウザで使用するフォントサイズを変更できます。
ru: Позволяет изменить размер шрифта, используемый в браузере карты.

source: [Actions](#actions)
ar: [Actions](#إجراءات)

source: [No action](#no-action)
ar: [لا إجراء](#no-action)
ja: format@@0(#no-action)
ru: [Никаких действий](#no-action)

source: [Answer button 1](#answer-button-1)
ar: [زر الإجابة 1](#answer-button-1)
ja: format@@0(#answer-button-1)
ru: [Кнопка ответа 1](#answer-button-1)

source: [Answer button 2](#answer-button-2)
ar: [زر الإجابة 2](#answer-button-2)
ja: format@@0(#answer-button-2)
ru: [Кнопка ответа 2](#answer-button-2)

source: [Answer button 3](#answer-button-3)
ar: [زر الإجابة 3] (#answer-button-3)
ja: format@@0(#answer-button-3)
ru: [Ответная кнопка 3](#answer-button-3)

source: [Answer button 4](#answer-button-4)
ar: [زر الإجابة 4](#answer-button-4)
ja: format@@0(#answer-button-4)
ru: [Кнопка ответа 4](#answer-button-4)

source: [Answer recommended (green)](#answer-recommended-green)
ar: [الإجابة الموصى بها (الخضراء)](#answer-rerecommendded-Gre)
ja: format@@0(#answer-recommended-green)
ru: [Ответ рекомендован (зеленый)](#answer-recommended-green)

source: [Answer better than recommended](#answer-better-than-recommended)
ar: [الإجابة أفضل من الموصى به] (#answer-أفضل-أفضل من الموصى به)
ja: format@@0(#answer-better-than-recommended)
ru: [Ответить лучше, чем рекомендуется](#answer-better-than-recommended)

source: [Edit card](#edit-card)
ar: [تحرير البطاقة](#edit-card)
ja: format@@0(#edit-card)
ru: [Редактировать карту](#edit-card)

source: [Lookup expression](#lookup-expression)
ar: [بحث عن التعبير](#lookup-expression)
ja: format@@0(#lookup-expression)
ru: [Справка выражения](#lookup-expression)

source: [Bury card](#bury-card)
ar: [بطاقة الدفن](#bury-card)
ja: format@@0(#bury-card)
ru: [Кусочек карты](#bury-card)

source: [Suspend card](#suspend-card)
ar: [تعليق البطاقة ](#suspend-card)
ja: format@@0(#suspend-card)
ru: [Приостановить карту](#suspend-card)

source: [Delete note](#delete-note)
ar: [حذف ملاحظة] (#حذف)
ja: format@@0(#delete-note)
ru: [Удалить заметку](#delete-note)

source: [Play media](#play-media)
ar: [تشغيل الوسائط](#play-media)
ja: format@@0(#play-media)
ru: [Играть медиа](#play-media)

source: [Abort learning](#abort-learning)
ar: [إلغاء التعلم] (#abort-learning)
ja: format@@0(#abort-learning)
ru: [Прервать обучение](#abort-learning)

source: [Bury note](#bury-note)
ar: [ملاحظة دفن](#دفن-ملاحظة)
ja: format@@0(#bury-note)
ru: [Примечание бури (#bury-note)

source: [Suspend note](#suspend-note)
ar: [تعليق الملاحظة](#suspend-note)
ja: format@@0(#suspend-note)
ru: [Приостановить заметку](#suspend-note)

source: [Toggle Red Flag](#toggle-red-flag)
ar: [تبديل العلم الأحمر](#toggle-red-flag)
ja: format@@0(#toggle-red-flag)
ru: [Переключить красный флаг](#toggle-red-flag)

source: [Toggle Orange Flag](#toggle-orange-flag)
ar: [تبديل العلم البرتقالي](#toggle-orange-flag)
ja: format@@0(#toggle-orange-flag)
ru: [Переключить оранжевый флаг](#toggle-orange-flag)

source: [Toggle Green Flag](#toggle-green-flag)
ar: [تبديل العلم الأخضر](#toggle-green-flag)
ja: format@@0(#toggle-green-flag)
ru: [Переключить зеленый флаг](#toggle-green-flag)

source: [Toggle Blue Flag](#toggle-blue-flag)
ar: [تبديل العلم الأزرق](#toggle-blue-flag)
ja: format@@0(#toggle-blue-flag)
ru: [Переключить синий флаг](#toggle-blue-flag)

source: [Remove Flag](#remove-flag)
ar: [إزالة العلامة](#remove-flag)
ja: format@@0(#remove-flag)
ru: [Удалить флаг](#remove-flag)

source: [Advanced](#advanced)
ar: [Advanced](#متقدم)

source: [Collection path](#collection-path)
ar: [مسار المجموعة](#collection-path)
ja: format@@0(#collection-path)
ru: [Путь к коллекции](#collection-path)

source: [Force full sync](#force-full-sync)
ar: [إجبار المزامنة الكاملة] (#force-full-sync)
ja: format@@0(#force-fullsync)
ru: [Принудительная полная синхронизация](#force-full-sync)

source: [Advanced Statistics](#advanced-statistics)
ar: [إحصاءات متقدمة](#Advced-statistics)
ja: format@@0(#advanced-statistics)
ru: [Расширенная статистика](#advanced-statistics)

source: [Workarounds](#workarounds)
ar: [Workarounds](#عمل)
ja: [Workarounds](#回避策)

source: [Type answer into the card](#type-answer-into-the-card)
ar: [اكتب الإجابة في البطاقة](#type-answer-into-the-card)
ja: format@@0(#type-answer-into-the-card)
ru: [Введите ответ в карту](#type-answer-into-the-card)

source: [Input Workaround](#input-workaround)
ar: [مدخل تمرين](#input-workaround)
ja: format@@0(#input-workaround)
ru: [Входной ход](#input-workaround)

source: [Longclick Workaround](#longclick-workaround)
ar: [انقر مطولاً حول العمل](#longk-workaround)
ja: format@@0(#longclick-workaround)
ru: [Продолжительность нажатия](#longclick-workaround)

source: [Fix for Hebrew Vowels](#fix-for-hebrew-vowels)
ar: [إصلاح للفوترات العبرية](#fix-for-hebrew-vowels)
ja: format@@0(#fix-for-hebrew-vowels)
ru: [Исправлена проблема с еврейскими огласовками](#fix-for-hebrew-vowels)

source: [Text to Speech](#text-to-speech)
ar: [نص إلى كلام] (#نص إلى كلام)
ja: format@@0(#text-to-speech)
ru: [Текст для речи](#text-to-speech)

source: [Lookup Dictionary](#lookup-dictionary)
ar: [بحث عن قاموس](#lookup-قاموس)
ja: format@@0(#lookup-dictionary)
ru: [Словарь справки](#lookup-dictionary)

source: [Reset Languages](#reset-languages)
ar: [إعادة تعيين اللغات](#reset-languages)
ja: format@@0(#reset-languages)
ru: [Сбросить языки](#reset-languages)

source: [eReader (up/down buttons)](#ereader-updown-buttons)
ar: [eReader (أزرار أعلى/أسفل)](#ereader-up-buttons)
ja: [eReader (上/下ボタン)](#ereader-updown-buttons)
ru: [eReader (кнопки вверх/вниз)](#ereader-updown-buttons)

source: [eReader Double Scrolling](#ereader-double-scrolling)
ar: [التمرير المزدوج للقارئ](#ereader-dou-scrolling)
ja: format@@0(#ereader-double-scrolling)
ru: [eReader двойная прокрутка](#ereader-double-scrolling)

source: AnkiDroid allows you to customize the interface, so that actions you perform frequently can be accomplished quickly by using tap and swipe gestures.
ar: يسمح لك AnkiDroid بتخصيص الواجهة، بحيث يمكن إنجاز الإجراءات التي تقوم بها بشكل متكرر بسرعة باستخدام الإيماءات النقر والسحب.
ja: AnkiDroidを使用すると、インターフェイスをカスタマイズでき、頻繁に実行するアクションは、タップとスワイプジェスチャーを使用して迅速に実行できます。
ru: AnkiDroid позволяет настроить интерфейс, так что действия, которые вы часто выполняете, могут быть выполнены быстро, используя жесты касания и свайпы.

source: Actions
ar: الإجراءات
ja: アクション
ru: Действия

source: The following gestures can be used:
ar: يمكن استخدام الإيماءات التالية:
ja: 以下のジェスチャーを使用できます：
ru: Можно использовать следующие жесты:

source: Swipe up
ar: مرر لأعلى
ja: 上にスワイプ
ru: Свайп вверх

source: Swipe down
ar: مرر لأسفل
ja: 下にスワイプ
ru: Свайп вниз

source: Swipe left
ar: مرر لليسار
ja: 左にスワイプ
ru: Свайп влево

source: Swipe right
ar: مرر لليمين
ja: 右にスワイプ
ru: Свайп вправо

source: Double touch
ar: لمسة مزدوجة
ja: ダブルタッチ
ru: Двойное касание

source: Touch top
ar: المس أعلى
ja: 上部にタッチ
ru: Коснуться сверху

source: Touch bottom
ar: اللمس أسفل
ja: 下にタッチ
ru: Коснитесь снизу

source: Touch left
ar: المس لليسار
ja: 左にタッチ
ru: Коснитесь влево

source: Tough right
ar: اليمين الصارم
ja: タフな右
ru: Крепкий справа

source: The following actions are available for each gesture:
ar: الإجراءات التالية متاحة لكل إيماءة:
ja: 各ジェスチャーでは、以下のアクションを使用できます。
ru: Для каждого жеста доступны следующие действия:

source: No action
ar: لا يوجد إجراء
ja: アクションなし
ru: Без действий

source: Don't do anything. Useful if you want to disable certain swipes, tap zones and so on.
ar: لا تفعل أي شيء. مفيد إذا كنت ترغب في تعطيل بعض السحابات، انقر فوق مناطق وما إلى ذلك.
ja: 何もしないでください。特定のスワイプ、ゾーンをタップするなどを無効にしたい場合に便利です。
ru: Не делайте ничего. Полезно, если вы хотите отключить определенные свайпы, нажмите зоны и так далее.

source: Answer button 1
ar: زر الإجابة 1
ja: 回答ボタン1
ru: Кнопка ответа 1

source: When the answer screen is shown, choose the red button, indicating you wish to review the card again soon. This is useful when you forgot a card or wish to review it more frequently. When the question is shown, this action (and all other answer actions below) will simply show the answer.
ar: عندما تظهر شاشة الإجابة، اختر الزر الأحمر، مشيرا إلى رغبتك في مراجعة البطاقة مرة أخرى قريبا. هذا مفيد عندما نسيت البطاقة أو ترغب في مراجعتها بشكل أكثر تواترا. وعندما يطرح السؤال، فإن هذا الإجراء (وجميع إجراءات الإجابة الأخرى أدناه) سيظهر الإجابة ببساطة.
ja: 解答画面が表示されたら、すぐにカードを再確認したいことを示す赤いボタンを選択します。 これは、カードを忘れたり、より頻繁に確認したい場合に便利です。 質問が表示されるとき、このアクション (および以下のすべての回答アクション) は単に答えを表示します。
ru: Когда экран ответа показывается, выберите красную кнопку, указав на то, что вы хотите просмотреть карту еще раз в ближайшее время. Это полезно, когда вы забыли карту или хотите ее чаще просматривать. Когда показывается вопрос, это действие (и все другие действия ниже) просто покажет ответ.

source: Answer button 2
ar: زر الإجابة 2
ja: 回答ボタン2
ru: Кнопка ответа 2

source: When the answer screen is shown, choose the second button from the left, generally indicating you found the card hard to remember.
ar: عندما تظهر شاشة الإجابة، اختر الزر الثاني من اليسار، مما يشير بشكل عام إلى أنه من الصعب تذكر البطاقة.
ja: 解答画面が表示されたら、左から2番目のボタンを選択します。一般的には覚えにくいカードを見つけたことを示します。
ru: Когда показывается экран ответа, выберите вторую кнопку слева, как правило, указывая, что карта трудно запомнить.

source: Answer button 3
ar: زر الإجابة 3
ja: 回答ボタン3
ru: Кнопка ответа 3

source: When the answer screen is shown, choose the third button from the left.
ar: عندما تظهر شاشة الإجابة، اختر الزر الثالث من اليسار.
ja: 解答画面が表示されたら、左から3番目のボタンを選択します。
ru: Когда отображается экран ответа, выберите третью кнопку слева.

source: Answer button 4
ar: زر الإجابة 4
ja: 回答ボタン4
ru: Кнопка ответа 4

source: When the answer screen is shown, choose the fourth button from the left (when applicable).
ar: عند عرض شاشة الإجابة، اختر الزر الرابع من اليسار (عند الانطباق).
ja: 解答画面が表示されたら、左(該当する場合)から4番目のボタンを選択します。
ru: Когда отображается экран ответа, выберите четвертую кнопку слева (когда это применимо).

source: Answer recommended (green)
ar: الإجابة الموصى بها (أخضر)
ja: おすすめの回答 (緑)
ru: Ответ рекомендован (зеленый)

source: When the answer screen is shown, choose the green button. This is the button you should end up using the most.
ar: عندما تظهر شاشة الإجابة، اختر الزر الأخضر. هذا هو الزر الذي يجب أن ينتهي بك الأمر أكثر من غيره.
ja: 答え画面が表示されたら、緑のボタンを選択します。これが一番多く使うべきボタンです。
ru: Когда отображается экран ответа, выберите зеленую кнопку. Это кнопка, которую вы должны в конечном итоге использовать больше всего.

source: Answer better than recommended
ar: الإجابة أفضل من الموصى به
ja: 推奨よりも良く回答する
ru: Ответить лучше, чем рекомендовано

source: When the answer screen is shown, choose the button on the right, indicating you found the card too easy to remember and would like a much longer delay.
ar: عندما تظهر شاشة الإجابة، اختر الزر على اليمين، تشير إلى أنك وجدت البطاقة سهلة جدا للتذكر، وترغب في تأخير أطول بكثير.
ja: 解答画面が表示されたら、右側のボタンを選択します カードを覚えやすすぎることを示してくれるか?
ru: Когда отображается экран ответа, выберите кнопку справа, указав на то, что карта слишком легко запомнить и она хотела бы намного дольше.

source: Undoes the last action.
ar: التراجع عن الإجراء الأخير.
ja: 最後の操作を元に戻します。
ru: Отменить последнее действие.

source: Edit card
ar: تحرير البطاقة
ja: カードを編集
ru: Изменить карту

source: Edits the current card.
ar: يعدل البطاقة الحالية.
ja: カードを編集します。
ru: Редактировать текущую карту.

source: Mark
ar: علّم
ja: マーク
ru: Отметить

source: Adds a tag called **Marked** the current note, so it can be easily found in a search.
ar: يضيف علامة تسمى **علامة** الملاحظة الحالية، بحيث يمكن العثور عليها بسهولة في البحث.
ja: 現在のノートに **Marked** というタグを追加することで、検索で簡単に見つけることができます。
ru: Добавляет тег **Marked** текущую заметку, так что её легко найти в поиске.

source: Lookup expression
ar: بحث عن التعبير
ja: ルックアップ式
ru: Выражение поиска

source: When the lookup feature is enabled (in advanced settings), lookup an expression in the selected dictionary. Note: the expression needs to be copied to the clipboard before this action will work.
ar: عند تمكين ميزة البحث (في الإعدادات المتقدمة)، ابحث عن تعبير في القاموس المحدد. ملاحظة: يجب نسخ التعبير إلى الحافظة قبل أن يعمل هذا الإجراء.
ja: 検索機能が(高度な設定で)有効になっている場合、選択した辞書で式を検索します。 注意: このアクションが動作する前に、式をクリップボードにコピーする必要があります。
ru: Когда функция поиска включена (в расширенных настройках), поиск выражения в выбранном словаре. Примечание: выражение должно быть скопировано в буфер обмена, прежде чем это действие будет работать.

source: Bury card
ar: بطاقة دفن
ja: カードを削除
ru: Жуткая карта

source: Hides the current card from review.
ar: إخفاء البطاقة الحالية من المراجعة.
ja: 現在のカードをレビューから隠します。
ru: Скрывает текущую карточку от проверки.

source: Suspend card
ar: تعليق البطاقة
ja: カードを一時停止する
ru: Приостановить карту
