Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Add Crop image feature
ar: إضافة ميزة صورة القطع
ja: 画像のトリミング機能を追加
ru: Добавить обрезку изображения

source: Add Preview in note editor
ar: إضافة معاينة في محرر الملاحظة
ja: ノートエディタにプレビューを追加
ru: Добавить предварительный просмотр в редакторе заметок

source: Add edit tags in reviewer
ar: إضافة تعديل العلامات في المستعرض
ja: レビューアに編集タグを追加
ru: Добавить теги в рецензент

source: Add volume buttons as gestures
ar: إضافة أزرار الصوت كإيماءات
ja: ボリュームボタンをジェスチャーとして追加
ru: Добавить кнопки громкости как жесты

source: Add whiteboard pen color
ar: إضافة لون لقلم الحافظة البيضاء
ja: ホワイトボードペンの色を追加
ru: Добавить цвет пера

source: Add microphone tool bar in reviewer
ar: إضافة شريط أدوات الميكروفون في المستعرض
ja: レビューアにマイクツールバーを追加
ru: Добавить панель инструментов микрофона в рецензент

source: Add javascript API (check the Wiki!)
ar: إضافة API جافا سكريبت (تحقق من ويكي!)
ja: javascript API を追加します(Wikiを確認してください!)
ru: Добавить javascript API (проверьте Wiki!)

source: Improve: app is 3MB smaller
ar: تحسين: التطبيق أصغر من 3 ميغابايت
ja: 改善:アプリが3MB小さいです
ru: Улучшение: приложение меньше на 3 МБ

source: Fix: show whole tag in tags dialog
ar: إصلاح: إظهار العلامة الكاملة في مربع حوار العلامات
ja: 修正: タグダイアログにタグ全体を表示する
ru: Исправлено: отображать весь тег в диалоге тегов

source: Fix copy note copies tags too
ar: إصلاح نسخ علامات نسخ الملاحظة أيضا
ja: コピーノートのコピータグも修正する
ru: Исправьте также теги копирования заметок

source: Fix data corruption canceling template edits
ar: إصلاح تعديلات قالب إلغاء الفساد في البيانات
ja: データ破損のキャンセルテンプレートの編集
ru: Исправлена ошибка отмены шаблонов

source: performance and bug fixes everywhere!
ar: اصلاح الاداء و الأخطاء في كل مكان!
ja: あらゆる場所でパフォーマンスとバグ修正!
ru: исправления производительности и ошибок везде!

source: 11 volunteers made hundreds of individual changes this release
ar: 11 متطوعا أجروا مئات التغييرات الفردية لهذا الإصدار
ja: 今回のリリースでは11人のボランティアが何百もの個別の変更を行いました
ru: 11 добровольцев сделали сотни отдельных изменений в этом релизе

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/18?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/18?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/18?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/18?closed=1)

source: Version 2.11.3 (2020-06-17)
ar: النسخة 2-1-3 (2020-06-17)
ja: バージョン 2.11.3 (2020-06-17)
ru: Версия 2.11.3 (2020-06-17)

source: Fix out-of-memory errors when importing very large decks
ar: إصلاح أخطاء خارج الذاكرة عند استيراد طواقم كبيرة جدا
ja: 非常に大きなデッキのインポート時にメモリ不足エラーを修正しました。
ru: Исправлены ошибки при импорте очень больших колод

source: Fix incorrect out-of-space message on import in Android 4
ar: إصلاح رسالة غير صحيحة خارج الفضاء عند الاستيراد في أندرويد 4
ja: Android 4でインポート時の間違った空き領域のメッセージを修正しました
ru: Исправлено неверное сообщение за пределами места при импорте в Android 4

source: Fix crash if card viewer closed quickly after view
ar: إصلاح الأعطال إذا تم إغلاق عارض البطاقة بسرعة بعد العرض
ja: カードビューアーが表示後すぐに閉じた場合にクラッシュを修正する
ru: Исправлен сбой при быстром закрытии карты после просмотра

source: Fix unzip fail on .apkg files >2GB
ar: إصلاح فشل فك الضغط على ملفات .apkg >2GB
ja: .apkgファイル>2GBで解凍に失敗する修正
ru: Исправлена ошибка распаковки на файлах .apkg >2GB

source: Fix crash on edit note in browser multi-select
ar: إصلاح الأعطال عند تحرير الملاحظة في المتصفح متعدد التحديد
ja: ブラウザの複数選択で編集ノートがクラッシュするのを修正
ru: Исправлена ошибка при редактировании заметки в множественном списке браузера

source: Version 2.11.2 (2020-06-10)
ar: الإصدار 2-12-2 (2020-06-10)
ja: バージョン 2.11.2 (2020-06-10)
ru: Версия 2.11.2 (2020-06-10)

source: Add santali language
ar: إضافة لغة santali
ja: santali語を追加
ru: Добавить язык santali

source: Fix Hebrew, Indonesian, Tagalog languages
ar: إصلاح اللغات العبرية والإندونيسية والتاغالوغ
ja: ヘブライ語、インドネシア語、タガログ語を修正
ru: Исправить иврит, индонезийский, тагалогские языки

source: Improve error reporting around apkg import failures
ar: تحسين الإبلاغ عن الأخطاء حول فشل استيراد apkg
ja: apkg のインポート失敗に関するエラー報告を改善する
ru: Улучшена отчетность об ошибках импорта apkg

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/24?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/24?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/24?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/24?closed=1)

source: Version 2.11.1 (2020-06-08)
ar: الإصدار 2.11.1 (2020-06-08)
ja: バージョン 2.11.1 (2020-06-08)
ru: Версия 2.11.1 (2020-06-08)

source: Fix crash in Card Browser multi-select mode
ar: إصلاح الأعطال في وضع تعدد المحددات لمتصفح البطاقة
ja: カードブラウザの複数選択モードでクラッシュを修正
ru: Исправлен сбой в режиме мульти-выбора карты

source: Fix Custom Steps interval dialog space entry issue
ar: إصلاح الفاصل الفاصل الزمني لخطوات معينة
ja: カスタムステップ間隔ダイアログのスペース入力の問題を修正
ru: Исправлена проблема ввода в диалоговом окне пользовательских шагов

source: Fix flags don't export with deck
ar: إصلاح الأعلام التي لا تصدّرها على مجموعة
ja: デッキでフラグがエクスポートされない問題を修正
ru: Исправление флагов не экспортируется с помощью колоды

source: Fix AnkiDroid API doesn't handle null model id (Anki Compatibility workaround)
ar: إصلاح API AnkiDroid لا يتعامل مع معرف النموذج الفارغ (عمل التوافق الأنكي)
ja: AnkiDroid API が null モデル ID を扱わない問題を修正しました (Anki 互換性のある回避策)
ru: Исправлена ошибка AnkiDroid API не обрабатывает идентификатор нулевой модели (Anki Compatibility workaround)

source: Fix translation crash in sync dialog in Azerbaijani
ar: إصلاح انهيار الترجمة في مربع حوار المزامنة في أذربيجان
ja: アゼルバイジャン語の同期ダイアログでの翻訳クラッシュを修正
ru: Исправлена ошибка перевода в синхронном диалоге на Азербайджане

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/23?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/23?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/23?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/23?closed=1)

source: Version 2.11.0 (2020-06-05)
ar: الإصدار 2.11.0 (2020-06-05)
ja: バージョン 2.11.0 (2020-06-05)
ru: Версия 2.11.0 (2020-06-05)

source: Android minimum supported version is now 4.1 / Jelly Bean / API16 (AnkiWeb Compatibility)
ar: اصدار الاندرويد الأدنى المدعوم هو الآن 4.1 / جيلي بيان / API16 (توافقي الانكيويب)
ja: Android 最小対応バージョンが 4.1 / Jelly Bean / API16 になりました (AnkiWeb 互換性)
ru: Минимальная поддерживаемая версия Android 4.1 / Jelly Bean / API16 (AnkiWeb совместимость)

source: Change sibling burying should default to off (Anki Compatibility)
ar: تغيير دفن الأخوة يجب أن يكون افتراضياً (توافق أنكي)
ja: 兄弟の埋葬をデフォルトでオフにする必要があります変更（Anki互換性）
ru: Изменить спящее пятно по умолчанию выкл (Anki Compatibility)

source: Change learn cards do not go in filtered decks in v1 sched (Anki Compatibility)
ar: تغيير بطاقات التعلم لا يذهب في أسطح التصفية في v1 شطر (توافق أنكي)
ja: 学習カードを変更しても、フィルタリングされたデッキには入れません (アンキ互換性)
ru: Изменение карт обучения не входит в отфильтрованные колоды в v1 sched (Anki Compatibility)

source: Add Browser Appearance screen, to edit Card Browser render format (Anki Compatibility)
ar: إضافة شاشة مظهر المتصفح، لتحرير تنسيق عرض متصفح البطاقة (توافقي)
ja: ブラウザの表示画面を追加し、カードの表示形式を編集する(Anki Compatibility)
ru: Добавить экран «Внешний браузер», чтобы редактировать формат отображения карты браузера (совместимость с Anki)

source: Add guidance in Note Editor if no cards will be generated despite full fields
ar: إضافة إرشادات في محرر الملاحظات إذا لم يتم إنشاء بطاقات على الرغم من الحقول الكاملة
ja: フルフィールドにもかかわらずカードが生成されない場合は、メモエディタでガイダンスを追加してください
ru: Добавить руководство в редактор примечаний, если карты не будут создаваться несмотря на полные поля

source: Add all translations from our crowdin.com translation site
ar: إضافة جميع الترجمات من موقع ترجمة crowdin.com
ja: crowdin.comの翻訳サイトからすべての翻訳を追加
ru: Добавить все переводы с нашего сайта перевода crowdin.com

source: Add ability to decrease daily limit in custom study (Anki Compatibility)
ar: إضافة القدرة على تقليل الحد اليومي في الدراسة المخصصة (توافق أنكي)
ja: カスタムスタディの1日の制限を減らす機能を追加します（アンキ互換性）
ru: Добавить возможность уменьшить дневной лимит обучения (совместимость с Anka)

source: Add ability to block gesture handling when tapping hints in Reviewer
ar: إضافة القدرة على منع التعامل مع الإيماءات عند النقر على تلميحات في المستعرض
ja: レビューアでヒントをタップしたときにジェスチャーの処理をブロックする機能を追加します
ru: Добавить возможность блокировать обработку жестов при нажатии на подсказки в редакторе

source: Add create subdeck option in deck list long-press context menu
ar: إضافة خيار إنشاء مجموعة فرعية في قائمة قائمة المجموعة الضغط المطول على قائمة السياق
ja: デッキリストの長押しコンテキストメニューにサブデッキ作成オプションを追加する
ru: Добавить опцию создания подколоды в контекстном меню списка пачки

source: Add edit note action in Card Browser multi-select mode
ar: إضافة إجراء ملاحظة التعديل في وضع تعدد المحددات لمتصفح البطاقة
ja: カードブラウザの複数選択モードでノートを編集するアクションを追加
ru: Добавить действие для редактирования заметки в режиме мульти-выбора карты

source: Add ability to turn off 'Card Browser' system text context menu item
ar: إضافة القدرة على إيقاف "متصفح البطاقة" نص عنصر قائمة السياق للنظام
ja: 「カードブラウザ」システムテキストコンテキストメニュー項目をオフにする機能を追加
ru: Добавить возможность отключать контекстное меню 'Card Browser'

source: Add nightMode CSS selector for card HTML (Anki Compatibility)
ar: إضافة محدد CSS للوضع الليلي لبطاقة HTML (توافق أنكي)
ja: カードHTMLにナイトモードCSSセレクターを追加（アンキ互換）
ru: Добавить ночной селектор CSS для карты HTML (совместимость с Anka)

source: Add ability to change just the case of a deck name
ar: إضافة القدرة على تغيير حالة اسم المجموعة فقط
ja: デッキ名の場合だけを変更する機能を追加
ru: Добавить возможность изменять только имя колоды

source: Add page-up/page-down gestures
ar: إضافة إيماءات لصفحة أعلى/صفحة أسفل
ja: ページアップ/ページダウンジェスチャーを追加
ru: Добавить жесты страницы вверх/вниз

source: Improve gesture handling in full-screen / immersive mode
ar: تحسين التعامل مع الإيماءات في وضع ملء الشاشة / الغمر
ja: 全画面表示/没入モードでジェスチャーの処理を改善
ru: Улучшить обработку жестов в полноэкранном / полноэкранном режиме

source: Improve handling of cloze deletion in TTS mode
ar: تحسين التعامل مع حذف الملابس في وضع TTS
ja: TTSモードでのクローズ削除の処理を改善
ru: Улучшить обработку удаления клея в режиме TTS

source: Improve Card Browser search from Android text selection menu
ar: تحسين البحث في مستعرض البطاقة من قائمة اختيار نص الأندرويد
ja: Androidのテキスト選択メニューからカードブラウザ検索を改善する
ru: Улучшить поиск карт в текстовом меню Android

source: Improve Card Browser with default hide of media filenames
ar: تحسين متصفح البطاقة بإخفاء إفتراضي لأسماء ملفات الوسائط
ja: メディアファイル名のデフォルト非表示でカードブラウザを改善する
ru: Улучшить обозреватель карт со скрытием по умолчанию имен медиафайлов

source: Improve Reviewer auto-advance by waiting for TTS to finish
ar: تحسين المراجعة التلقائية من خلال الانتظار حتى ينتهي ملف TTS
ja: TTSが終了するのを待つことでレビューアを自動的に進めるようにします
ru: Улучшить автопрослушивание рецензента, ожидая завершения работы рецензента

source: Improve transparent SVG display in night mode with white background
ar: تحسين عرض SVG شفاف في الوضع الليلي مع خلفية بيضاء
ja: 白背景で夜間モードで透明なSVG表示を改善
ru: Улучшить прозрачный SVG отображение в ночном режиме с белым фоном

source: Improve anki package import handling
ar: تحسين مناولة استيراد الحزم
ja: ankiパッケージのインポート処理を改善
ru: Улучшить обработку импорта пакетов anki

source: Improve AnkiWeb login form enter button handling
ar: تحسين نموذج تسجيل دخول AnkiWeb
ja: AnkiWebログインフォーム入力ボタンの処理を改善します
ru: Улучшить обработку кнопки ввода AnkiWeb

source: Improve hardware back button handling in restore from backup
ar: تحسين معالجة زر عودة العتاد في الاستعادة من النسخة الاحتياطية
ja: バックアップから復元する際のハードウェアバックボタンの処理を改善する
ru: Улучшить обработку аппаратных кнопок в восстановлении из резервной копии

source: Improve Reviewer display of un-rendered LaTeX
ar: تحسين عرض المراجعة اللاتيكس غير المجهزة
ja: 未レンダリングLaTeXの査読者表示を改善する
ru: Улучшить отображение неотрисованного LaTeX рецензента

source: Improve TTS / auto-answer combination, wait for TTS before advance
ar: تحسين تركيبة TTS / الرد التلقائي، انتظر إلى TTS قبل التقدم
ja: TTS / 自動応答の組み合わせを改善し、TTSが進むまで待ちます
ru: Улучшить комбинацию речи / автоматического ответа, дождаться TTS до начала

source: Workaround Firefox open downloaded deck bug
ar: تشغيل Firefox فتح خطأ في المجموعة المحملة
ja: Firefoxのダウンロードしたデッキのバグを回避する
ru: Обработка Firefox откроет ошибку загруженной колоды

source: Workaround crash on Samsung devices with >500 deck reminders
ar: تحطم العمل على أجهزة سامسونج مع أكثر من 500 تذكير على سطح السفينة
ja: 500以上のデッキリマインダーを持つサムスンのデバイスでのクラッシュ回避策
ru: Ошибок на устройствах Samsung с помощью напоминаний колоды >500

source: Fix card template editor mistakenly allowing add template on cloze type
ar: إصلاح محرر قالب البطاقة خطأ للسماح بإضافة قالب على نوع القالب
ja: カードテンプレートエディタを間違ってクローズタイプにテンプレートを追加できるように修正しました
ru: Исправлена ошибка в редакторе шаблонов карт, позволяющая добавлять шаблон на заклинание типа

source: Fix language change preference
ar: إصلاح تفضيل تغيير اللغة
ja: 言語の変更設定を修正
ru: Исправить настройки изменения языка

source: Fix ability to unbury a deck in deck list
ar: إصلاح القدرة على فك دفن مجموعة في قائمة المجموعة
ja: デッキ一覧でデッキをアンベリーにする機能を修正
ru: Исправлена возможность отключения колоды в списке колод

source: Fix app bar item flicker during review
ar: إصلاح عنصر شريط التطبيقات المتقطع أثناء المراجعة
ja: レビュー中にアプリバーのアイテムがちらつきを修正
ru: Исправление мерцания элементов панели приложений во время обзора

source: Fix V2 scheduler learning card count after undo
ar: إصلاح جدولة V2 عدد بطاقات التعلم بعد التراجع
ja: 取り消し後のV2スケジューラ学習カード数を修正
ru: Исправить количество планировщиков карт V2 после отмены

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/13?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/13?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/13?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/13?closed=1)

source: Version 2.10.4 (2020-05-31)
ar: الإصدار 2.10-4 (2020-05-31)
ja: バージョン 2.10.4 (2020-05-31)
ru: Версия 2.10.4 (2020-05-31)

source: Workaround expired AnkiWeb SSL Root certificate
ar: انتهت صلاحية شهادة جذر AnkiWeb SSL
ja: 期限切れのAnkiWeb SSL ルート証明書
ru: Корневой сертификат AnkiWeb SSL устарел

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/22?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/22?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/22?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/22?closed=1)

source: Version 2.10.3 (2020-05-29)
ar: الإصدار 2.10-3 (2020-05-29)
ja: バージョン 2.10.3 (2020-05-29)
ru: Версия 2.10.3 (2020-05-29)

source: Fix crash on no permissions on Card Browser system text menu entry
ar: إصلاح الأعطال على عدم وجود أذونات في قائمة نص نظام متصفح البطاقة
ja: カードブラウザシステムテキストメニューエントリでの権限がない時のクラッシュを修正
ru: Исправление сбоя при отсутствии разрешений на ввод в текстовое меню Card Browser

source: Fix crash in widget if external storage unmounts
ar: إصلاح الانهيار في عنصر واجهة المستخدم إذا تم إلغاء تحميل وحدة التخزين الخارجية
ja: 外部ストレージのアンマウント時にウィジェットのクラッシュを修正
ru: Исправлен сбой виджета при размонтировании внешнего накопителя

source: Fix crash on device reboot if no permissions
ar: إصلاح الأعطال عند إعادة تشغيل الجهاز إذا لم تكن هناك أذونات
ja: 許可がない場合、端末の再起動時にクラッシュする問題を修正
ru: Исправлен сбой при перезагрузке устройства, если нет разрешения

source: Fix crash if deck picker background image too large
ar: إصلاح الانهيار إذا كانت صورة منتقي المجموعة في الخلفية كبيرة جداً
ja: デッキピッカーの背景画像が大きすぎる場合にクラッシュを修正
ru: Исправлен сбой, если фоновое изображение палубы слишком велико

source: Fix crash in tags dialog
ar: إصلاح الانهيار في مربع حوار العلامات
ja: タグダイアログでクラッシュする問題を修正
ru: Исправлен сбой в диалоге тегов

source: Fix bad data generated for null objects (Anki compatibility)
ar: إصلاح البيانات السيئة التي تم إنشاؤها لأجسام فارغة (توافق أنكي)
ja: null オブジェクトで生成された不正なデータを修正（Ankiとの互換性）
ru: Исправлена ошибка сгенерированных данных для нулевых объектов (совместимость с Anka)

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/21?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/21?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/21?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/21?closed=1)

source: Version 2.10.2 (2020-05-14)
ar: الإصدار 2.10.2 (2020-05-14)
ja: バージョン 2.10.2 (2020-05-14)
ru: Версия 2.10.2 (2020-05-14)

source: Fix type answer cards not rendering correctly
ar: إصلاح نوع بطاقات الإجابة التي لا تقدم بشكل صحيح
ja: 正しくレンダリングされていないタイプの回答カードを修正
ru: Исправить тип карт ответа неправильно

source: Fix type answer card template creation on non-English new installs
ar: إصلاح نوع إنشاء قالب بطاقة الإجابة على التثبيت الجديد غير الإنجليزية
ja: 英語以外の新しいインストールでのタイプの解答カードテンプレートの作成を修正
ru: Исправить создание шаблона карты ответа на неанглийском языке

source: Fix frequent full sync caused by incorrect learning card counts
ar: إصلاح المزامنة الكاملة المتكررة الناجمة عن عدد بطاقات التعلم الغير صحيحة
ja: 間違った学習カード数による頻繁な完全同期を修正
ru: Исправлена частчая полная синхронизация, вызванная неправильным счетом карт обучения

source: Fix crash importing into fresh install with no storage permission
ar: إصلاح تحطم الاستيراد إلى تثبيت طازج بدون إذن تخزين
ja: ストレージの許可なしで新たなインストールへのクラッシュのインポートを修正しました。
ru: Исправлен импорт сбоя в свежую установку без разрешения на хранилище

source: Version 2.10.1 (2020-05-13)
ar: الإصدار 2.10.1 (2020-05-13)
ru: Версия 2.10.1 (2020-05-13)

source: Updated all translations from crowdin translators
ar: تحديث جميع الترجمات من مترجمي crowdin
ja: crowdin翻訳者からすべての翻訳を更新しました
ru: Обновлены все переводы от переводчиков

source: Fix crash note editor on rapid back button
ar: إصلاح محرر ملاحظات الانهيار على زر العودة السريعة
ja: クイック戻るボタンでクラッシュノートエディタを修正
ru: Исправлена ошибка редактора заметок на быстрой кнопке "Назад"

source: Fix crash from incorrect Thai translation
ar: إصلاح الانهيار من ترجمة تايلاندية غير صحيحة
ja: 間違ったタイ語翻訳によるクラッシュを修正
ru: Исправлен сбой в результате неправильного тайского перевода

source: Version 2.10 (2020-05-12)
ar: الإصدار 2.10 (2020-05-12)
ru: Версия 2.10 (2020-05-12)

source: Add welcome dialog explaining need for storage permission
ar: إضافة مربع حوار ترحيبي يشرح الحاجة إلى إذن التخزين
ja: ストレージ権限の必要性を説明するウェルカムダイアログを追加
ru: Добавить приветственный диалог, объясняющий потребность в разрешении на хранение

source: Add support for Flags on cards (including flagging by gesture)
ar: إضافة دعم للأعلام على البطاقات (بما في ذلك وضع علامة عن طريق الإيماء)
ja: カード上のフラグのサポートを追加 (ジェスチャーでフラグを含む)
ru: Добавить поддержку флагов в картах (в том числе с помощью жеста)

source: Add ability to set background image in Deck Picker
ar: إضافة القدرة على تعيين صورة الخلفية في منتقي المجموعة
ja: デッキピッカーで背景画像を設定する機能を追加
ru: Добавить возможность задать фоновое изображение в Выбор колоды

source: Add localization of standard templates created in fresh install
ar: إضافة توطين القوالب القياسية التي تم إنشاؤها في تثبيت جديد
ja: 新規インストールで作成された標準テンプレートのローカライズを追加
ru: Добавить локализацию стандартных шаблонов, созданных при свежей установке

source: Add support for card javascript to reload current card programmatically
ar: إضافة دعم لبطاقة جافا سكريبت لإعادة تحميل البطاقة الحالية برمجياً
ja: 現在のカードをプログラム的にリロードするカードjavascriptのサポートを追加
ru: Добавить поддержку карты javascript для программной перезагрузки текущей карты

source: Add support for restricted learning / classroom devices
ar: إضافة دعم لأجهزة التعلم / الفصل الدراسي المقيدة
ja: 制限付き学習/クラスルームデバイスのサポートを追加
ru: Добавить поддержку ограниченных устройств обучения / классов

source: Add preference to disable "Extended Text UI" full-screen editor
ar: إضافة تفضيل لتعطيل "واجهة المستخدم للنص الموسع" محرر ملء الشاشة
ja: 全画面エディタ「拡張テキストUI」を無効にする設定を追加
ru: Добавить предпочтение для отключения полноэкранного редактора "Расширенный текстовый интерфейс"

source: Add CSS style capability to heavy checkmark and down arrow in card
ar: إضافة قدرة على نمط CSS إلى علامة الفحص الثقيلة والسهم لأسفل في البطاقة
ja: カード内の重いチェックマークと下向きの矢印にCSSスタイル機能を追加
ru: Добавить возможность CSS стиля к тяжелым галочкам и стрелкам вниз в карте

source: Add display of current interval on reschedule dialog
ar: إضافة عرض الفاصل الزمني الحالي عند إعادة جدولة مربع الحوار
ja: リスケジュールダイアログで現在の間隔の表示を追加
ru: Добавить отображение текущего интервала в диалоге переноса

source: Add support for card javascript to answer cards programmatically
ar: إضافة دعم لبطاقة جافا سكريبت للإجابة على البطاقات البرمجية
ja: カードの javascript のサポートを追加してカードに応答する
ru: Добавить поддержку карточки javascript в ответ на карты программно

source: Add ability to toggle sticky field in field editor
ar: إضافة القدرة على تبديل الحقل المثبت في محرر الحقل
ja: フィールドエディタでStickyフィールドを切り替える機能を追加
ru: Добавить возможность переключения липкого поля в редакторе полей

source: Improve deck list newline, style, script tag handling in deck descriptions
ar: تحسين قائمة القائمة الجديدة للمجموعة، والأسلوب، والتعامل مع العلامات في وصف المجموعة.
ja: デッキの説明におけるデッキリストの改良、スタイル、スクリプトタグの処理を改善
ru: Улучшить список новострок, стиль, обработку скриптов в описаниях колоды

source: Improve whiteboard on/off state handling, especially between day/night mode
ar: تحسين التعامل مع لوحة التحكم البيضاء ، خاصة بين وضع النهار / الليل
ja: ホワイトボードのオン/オフ状態の処理を改善します。特に昼/夜モードの間です。
ru: Улучшение работы с белыми досками, особенно между днём/ночным режимом

source: Improve multi-selection options in CardBrowser
ar: تحسين خيارات الاختيار المتعدد في بطاقة المتصفح
ja: CardBrowser で複数選択オプションを改善する
ru: Улучшить настройки множественного выбора в CardBrowser

source: Improve performance (systematic optimization process, lots of improvements!)
ar: تحسين الأداء (عملية التحسين المنهجي، الكثير من التحسينات!)
ja: パフォーマンスの向上 (体系的な最適化プロセス、多くの改善!)
ru: Улучшить производительность (систематический процесс оптимизации, множество улучшений!)

source: Improve handling of erroneous notes (missing fields, improper clozes)
ar: تحسين التعامل مع الملاحظات الخاطئة (الحقول المفقودة، الملابس غير السليمة)
ja: 間違ったメモの取り扱いを改善する（不足しているフィールド、不適切なクローズ）
ru: Улучшить обработку ошибочных заметок (отсутствующих полей, неправильных замыканий)

source: Improve user messaging on network connection failures
ar: تحسين رسائل المستخدم عند فشل الاتصال بالشبكة
ja: ネットワーク接続に失敗した場合のユーザーメッセージングの改善
ru: Улучшить обмен сообщениями пользователей при сбоях подключения к сети

source: Improve counting of suspended/buried cards in advanced statistics
ar: تحسين عد البطاقات المعلقة/المدفونة في الإحصاءات المتقدمة
ja: 高度な統計情報の中断/埋込みカードのカウントを改善する
ru: Улучшен подсчет приостановленных/похороненных карт в расширенной статистике

source: Improve v2 scheduler compatibility with Anki ecosystem
ar: تحسين توافق الجدولة v2 مع النظام الإيكولوجي لأنكي
ja: Ankiエコシステムとのv2スケジューラの互換性を向上
ru: Улучшить совместимость планировщика v2 с экосистемой Anki

source: Improve handling / detection of full sync need
ar: تحسين المناولة / الكشف عن احتياجات المزامنة الكاملة
ja: 完全な同期の処理/検出を改善する
ru: Улучшить обработку / определение полной синхронизации

source: Improve Anki compatibility by allowing more field/model/deck name characters
ar: تحسين توافق أنكي عن طريق السماح بالمزيد من أحرف الحقل/النموذج/مجموعة الأسماء
ja: より多くのフィールド/モデル/デッキ名を可能にすることで、Ankiの互換性を向上させます
ru: Улучшение совместимости с Anki, позволяя больше символов имён поля/модели/колоды

source: Improve deck list estimated review times with human scale times
ar: تحسين فترات الاستعراض المقدرة لقائمة سطح السفينة بأوقات الجدول البشري
ja: 人間のスケール時間でデッキリストのレビュー時間の推定を改善する
ru: Улучшение списка палуб оценочное время обзора, в зависимости от количества людей
