Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Note Editor Toolbar: Apply Custom Commands (& keyboard shortcuts)
ar: شريط أدوات محرر الملاحظة: تطبيق الأوامر المخصصة (واختصارات لوحة المفاتيح)
ja: ノートエディタツールバー: カスタムコマンドを適用(キーボードショートカット)
ru: Панель инструментов редактора заметок: Применить пользовательские команды (и сочетания клавиш)

source: Note Editor: Paste to Insert Image
ar: محرر الملاحظة: لصق لإدراج صورة
ja: ノートエディタ: 画像を挿入する貼り付け
ru: Редактор заметки: Вставить изображение

source: Note Editor: Made fields full-width
ar: محرر الملاحظة: حقول مصنوعة من العرض الكامل
ru: Редактор заметки: создание полей полной ширины

source: Note Editor: Change Font Size for fields
ar: محرر الملاحظة: تغيير حجم الخط للحقول
ja: ノートエディタ: フィールドのフォントサイズを変更する
ru: Редактор заметок: Изменить размер шрифта для полей

source: Note Editor: Expand/Collapse Fields
ar: محرر الملاحظة: توسع/سقوط الحقول
ja: ノートエディタ: フィールドの展開/折りたたむ
ru: Редактор заметки: Развернуть/Свернуть поля

source: Note Editor: Clear Field button
ar: محرر الملاحظة: زر مسح الحقل
ja: メモエディタ: 項目クリアボタン
ru: Редактор заметки: Кнопка очистки поля

source: Note Editor: Ctrl+Shift+Num to switch fields
ar: محرر الملاحظة: Ctrl+Shift+Num لتبديل الحقول
ja: ノートエディタ: Ctrl+Shift+Num フィールドを切り替えます
ru: Редактор заметки: Ctrl+Shift+Num для переключения полей

source: Note Editor: Improved image addition / naming
ar: محرر الملاحظة: تحسين إضافة الصورة / التسمية
ja: メモエディタ: 画像の追加/命名の改善
ru: Редактор заметки: Улучшено добавление и именование изображения

source: Note Editor: Add preference to convert newline to HTML (or not)
ar: ملحوظة: إضافة تفضيل لتحويل الخط الجديد إلى HTML (أو لا)
ja: ノートエディタ: 改行を HTML に変換する(または変換しない)設定を追加します。
ru: Редактор заметки: Добавить предпочтение для преобразования новой строки в HTML (или нет)

source: OS Integration: Default to "Anki Card" in system context menu vs "Card Browser"
ar: تكامل نظام التشغيل: افتراضي إلى "بطاقة أنكي" في قائمة سياق النظام مقابل "متصفح البطاقة"
ja: OS 統合: システムコンテキストメニューの「Anki Card」と「カードブラウザ」のデフォルト
ru: Интеграция ОС: по умолчанию "Anki Card" в контекстном меню системы против "Card Browser"

source: Libanki: Add FileUpload API
ar: Libanki: أضف FileUloadad API
ja: Libani: FileUpload API の追加
ru: Libanki: Добавить API Файлов

source: Translations: Tagged screenshots on crowdin.com to help our translators
ar: الترجمات: لقطات الشاشة الموسومة على crowdin.com لمساعدة المترجمين لدينا
ja: 翻訳: crowdin.com でタグ付けされたスクリーン ショットを使用して翻訳者を支援する
ru: Переводы: Отмеченные скриншоты на crowdin.com, чтобы помочь нашим переводчикам

source: Stability: Fix rare crashes (down to ~50/day total w/1.8million installs!)
ar: الاستقرار: إصلاح الأعطال النادرة (أسفل إلى 50% يومياً!)
ja: 安定性: まれなクラッシュを修正しました（合計で1日あたり50万件までインストールできます！）
ru: Стабильность: Исправьте редкие аварии (всего до примерно 50 дней w/1.8 миллионов установок!)

source: Performance: massive number of speedups
ar: الأداء: عدد هائل من التسريعات
ja: パフォーマンス：スピードアップの大量数
ru: Производительность: большое количество ускорений

source: Dev: Massively sped up AnkiDroid builds and improved code readability
ar: Dev: تصاعد بشكل كبير في إصدارات أنكيدرويد وتحسين قابلية القراءة البرمجية
ja: 開発者：AnkiDroidのビルドを受動的に加速し、コードの可読性を向上させました
ru: Девиз: Масштабирование версий AnkiDroid и улучшенная читабельность кода

source: Totals: 345 code changes and hundreds of translations, made by volunteers, in 2 months
ar: المجموعات: 345 تغيير التعليمات البرمجية ومئات الترجمات التي قام بها المتطوعون، خلال شهرين
ja: 合計: 345 コードの変更と 2 ヶ月以内にボランティアによって作成された数百の翻訳。
ru: Итого: 345 изменений кода и сотен переводов, сделанных добровольцами, за 2 месяца

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/30?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/30?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/30?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/30?closed=1)

source: Version 2.13.5 (2020-10-03)
ar: الإصدار 2.13.5 (2020-10-03)
ja: バージョン 2.13.5 (2020-10-03)
ru: Версия 2.13.5 (2020-10-03)

source: Fix performance for fast (\<1s) answers in review
ar: إصلاح الأداء للإجابات السريعة (\<1s) في المراجعة
ja: レビュー中の高速回答のパフォーマンスを修正 (\<1s)
ru: Исправлена производительность для быстрых (\<1s) ответов в обзоре

source: Add links to new Arabic help/manual translation
ar: إضافة روابط إلى الترجمة العربية المساعدة/اليدوية الجديدة
ja: 新しいアラビア語のヘルプ/手動翻訳へのリンクを追加
ru: Добавить ссылки на новый арабский перевод справки/вручную

source: Add back button handling to changelog display
ar: إضافة معالجة زر الرجوع إلى عرض سجل التغييرات
ja: チェンジログ表示に戻るボタンの処理を追加
ru: Добавить кнопку "Назад" в список изменений

source: Add rate button to changelog
ar: إضافة زر تقييم إلى سجل التغييرات
ja: 更新履歴にレートボタンを追加
ru: Добавить кнопку курса в список изменений

source: Add warning message to handle future db upgrades
ar: إضافة رسالة تحذير للتعامل مع ترقيات db في المستقبل
ja: 今後のdbアップグレードを処理するための警告メッセージを追加する
ru: Добавить предупреждение для обработки будущих обновлений базы данных

source: Sync all translations from our volunteer translators (thanks everyone!)
ar: مزامنة جميع الترجمات من المترجمين المتطوعين (شكرا للجميع!)
ja: ボランティア翻訳者からのすべての翻訳を同期します（皆さんありがとうございます！）
ru: Синхронизировать все переводы от наших переводчиков (спасибо всем!)

source: Version 2.13.4 (2020-09-29)
ar: النسخة 2.13.4 (2020-09-29)
ja: バージョン 2.13.4 (2020-09-29)
ru: Версия 2.13.4 (2020-09-29)

source: Fix crash showing TagsDialog
ar: إصلاح الأعطال التي تظهر العلامات
ja: TagsDialog を表示するクラッシュを修正
ru: Исправлена ошибка, показывающая диалог тегов

source: Fix crash in gesture detection
ar: إصلاح تحطم في الكشف عن الإيماءات
ja: ジェスチャー検出時のクラッシュを修正
ru: Исправить ошибки при обнаружении жестов

source: Improve import interrupted error message
ar: تحسين رسالة الخطأ مقاطعة الاستيراد
ja: インポート中断エラーメッセージの改善
ru: Улучшение сообщения об ошибке импорта прервано

source: Fix scheduler counts after undo
ar: إصلاح جدولة العد بعد التراجع
ja: 元に戻した後のスケジューラ数を修正
ru: Исправить счетчик планировщика после отмены

source: Fix Card Browser preview after sort
ar: إصلاح معاينة مستعرض البطاقة بعد الفرز
ja: ソート後のカードブラウザのプレビューを修正
ru: Исправить предварительный просмотр карты после сортировки

source: Fix button display if answer animation incomplete
ar: إصلاح عرض الزر إذا كانت حركة الرد غير مكتملة
ja: 回答アニメーションが不完全な場合のボタンの表示を修正
ru: Исправлена кнопка отображения, если анимация ответа не завершена

source: Sync all translations
ar: مزامنة جميع الترجمات
ja: すべての翻訳を同期
ru: Синхронизировать все переводы

source: Version 2.13.3 (2020-09-23)
ar: الإصدار 2.13.3 (2020-09-23)
ja: バージョン 2.13.3 (2020-09-23)
ru: Версия 2.13.3 (2020-09-23)

source: Fix double-clicking answer buttons skipping cards
ar: إصلاح أزرار الإجابة بالنقر المزدوج لتخطي بطاقات
ja: カードをスキップしている答えボタンをダブルクリックして修正
ru: Исправьте двойной щелчок по кнопкам ответа при пропуске карт

source: Change missing media warning to twice-per-session not twice-per-deck
ar: تغيير تحذير الوسائط المفقودة إلى مرتين في كل جلسة وليس مرتين في كل سطح
ja: 不足しているメディア警告を、デッキごとに2回ではなくセッションごとに2回に変更する
ru: Изменить предупреждение о пропущенных средствах массовой информации на два раза в неделю

source: Change answer button fade on open
ar: تغيير زر الرد يتلاشى عند الفتح
ja: 解答ボタンを開いた時にフェードを変更する
ru: Изменить кнопку "Затухание" при открытии

source: Updated all translations from volunteer crowdin.com site up to 20200923
ar: تم تحديث جميع الترجمات من الموقع التطوعي crowdin.com حتى عام 20200923
ja: ボランティアの crowdin.com サイトのすべての翻訳を 20200923 まで更新しました
ru: Обновлены все переводы с сайта волонтера crowdin.com до 20200923

source: Version 2.13.2 (2020-09-19)
ar: النسخة 2-12-2 (2020-09-19)
ja: バージョン 2.13.2 (2020-09-19)
ru: Версия 2.13.2 (2020-09-19)

source: Fix Crash rare on Card Browser exit
ar: إصلاح الأعطال النادرة عند خروج متصفح البطاقة
ja: カードブラウザ終了時にクラッシュレアを修正
ru: Исправить ошибки при выходе Card Browser

source: Fix Crash Android 4.4
ar: إصلاح الاندرويد 4.4
ja: クラッシュアンドロイド4.4を修正
ru: Исправить срыв Android 4.4

source: Fix Open Deck failures / improve related messaging
ar: إصلاح فشل فتح المجموعة/تحسين المراسلة ذات الصلة
ja: オープンデッキの失敗を修正/関連メッセージングを改善
ru: Исправлены ошибки Open Deck / улучшить обмен сообщениями

source: Fix messaging for Xioami cloze workaround
ar: إصلاح الرسائل لمجرى عمل Xioami
ja: Xioami cloze の回避策のメッセージを修正
ru: Исправить сообщения для обоев Xioami

source: Move "set field language" after share on Note Editor context menu
ar: نقل "تعيين لغة الحقل" بعد المشاركة في قائمة سياق محرر الملاحظات
ja: ノートエディタのコンテキストメニューで共有の後に「フィールド言語を設定」を移動する
ru: Переместить «установить язык поля» после совместного использования в контекстном меню редактора примечаний

source: Version 2.13.1 (2020-09-17)
ar: الإصدار 2-13-1 (2020-09-17)
ja: バージョン 2.13.1 (2020-09-17)
ru: Версия 2.13.1 (2020-09-17)

source: Add cloze via clipboard paste workaround on MIUI/Xiaomi devices
ar: إضافة غلاف عن طريق ملصق الحافظة على أجهزة MIUI/Xiaomi
ja: MIUI/Xiaomi デバイスで回避策をクリップボードで貼り付けることでクローズを追加
ru: Добавить cloze через вставку буфера обмена на устройствах MIUI/Xiaomi

source: Fix Navigation drawer respects safe display / disable animations preference
ar: إصلاح درج التنقل يحترم العرض الآمن / تعطيل تفضيل الرسوم المتحركة
ja: ナビゲーションドロワーの尊重を安全な表示/アニメーションの設定を無効にする
ru: Исправить панель навигации уважает безопасное отображение / отключение анимации

source: Fix Reviewer buttons respect safe display / disable animations preference
ar: إصلاح أزرار المستعرض مع احترام العرض الآمن / تعطيل تفضيلات الرسوم المتحركة
ja: レビューアボタンを安全な表示を尊重/アニメーションの設定を無効に修正します。
ru: Исправить кнопки рецензента, уважать безопасный дисплей / отключить настройки анимации

source: Fix Deck Picker bottom bar opacity
ar: إصلاح عتامة منتقي المجموعة أسفل الشريط
ja: デッキピッカー下部バーの不透明度を修正
ru: Прозрачность нижней панели палубы

source: Fix Error message about missing content on cards
ar: إصلاح رسالة الخطأ حول المحتوى الناقص على البطاقات
ja: カードに不足しているコンテンツに関するエラーメッセージを修正しました。
ru: Исправлена ошибка сообщения об отсутствии содержимого в карточках

source: Fix crash selecting deck that disappears during sync
ar: إصلاح عطل اختيار المجموعة الذي يختفي أثناء المزامنة
ja: 同期中に消えるデッキを選択してクラッシュする問題を修正
ru: Исправлена ошибка выбора колоды, которая исчезает во время синхронизации

source: Version 2.13.0 (2020-09-15)
ar: الإصدار 2.13.0 (2020-09-15)
ja: バージョン 2.13.0 (2020-09-15)
ru: Версия 2.13.0 (2020-09-15)

source: Field tag (such as "{{Front}}") appearing in a note's field will be shown as-is in cards.
ar: سيتم عرض علامة الحقل (مثل "{{Front}}") التي تظهر في حقل النوتة كما هو في البطاقات.
ja: ノートのフィールドに表示されるフィールドタグ("{{Front}}"など)はカード内でそのまま表示されます。
ru: Тег поля (например, "{{Front}}") появился в поле примечания будет отображаться как в картах.

source: Add Sync icon badge when changes are pending sync (can be disabled in options)
ar: إضافة شارة رمز المزامنة عندما تكون التغييرات في انتظار المزامنة (يمكن تعطيلها في الخيارات)
ja: 保留中の同期時に同期アイコンバッジを追加 (オプションで無効にすることができます)
ru: Добавить значок синхронизации при изменениях в ожидании синхронизации (можно отключить в настройках)

source: Add Edit Note from card Preview while in Card Browser
ar: إضافة تعديل ملاحظة من معاينة البطاقة أثناء تشغيل متصفح البطاقة
ja: カードブラウザで、カードプレビューからノートを編集する
ru: Добавить примечание из предпросмотра карты в браузере карты

source: Add "Anki Card" to system context menu (like "Card Browser") - disabled by default
ar: إضافة "بطاقة أنكي" إلى قائمة سياق النظام (مثل "متصفح البطاقة") - معطل افتراضياً
ja: システムコンテキストメニュー（「カードブラウザ」など）に「Ankiカード」を追加する - デフォルトでは無効になっています
ru: Добавить "Anki Card" в контекстное меню (например "Card Browser") - отключено по умолчанию

source: Add Set keyboard language for specific fields in the note editor (example: one field Japanese, other field Portuguese for input).
ar: إضافة لغة لوحة المفاتيح لحقول محددة في محرر الملاحظات (مثال: حقل واحد لليابانيين، حقل آخر للبرتغالية للمدخلات).
ja: ノートエディタで特定のフィールドのキーボード言語を設定します(例:1フィールド日本語、他のフィールドポルトガル語入力)。
ru: Добавьте задание языка клавиатуры для конкретных полей в редакторе заметок (например: одно поле Японский, другое поле для ввода).

source: Add Keep keyboard open after adding a note
ar: إضافة لوحة المفاتيح مفتوحة بعد إضافة ملاحظة
ja: ノートを追加した後キーボードを開いたままにする
ru: Добавить сохранить открытую клавиатуру после добавления заметки

source: Add Card properties available in JavaScript API
ar: إضافة خصائص البطاقة المتوفرة في API جافا سكريبت
ja: JavaScript API で利用可能なカードのプロパティを追加
ru: Добавить свойства карты, доступные в JavaScript API

source: Add JavaScript API versioning for scripts (basis for future plugins)
ar: إضافة إصدار API جافا سكريبت للسكريبت (أساس الإضافات المستقبلية)
ja: スクリプトのJavaScriptのAPIバージョン管理を追加（将来のプラグインの基礎）
ru: Добавить версию JavaScript API для скриптов (основа для будущих плагинов)

source: Add Auto-Login when selecting saved user account
ar: إضافة تسجيل الدخول التلقائي عند تحديد حساب المستخدم المحفوظ
ja: 保存したユーザーアカウントを選択するときに自動ログインを追加
ru: Добавить Авто-Вход при выборе сохраненной учетной записи пользователя

source: Add Allow import of collection.anki21 files when under SchedV1
ar: إضافة السماح باستيراد ملفات collection.anki21 عندما تكون تحت SchedV1
ja: Schedv1 で collection.anki21 ファイルのインポートを許可する
ru: Добавить Разрешить импорт файлов collection.anki21 в соответствии с SchedV1

source: Add New screen for first-time users
ar: إضافة شاشة جديدة للمستخدمين لأول مرة
ja: 初めてのユーザーのための新しい画面を追加
ru: Добавить новый экран для пользователей впервые

source: Add Button animations when answering cards
ar: إضافة تأثير مؤثر عند الإجابة على البطاقات
ja: 応答カードにボタンアニメーションを追加する
ru: Добавить анимацию кнопок при ответе на карточки

source: Add Note Editor: Add shortcuts Ctrl+(Alt)+Shift+C to add a cloze.
ar: إضافة محرر الملاحظة: إضافة اختصارات Ctrl+(Alt)+Shift+C لإضافة مخبئ.
ja: ノートエディタを追加:ショートカットを追加するには、Ctrl+(Alt)+Shift+Cを追加します。
ru: Добавить редактор заметки: добавить ярлыки Ctrl+(Alt)+Shift+C, чтобы добавить заклинание.

source: Fix Some cards in learning were not shown at the right time (Only if you undo/bury/suspend/reset/reschedule and the next card goes to learning mode)
ar: إصلاح بعض البطاقات في التعلم لم يتم عرضها في الوقت المناسب (فقط إذا قمت بالتراجع/دفن/تعليق/إعادة تعيين/إعادة جدولة وتذهب البطاقة التالية إلى وضع التعلم)
ja: 学習中のいくつかのカードが正しいタイミングで表示されない問題を修正（元に戻す/bury/suspend/reset/rescheduleと次のカードが学習モードになっている場合にのみ）
ru: Исправьте некоторые карты в обучении не были показаны в нужное время (только если вы отмените/bury/suspend/reset/reschedule и следующая карта переходит в режим обучения)

source: Fix Selected deck has translucent background if a deck picker background is set
ar: إصلاح المجموعة المحددة لها خلفية شفافة إذا تم تعيين خلفية منتقي المجموعة
ja: デッキピッカーの背景が設定されている場合、選択したデッキの背景が半透明になります
ru: Исправлена проблема с полупрозрачным фоном, если установлен фон выбора колоды

source: Fix Improved preview screens
ar: إصلاح تحسين معاينة الشاشات
ja: プレビュー画面の改善を修正
ru: Исправлено улучшение экранов предварительного просмотра

source: Fix Better accessibility in Deck Browser for partially sighted users
ar: إصلاح إمكانية الوصول بشكل أفضل في متصفح مجموعة المستخدمين المبصرين جزئياً
ja: 部分的に晴眼者がデッキブラウザのアクセシビリティを改善する
ru: Исправлено улучшение доступности в обозревателе колоды для частично зрячих пользователей

source: Fix Improve visibility of "Add/Remove Option Group"
ar: إصلاح تحسين وضوح "إضافة/إزالة مجموعة الخيارات "
ja: 「オプショングループの追加/削除」の可視性向上を修正
ru: Исправлена видимость "Добавить/Удалить группу опций"

source: Fix Improved messages for sync rate limiting error
ar: إصلاح الرسائل المحسنة لمزامنة معدل الخطأ
ja: Fix 同期レート制限エラーの改善されたメッセージを修正
ru: Исправлена ошибка ограничения скорости сообщений

source: Fix Improved messages for reducing study limits
ar: إصلاح الرسائل المحسنة لتقليل حدود الدراسة
ja: 修正: 学習制限を減らすためのメッセージの改善
ru: Исправлена ошибка в сообщениях для снижения ограничений на обучение

source: Fix Improved messaging when collection is missing media
ar: إصلاح تحسين المراسلة عندما تكون المجموعة مفقودة الوسائط
ja: コレクションが不足している場合のメッセージングの改善を修正
ru: Исправлена ошибка сообщения при отсутствии данных в коллекции

source: Fix Improve feedback when accessing Debug Info
ar: إصلاح تحسين التعليقات عند الوصول إلى معلومات التصحيح
ja: デバッグ情報にアクセスする際のフィードバックの改善を修正
ru: Исправить улучшения обратной связи при доступе к Отладочной Инфо

source: Fix Add additional warnings to reschedule dialog
ar: إصلاح إضافة تحذيرات إضافية لإعادة جدولة مربع الحوار
ja: 追加の警告をリスケジュールダイアログに追加する
ru: Исправлено добавление дополнительных предупреждений к диалогу переноса

source: Fix Whiteboard pen color can be disabled by pressing icon again
ar: إصلاح لون القلم في الحافظة البيضاء يمكن تعطيله عن طريق الضغط على الرمز مرة أخرى
ja: ホワイトボードのペンの色を再度アイコンを押すと無効にできます
ru: Исправлено отключение цвета пера при повторном нажатии на значок

source: Fix Ensure all menu items in the reviewer can be customized by "App Bar Buttons" setting
ar: إصلاح جميع عناصر القائمة في المستعرض يمكن تخصيصها عن طريق إعداد "أزرار شريط التطبيق"
ja: Fix レビューア内のすべてのメニュー項目を「App Bar Buttons」設定でカスタマイズできるようにする
ru: Исправьте все пункты меню проверяющего могут быть настроены кнопками "Панель приложений"

source: Fix Scheduler discrepancy handling early interval on filtered decks
ar: إصلاح التباين في التعامل مع الفاصل الزمني المبكر على الأسطح المصفاة
ja: フィルタリングされたデッキの早期間隔を処理するスケジューラの不一致を修正
ru: Исправление несоответствий планировщика с ранним интервалом на отфильтрованных колодах

source: Fix Exports work when cards are missing media
ar: إصلاح عمل التصدير عندما تكون البطاقات مفقودة الوسائط
ja: メディアが不足している場合にエクスポートされる問題を修正
ru: Исправлена ошибка экспорта, когда карты отсутствуют

source: Fix Crash due to logging.
ar: إصلاح الأعطال بسبب تسجيل الدخول.
ja: ログによるクラッシュを修正しました。
ru: Исправлен сбой из-за ведения журнала.

source: Fix Toasts used to show one more card than the number of card actually reviewed during the time box
ar: إصلاح الطوابير المستخدمة لإظهار بطاقة واحدة أكثر من عدد البطاقة التي تم مراجعتها بالفعل خلال الإطار الزمني
ja: 時間ボックスの間に実際にレビューされたカードの数よりもカードを1枚多く表示するために使用されるトーストを修正
ru: Исправлена ошибка, позволяющая показать еще одну карту, чем количество фактически проверенных карт в окне времени

source: Fix Handle newlines properly in Note Editor Preview
ar: إصلاح الخطوط الإخبارية معالجة صحيحة في معاينة محرر المذكرة
ja: ノートエディタのプレビューで改行を正しく修正する
ru: Правильно исправить обработку новых строк в редакторе заметок

source: Fix Improve AnkiDroid opening animation
ar: إصلاح تحسين الرسوم المتحركة لفتح أنكيدرويد
ja: AnkiDroidのオープニングアニメーションを改善
ru: Исправлена анимация открытия AnkiDroid

source: Fix Show correct answer button when answering via Keyboard
ar: إصلاح إظهار زر الإجابة الصحيح عند الإجابة عبر لوحة المفاتيح
ja: キーボード経由で正解を表示するボタンを修正
ru: Исправлена кнопка правильного ответа при ответе через клавиатуру

source: Fix "New Cards Added" Statistic
ar: إصلاح إحصائيات "بطاقات جديدة مضافة"
ja: 「新しいカードが追加されました」統計を修正
ru: Статистика "Новые карты добавлены"

source: Fix Crash when inserting a cloze when selecting text from right-to-left via keyboard
ar: إصلاح الأعطال عند إدراج غلاف عند تحديد النص من اليمين إلى اليسار عبر لوحة المفاتيح
ja: キーボードで右から左へのテキストを選択するときに閉じる時のクラッシュを修正
ru: Исправлена ошибка при вставке замыкания при выборе текста справа налево с помощью клавиатуры

source: Fix "Show Password" icon revealing saved password
ar: إصلاح رمز "إظهار كلمة المرور" الذي يكشف كلمة المرور المحفوظة
ja: 保存したパスワードを表示する「パスワードを表示」アイコンを修正
ru: Исправлена иконка "Показать пароль" с сохраненным паролем

source: Fix Card browser still contains card after the app goes into background
ar: إصلاح متصفح البطاقة لا يزال يحتوي على بطاقة بعد دخول التطبيق إلى الخلفية
ja: アプリがバックグラウンドに入った後でもカードが残っているのを修正します。
ru: Браузер Карты все еще содержит карту после перехода приложения в фон

source: Fix Daily unbury occurs during sync if necessary
ar: إصلاح فك الدفن اليومي يحدث أثناء المزامنة إذا لزم الأمر
ja: 必要に応じて毎日のアンベリーが同期中に発生する問題を修正
ru: Исправлена ежедневная всплывающая синхронизация при необходимости

source: Fix On big screen, buttons moved during loading
ar: إصلاح على الشاشة الكبيرة، تم نقل الأزرار أثناء التحميل
ja: Fix On big screen, buttons moved during load
ru: Исправить на большом экране, кнопки перемещены во время загрузки

source: Translators If some text change because of minor changes (typos) you won't have to translate it again
ar: إذا تغير بعض المترجمين بسبب تغييرات طفيفة (typos) لن تحتاج إلى ترجمته مرة أخرى
ja: 翻訳 マイナーな変更(タイポ)によってテキストが変更された場合、再度翻訳する必要はありません。
ru: Переводчики, если какие-то изменения из-за незначительных изменений (опечатки), вам не придется переводить их снова

source: Performance improvements (specifically: initial loading of large collection (lot of decks, note type, card type, fields, long templates...), card browser, deck picker startup, next card view, undo, cancelling tasks such as computing a list of card in browser)
ar: تحسينات الأداء (تحديداً: التحميل الأولي للمجموعة الكبيرة (مجموعة الطوابق، نوع الملاحظة، نوع البطاقة، الحقول، القوالب الطويلة). .)، متصفح البطاقة، منتقي المجموعة، بدء التشغيل، عرض البطاقة التالي، التراجع، إلغاء مهام مثل حساب قائمة البطاقة في المتصفح)
ja: パフォーマンスの改善 (具体的には: 大規模なコレクションの初期ロード(デッキ、ノートタイプ、カードタイプ、フィールド、長いテンプレートの多く)。 .), カードブラウザ, デッキピッカーの起動, 次のカードビュー, 元に戻す, ブラウザでカードのリストを計算するなどのタスクをキャンセルします)
ru: Улучшение производительности (в частности, начальная загрузка большой коллекции (много колод, тип записи, тип карты, поля, длинные шаблоны. .), браузер карты, запуск выбора, следующий просмотр карты, отмена отмены, удаление задач, таких как вычисление списка карт в браузере)

source: Dev: Massive dev workflow improvements and automated checks for our translations.
ar: Dev: تحسينات كبيرة لتدفق العمل والتحقيقات الآلية لترجماتنا.
ja: 開発者:大規模な開発ワークフローの改善と翻訳の自動チェック。
ru: Девиз: Массивные улучшения рабочего процесса dev и автоматизированные проверки наших переводов.

source: Dev: Implement backend for CSV Importer
ar: Dev: تنفيذ الخلفية لمستورد CSV
ja: 開発者: CSV インポート用バックエンドを実装
ru: Dev: Реализация бэкэнда для CSV импорта

source: Dev: Improve crash reporting on app startup
ar: Dev: تحسين الإبلاغ عن الأعطال عند بدء تشغيل التطبيق
ja: 開発者: アプリの起動時のクラッシュレポートの改善
ru: Dev: Улучшить отчёт о сбоях при запуске приложения

source: Dev: Massive improvement in testing, especially around scheduler / card queue behavior
ar: Dev: تحسين كبير في الاختبار، وخاصة حول سلوك الجدول/قائمة انتظار البطاقات
ja: 開発者: テストにおける大幅な改善、特にスケジューラ/カードキューの動作について
ru: Девиз: Массивное улучшение тестирования, особенно вокруг поведения планировщика / очереди карт

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/27?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/27?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/27?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/27?closed=1)

source: Version 2.12.1 (2020-07-21)
ar: الإصدار 2.12(2020-07-21)
ja: バージョン 2.12.1 (2020-07-21)
ru: Версия 2.12.1 (2020-07-21)

source: Fix bug previewing edited notes after changing field count
ar: إصلاح مشكلة معاينة الملاحظات المعدلة بعد تغيير عدد الحقول
ja: フィールド数を変更した後に編集されたメモをプレビューするバグを修正
ru: Исправить предпросмотренные заметки после изменения количества полей

source: Fix crash previewing edited notes from dynamic decks
ar: إصلاح تعطل معاينة الملاحظات المعدلة من المجموعات الديناميكية
ja: 動的デッキから編集されたノートをクラッシュプレビューする問題を修正
ru: Исправлены ошибки при просмотре отредактированных заметок из динамических колод

source: Fix crash restarting app after a crash
ar: إصلاح تعطيل إعادة تشغيل التطبيق بعد تعطل
ja: クラッシュ後のクラッシュ再起動を修正
ru: Исправлен сбой при перезапуске приложения после сбоя

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/28?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/28?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/28?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/28?closed=1)

source: Version 2.12.0 (2020-07-18)
ar: الإصدار 2.12.0 (2020-07-18)
ja: バージョン 2.12.0 (2020-07-18)
ru: Версия 2.12.0 (2020-07-18)
