Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Prevent current card from being shown during review until you unsuspend it via the card browser.
ar: منع عرض البطاقة الحالية أثناء المراجعة حتى تقوم بإلغاء تعليقها عبر متصفح البطاقة.
ja: 現在のカードがレビュー中に表示されるのを防ぎます。カードブラウザで中断を解除します。
ru: Запретить отображать текущую карту во время проверки до тех пор, пока вы не разблокируете ее через браузер карты.

source: Deletes the currently shown note and all of its cards.
ar: يحذف الملاحظة المعروضة حاليا وجميع بطاقاتها.
ja: 現在表示されているノートとそのすべてのカードを削除します。
ru: Удаляет отображаемую заметку и все ее карты.

source: Play media
ar: تشغيل الوسائط
ja: メディアの再生
ru: Воспроизвести медиа

source: Replay any audio on the card.
ar: إعادة تشغيل أي صوت على البطاقة.
ja: カード上のオーディオを再生します。
ru: Повторить звук на карте.

source: Abort learning
ar: إلغاء التعلم
ja: 学習を中止する
ru: Прервать обучение

source: Stop reviewing and go back to the deck overview page.
ar: إيقاف المراجعة والعودة إلى صفحة نظرة عامة على المجموعة.
ja: レビューを停止し、デッキの概要ページに戻ります。
ru: Остановить проверку и вернуться на страницу обзора пачки.

source: Bury note
ar: ملاحظة دفن
ja: ノートを一時的に削除
ru: Заметка

source: Bury the current note (i.e. hide it until the next day).
ar: دفن الملاحظة الحالية (أي إخفائها حتى اليوم التالي).
ja: 現在のノートを閉じます (つまり、翌日まで非表示にします)。
ru: Приглушить текущую заметку (т.е. скрыть её до следующего дня).

source: Suspend note
ar: تعليق الملاحظة
ja: ノートを一時停止する
ru: Приостановить заметку

source: Suspend the current note (i.e. hide it until you unsuspend it).
ar: تعليق الملاحظة الحالية (أي إخفاء حتى تقوم بإلغاء تعليقها).
ja: 現在のノートを一時停止します(停止を解除するまで非表示にします)。
ru: Приостановить текущую заметку (т.е. скрыть ее до тех пор, пока вы не разблокируете).

source: Toggle Red Flag
ar: تبديل العلم الأحمر
ja: 赤旗の切り替え
ru: Красный флаг

source: Enables the red flag, unless the flag is already red, in which case the flag is disabled.
ar: تمكين العلم الأحمر، ما لم يكن العلم أحمر مسبقا، في هذه الحالة يتم تعطيل العلم.
ja: 既に赤色でない限り、赤色のフラグを有効にします。この場合、フラグは無効になります。
ru: Включает красный флаг, за исключением тех случаев, когда флаг уже красный, в этом случае флаг отключен.

source: Toggle Orange Flag
ar: تبديل العلم البرتقالي
ja: オレンジ色の旗の切り替え
ru: Оранжевый флаг

source: Enables the orange flag, unless the flag is already orange, in which case the flag is disabled.
ar: تمكين العلم البرتقالي، ما لم يكن العلم برتقالي بالفعل، وفي هذه الحالة يتم تعطيل العلم.
ja: フラグがすでにオレンジ色でない限り、オレンジ色のフラグを有効にします。この場合、フラグは無効になります。
ru: Включает оранжевый флаг, если флаг еще не оранжевый, в этом случае флаг отключен.

source: Toggle Green Flag
ar: تبديل العلم الأخضر
ja: グリーンフラグの切り替え
ru: Зеленый флаг

source: Enables the green flag, unless the flag is already green, in which case the flag is disabled.
ar: تمكين العلم الأخضر، إلا إذا كان العلم أخضر بالفعل، وفي هذه الحالة يتم تعطيل العلم.
ja: フラグがすでに緑色でない限り、この場合、フラグは無効になります。
ru: Включает зеленый флаг, если флаг не зелёный, и в этом случае флаг отключен.

source: Toggle Blue Flag
ar: تبديل العلم الأزرق
ja: 青旗の切り替え
ru: Синий флаг

source: Enables the blue flag, unless the flag is already blue, in which case the flag is disabled.
ar: تمكين العلم الأزرق، ما لم يكن العلم أزرق بالفعل، وفي هذه الحالة يتم تعطيل العلم.
ja: フラグがすでに青でない限り、青色のフラグを有効にします。この場合、フラグは無効になります。
ru: Включает синий флаг, если флаг не синий, и в этом случае флаг отключен.

source: Remove Flag
ar: إزالة العلم
ja: フラグを削除
ru: Удалить флаг

source: Removes the flag from the card.
ar: إزالة العلم من البطاقة.
ja: カードからフラグを削除します。
ru: Удаляет флаг с карты.

source: Advanced
ar: متقدم
ja: 高度な設定
ru: Расширенные

source: Some less common features for advanced users are shown here
ar: بعض الميزات الأقل شيوعاً للمستخدمين المتقدمين تظهر هنا
ja: 上級ユーザーのためのいくつかのあまり一般的ではない機能がここに表示されます
ru: Некоторые менее общие функции для опытных пользователей показаны здесь

source: Collection path
ar: مسار المجموعة
ja: コレクションのパス
ru: Путь коллекции

source: Change the location where AnkiDroid's data is stored (not recommended)
ar: تغيير الموقع الذي يتم فيه تخزين بيانات أنكيدرويد (غير مستحسن)
ja: AnkiDroidのデータが保存されている場所を変更します (非推奨)
ru: Изменить местоположение хранения данных AnkiDroid (не рекомендуется)

source: Force full sync
ar: فرض المزامنة الكاملة
ja: 強制的に完全同期する
ru: Принудительная полная синхронизация

source: Tap this item to force a full upload or download on the next sync (for example, because you accidentally deleted a deck on one side and want to restore the deck rather than having its deletion synchronized).
ar: انقر فوق هذا العنصر لفرض تحميل كامل أو تنزيل على المزامنة التالية (على سبيل المثال، لأنك قمت عن طريق الخطأ بحذف مجموعة على جانب واحد وترغب في استعادة المجموعة بدلاً من مزامنة حذفها).
ja: このアイテムをタップすると、次の同期に完全なアップロードまたはダウンロードを強制します（例えば、 間違ってデッキを削除してデッキを復元したいから
ru: Нажмите на этот элемент, чтобы принудительно загрузить или загрузить его при следующей синхронизации (например, потому что вы случайно удалили колоду с одной стороны и хотите восстановить колоду, а не синхронизировать ее удаление).

source: Take into account the effect of future reviews in the **Forecast** graph. More info [here](advanced-features/advanced-statistics.md).
ar: أخذ في الاعتبار تأثير المراجعات المستقبلية في الرسم البياني **التنبؤات**. المزيد من المعلومات [here](المميزات المتقدمة/المتقدمة,الإحصائيات.md).
ja: **予測** グラフの将来のレビューの効果を考慮します。詳細情報 [here](advanced-features/advanced-statistics.md)

source: Workarounds
ar: تدريبات
ja: 回避策
ru: Обходные пути

source: Type answer into the card
ar: اكتب الإجابة في البطاقة
ja: カードに解答を入力
ru: Введите ответ на карту

source: If you have set up your cards to ask you to type in the answer (as explained in [this section of the desktop manual](https://docs.ankiweb.net/templates/intro.html)), AnkiDroid will display a keyboard on such cards and allow you to check your answer.
ar: إذا كنت قد قمت بإعداد بطاقاتك لأطلب منك كتابة الإجابة (كما هو موضح في [هذا القسم من دليل سطح المكتب](https://docs. nkiweb.net/templates/intro.html))، سيقوم AnkiDroid بعرض لوحة المفاتيح على هذه البطاقات والسماح لك بالتحقق من إجابتك.
ja: （format@@0(https://docs) で説明されているように、カードをセットアップして解答を入力するように求める場合。 nkiweb.net/templates/intro.html)では、AnkiDroidがキーボードを表示し、回答を確認することができます。
ru: Если вы настроили карты, чтобы попросить вас ввести ответ (как описано в [этом разделе руководства для рабочего стола](https://docs. Ankiweb.net/templates/intro.html)), AnkiDroid будет отображать клавиатуру на таких картах и позволяет вам проверить свой ответ.

source: In order to improve user experience when working with the whiteboard and gestures, we use a typing box separate from the card, which is inconsistent with the way the feature works on Anki Desktop.
ar: من أجل تحسين تجربة المستخدم عند العمل مع اللوحة البيضاء والإيماءات، نحن نستخدم مربع طباعة منفصل عن البطاقة، والذي لا يتسق مع الطريقة التي تعمل بها الميزة على سطح المكتب في أنكي.
ja: ホワイトボードとジェスチャーを操作する際のユーザーエクスペリエンスを向上させるために カードとは別のタイプボックスを使用していますが、Anki Desktopでの機能と一致しません。
ru: Для улучшения пользовательского опыта при работе с доской и жестами, мы используем отдельно от карты печатный бокс, что не соответствует работе функции Anki Desktop.

source: For full consistency with Anki Desktop, you can enable this option which allows you to save screen area, and choose an appropriate font (e.g. Japanese vs Chinese) for the input box.
ar: لتحقيق الاتساق الكامل مع سطح المكتب أنكي، يمكنك تمكين هذا الخيار الذي يسمح لك بحفظ مساحة الشاشة، واختيار خط مناسب (e. - اليابانية مقابل الصينية) بالنسبة لصندوق المدخلات.
ja: Anki Desktopと完全に整合性を保つために、このオプションを有効にすると、画面領域を保存して適切なフォントを選択できます(e. を選択します。
ru: Для полной совместимости с Anki Desktop, вы можете включить эту опцию, которая позволяет сохранить область экрана и выбрать подходящий шрифт (e. . Japanese vs Chinese) для поля ввода.

source: Input Workaround
ar: ادخال العمل
ja: 回避策を入力
ru: Ввести обходной путь

source: Some older devices couldn't gain focus into the text input box for typed-answer fields, so this was added (Hidden for API > 14).
ar: لم تتمكن بعض الأجهزة القديمة من الحصول على تركيز في مربع إدخال النص لحقول الإجابة المطبعة، لذلك تمت إضافة هذا (مخفي لواجهة برمجة التطبيقات > 14).
ja: 一部の古いデバイスでは、型付けされたフィールドのテキスト入力ボックスにフォーカスを得ることができなかったため、これは追加されました(Hiddenfor API > 14)。
ru: Некоторые старые устройства не смогли сфокусироваться на текстовом поле ввода для полей ввода ввода, поэтому это было добавлено (Hidden for API > 14).

source: Longclick Workaround
ar: العمل بضغطة طويلة
ja: 長押しで回避する
ru: Долгое нажатие

source: Some older devices couldn't detect longclick for initiating selecting/copying of text, so this was added (Hidden for API > 10).
ar: لم تتمكن بعض الأجهزة القديمة من اكتشاف النقر الطويل لبدء اختيار/نسخ النص، لذلك تمت إضافة (مخفي لAPI > 10).
ja: 一部の古いデバイスでは、テキストの選択/コピーを開始するためのロングクリックを検出できなかったため、追加されました(Hiddenfor API > 10)。
ru: Некоторые старые устройства не смогли обнаружить долгое нажатие для инициации выделения/копирования текста, поэтому это было добавлено (Hidden для API > 10).

source: Fix for Hebrew Vowels
ar: إصلاح الفوترات العبرية
ja: ヘブライ語母音の修正
ru: Исправление на ивритных огласовках

source: Some older devices couldn't render Hebrew text, so this feature was added which allows the user to download and install a Hebrew font which is known to work (Hidden for API > 15).
ar: بعض الأجهزة القديمة لم تتمكن من تقديم النص العبري، لذلك تمت إضافة هذه الميزة التي تسمح للمستخدم بتنزيل وتثبيت خط عبري معروف بالعمل (مخفي لواجهة برمجة التطبيقات > 15).
ja: 一部の古いデバイスはヘブライ語のテキストをレンダリングできませんでした この機能が追加され、ユーザーが動作することが知られているヘブライ語のフォントをダウンロードしてインストールできるようになりました(Hiddenfor API > 15)。
ru: Некоторые старые устройства не смогли отобразить еврейский текст, так что эта функция позволяет пользователю загружать и устанавливать шрифт на иврите, который работает (Hidden for API > 15).

source: Text to Speech
ar: نص إلى كلام
ja: テキスト読み上げ
ru: Текст в речь

source: Enable this option to have Android read out all the text on your flashcards using the default text to speech engine. Google's built-in TTS engine should work; 3rd party TTS engines may or may not. AnkiDroid will ask you to select the language for the front and back of your cards once for each deck on the first time you review a card in that deck. To change the language or disable TTS for a given deck after making your initial choice, you'll need to use the **reset languages** option described below and reconfigure for each deck.
ar: تمكين هذا الخيار لجعل أندرويد يقرأ كل النص على بطاقات الفلاش الخاصة بك باستخدام محرك النص إلى الكلام الافتراضي. محرك Google المدمج في TTS ينبغي أن يعمل؛ محركات الطرف الثالث قد لا تكون أو لا. سيطلب منكدرويد منك تحديد اللغة الأمامية والخلفية لبطاقتك مرة واحدة لكل مجموعة في المرة الأولى التي تراجع فيها البطاقة في تلك المجموعة. لتغيير اللغة أو تعطيل TTS لمجموعة معينة بعد القيام باختيارك الأولي، ستحتاج إلى استخدام خيار **إعادة تعيين اللغات** الوارد وصفه أدناه وإعادة تكوين لكل مجموعة.
ja: このオプションを有効にすると、デフォルトのテキストを使用してフラッシュカードのすべてのテキストを読み上げることができます。 Googleの組み込みのTTSエンジンは動作するはずです。サードパーティのTTSエンジンは動作するかもしれません。 AnkiDroidは、最初にそのデッキでカードをレビューしたときに、各デッキに一度前後に表示される言語を選択するよう求めます。 言語を変更したり、最初に選択した後に特定のデッキのTTSを無効にしたりすること。 以下で説明する**言語をリセット**オプションを使用し、デッキごとに再設定する必要があります。
ru: Включите этот параметр, чтобы Android читал весь текст на ваших картах с помощью текста по умолчанию в движке речи. Встроенный в Google TTS движок должен работать; сторонние TTS движки могут не работать. AnkiDroid попросит вас выбрать язык передней и задней части карт один раз за каждую колоду при первом просмотре карты в этой колоде. Чтобы изменить язык или отключить TTS для заданной колоды после принятия первоначального выбора, вам нужно использовать опцию **сброс языков** и перенастроить для каждой колоды.

source: Alternatively, if you want only fragments of cards to be read aloud, or if you want to set the TTS language for multiple decks at once, you can insert `<tts>` tags into [card templates](advanced-features/customizing-card-layout.md). For example, with the following template for the back of the card
ar: بدلاً من ذلك، إذا كنت تريد فقط أجزاء من البطاقات أن تقرأ بصوت عال، أو إذا كنت ترغب في تعيين لغة الـ TTS لمجموعات متعددة في وقت واحد، يمكنك إدخال علامة `<tts>` في [قالب البطاقة](المميزات المتقدمة/تخصيص بطاقة - تخطيط. د). على سبيل المثال، مع النموذج التالي للخلف من البطاقة
ja: あるいは、カードの断片のみを読み上げたい場合は、 または一度に複数のデッキにTTS言語を設定したい場合に限ります。 `<tts>` タグを[カードテンプレート](advanced-features/customizing-card-layout)に挿入できます。 D)。例えば、下記のカードの裏面のテンプレート

source: answer
ar: الإجابة
ja: 答え
ru: ответ

source: only the `EnglishTranslation` field will be read aloud in a British English voice; the `Example` field, lying outside the `<tts>` tag, won't be read aloud. Every `<tts>` tag needs to have the following two attributes:
ar: فقط حقل "الترجمة الإنجليزية" سيقرأ بصوت عالٍ بصوت إنجليزي بريطاني؛ الحقل 'مثال' ، الذي يقع خارج العلامة '<tts>'، لن يقرأ بصوت عال. كل علامة `<tts>` تحتاج إلى السمتين التاليتين:
ru: только поле `EnglishTranslation` будет читаться вслух английского голоса; поле «Пример», расположенное за пределами тега «<tts>», не будет прочитано вслух. Каждый `<tts>`тэг должен иметь следующие два атрибута:

source: **`service`**: should be set to **`android`**, otherwise the contents of the **`<tts>`** tag won't be read aloud;
ar: **`الخدمة`**: يجب أن يتم تعيينه إلى **`android`**، وإلا فإن محتويات العلامة **`<tts>`** لن تكون مقروءة بصوت عالٍ؛
ja: **`service`**: **`android`**に設定する必要があります。そうでなければ**`<tts>`**タグの内容は声に出されません。
ru: **`service`**: нужно установить на **`android`**, в противном случае содержимое **`<tts>`** тега не будет читаться вслух;

source: **`voice`**: used to select the TTS language; should be a [two- or three- letter language code](https://en.wikipedia.org/wiki/List_of_ISO_639-2_codes), optionally followed by an underscore and a [two-letter country or region code](https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2). A frequently updated list of languages supported by the Google TTS engine can be found on its [Wikipedia page](https://en.wikipedia.org/wiki/Google_Text-to-Speech).
ar: **`voice`**: يستخدم لتحديد لغة TTS; ينبغي أن تكون [رمز لغة حرفين أو ثلاثة](https://en.wikipedia. rg/wiki/List_of_ISO_639-2_codes)، يتبعها اختياريا علامة تحت علامة و [بلد أو منطقة من حرفين](https://en. ikipedia.org/wiki/ISO_3166-1_alpha-2) ويمكن الاطلاع على قائمة باللغات التي يتم تحديثها بشكل متكرر بدعم من محرك Google TTS في [صفحة ويكيبيديا](https://en.wikipedia.org/wiki/Google_Text-to-Speech).
ja: **`voice`**: TTS言語を選択するために使用されます。format@@0(https://en.wikipedia) rg/wiki/List_of_ISO_639-2_codes), オプションでアンダースコアとformat@@0(https://en) ikipedia.org/wiki/ISO_3166-1_alpha-2) Google TTSエンジンでサポートされている言語の頻繁に更新されるリストは、[Wikipedia.org/wiki/Google_Text-to-Speech](https://en.wikipedia.org/wiki/Google_Text-to-Speech)にあります。
ru: **`voice`**: используется для выбора языка речи; должен быть [двух- или трехбуквенный код языка](https://en.wikipedia. rg/wiki/List_of_ISO_639-2_codes), после чего следует подчеркивание и [двухбуквенный код страны или региона](https://en. ikipedia.org/wiki/ISO_3166-1_alpha-2). Часто обновляемый список языков, поддерживаемых движком Google TTS, можно найти на его [странице Википедии](https://en.wikipedia.org/wiki/Google_Text-to-Speech).

source: To make both AnkiDroid and the [AwesomeTTS](https://ankiatts.appspot.com) plugin to the desktop application use a TTS engine to read aloud certain card fragments, put the `<tts service="android" ...>` tag inside the `<tts>` tag recognised by AwesomeTTS, or vice versa. An example:
ar: لصنع كل من أنكيدرويد و [AwesomeTTS](https://ankiatts.appspot. om) إضافة إلى تطبيق سطح المكتب تستخدم محرك TTS لقراءة أجزاء معينة من البطاقة، بصوت عال، ضع العلامة `<tts service="android" ...>` داخل العلامة `<tts>` المعترف بها من قبل AwesomeTTS أو العكس. مثال على ذلك:
ru: Чтобы сделать AnkiDroid и [AwesomeTTS](https://ankiatts.appspot. om) плагин к настольному приложению использует TTS движок для чтения вслух некоторых фрагментов карты, поместите тэг `<tts service="android" ...>внутри тэга `<tts>`, распознаваемого AwesomeTTS, или наоборот. Пример:

source: "Microsoft David Desktop"
ar: "مايكروسوفت ديفيد سطح المكتب"

source: AnkiDroid automatically ignores `<tts>` tags selecting an unknown TTS service. In contrast, AwesomeTTS may display a warning message on encountering the `<tts service="android" ...>` tag; to suppress it, uncheck the two _Show errors_ checkboxes on the _Playback_ tab of the _AwesomeTTS: Configuration_ dialog in the desktop application.
ar: يتجاهل AnkiDroid تلقائيًا `<tts>` علامات اختيار خدمة TTS غير معروفة. وعلى النقيض من ذلك، يمكن لـ AwesomeTTS أن يعرض رسالة تحذير عند مواجهة العلامة '<tts service="android" ...>`؛ لقمعه، قم بإلغاء تحديد خانات الاختيار _إظهار الأخطاء_ على علامة التبويب _Playback_ من _AwesomeTTS: تكوين_ الحوار في تطبيق سطح المكتب.
ru: AnkiDroid автоматически игнорирует тэги `<tts>`, выбрав неизвестную службу речи. Напротив, wesomeTTS может отображать предупреждающее сообщение о столкновении с тегом `<tts service="android" ...>; для его отключения, снимите флажок на вкладке _Воспроизведение_ диалога _AwesomeTTS: Configuration_ в настольном приложении.

source: _This feature may be removed in the future in favor of a separately downloadable plugin._
ar: _يمكن إزالة هذه الميزة في المستقبل لصالح إضافة قابلة للتحميل بشكل منفصل._
ja: _この機能は将来、個別にダウンロード可能なプラグインのために削除される可能性があります。
ru: _Эта функция может быть удалена в будущем в пользу отдельно загружаемого плагина._

source: Lookup Dictionary
ar: البحث عن القاموس
ja: 検索辞書
ru: Словарь поиска

source: Dictionary to use to lookup words copied to the clipboard in the reviewer. After setting up a dictionary, do the following to perform the lookup:
ar: القاموس لاستخدامه للبحث عن الكلمات التي تم نسخها إلى الحافظة في المراجع. بعد إعداد القاموس، قم بما يلي للقيام بالبحث:
ja: レビューアでクリップボードにコピーされた単語を検索するための辞書です。辞書を設定した後、次のように検索を実行します。
ru: Словарь для поиска слов, скопированных в буфер обмена в проверяющем системе. После настройки словаря выполните следующие действия:

source: Longclick on the text you want to copy in the reviewer
ar: انقر مطولاً على النص الذي تريد نسخه في المستعرض
ja: 査読者にコピーしたいテキストを長押ししてください
ru: Долгое нажатие на текст, который вы хотите скопировать в рецензент

source: After selecting the word you want to copy, press the **copy** icon in the app bar at the top of the screen
ar: بعد تحديد الكلمة التي تريد نسخها، اضغط على أيقونة **نسخ** في شريط التطبيقات في الجزء العلوي من الشاشة
ja: コピーしたい単語を選択したら、画面上部のアプリバーの **コピー** アイコンを押します
ru: После выбора слова, которое вы хотите скопировать, нажмите значок **скопировать** в верхней части экрана

source: Tap once anywhere on the flashcard
ar: انقر مرة واحدة في أي مكان على البطاقة
ja: フラッシュカードのどこかで一度タップしてください
ru: Нажмите один раз в любом месте на карте

source: A magnifying glass icon should appear, which performs the lookup when clicked
ar: يجب أن تظهر أيقونة زجاجية مكبرة، تقوم بالبحث عند النقر عليها
ja: 虫眼鏡アイコンが表示され、クリックしたときに検索を実行します
ru: Появится иконка увеличивающего стекла, которая выполняет поиск по клику

source: Alternatively, the lookup action can be performed via a gesture.
ar: وكبديل لذلك، يمكن القيام بعملية البحث عن طريق إيماء.
ja: または、ルックアップアクションはジェスチャーを介して実行することもできます。
ru: В качестве альтернативы действие поиска может быть выполнено с помощью жеста.

source: _This feature will likely be removed in the future in favor of a plugin_
ar: _هذه الميزة سيتم إزالتها في المستقبل لصالح إضافة_
ja: _この機能は将来プラグインに有利に削除される可能性があります_
ru: _Эта функция, скорее всего, будет удалена в будущем в пользу плагина_

source: Reset Languages
ar: إعادة تعيين اللغات
ja: 言語をリセット
ru: Сбросить языки

source: Useful for resetting the TTS language
ar: مفيد لإعادة تعيين لغة TTS
ja: TTS言語のリセットに便利です
ru: Полезно для сброса языка речи

source: eReader (up/down buttons)
ar: قراءة (أزرار أعلى/أسفل)
ja: eReader (上下ボタン)
ru: eReader (кнопки вверх/вниз)

source: Support for eReader hardware buttons (see [issue 1625](https://github.com/ankidroid/Anki-Android/issues/1625))
ar: دعم أزرار أجهزة القارئ (انظر [العدد 1625](https://github.com/ankidroid/Anki-Android/issues/1625))
ja: eReader ハードウェアボタンのサポート ([issue 1625](https://github.com/ankidroid/Anki-Android/issues/1625)を参照してください。
ru: Поддержка аппаратных кнопок eReader (см. [issue 1625](https://github.com/ankidroid/Anki-Android/issues/1625))

source: eReader Double Scrolling
ar: التمرير المزدوج للقارئ
ja: eReader ダブルスクロール
ru: Двойная прокрутка eReader

source: Double the scrolling distance when using the eReader hardware buttons
ar: مضاعفة مسافة التمرير عند استخدام أزرار أجهزة القارئ
ja: eReaderハードウェアボタンを使用している場合、スクロール距離を2倍にします
ru: Удвоить расстояние прокрутки при использовании аппаратных кнопок eReader

source: The note formatting toolbar contains basic text formatting buttons (Bold, Italic, Underline, Horizontal Line, Insert Title, Change Font Size, [Insert MathJax](advanced-features/mathjax.md) and Insert Cloze Deletion).
ar: يحتوي شريط أدوات تنسيق الملاحظات على أزرار تنسيق النص الأساسية (بالقول، مائل أسطر، أسطر، سطر أفقي، إدراج عنوان، تغيير حجم الخط، [إدراج ماثجاكس](المتقدمة-الميزات/mathjax.md) وحذف Insert Cloze حذف).
ja: 音符の書式設定ツールバーには、基本的なテキスト書式設定ボタン(太字、斜体、下線、水平線、タイトルの挿入、フォントサイズの変更、format@@0(advanced-features/mathjax.md) と閉じる削除の挿入が含まれています。
ru: Панель инструментов форматирования заметок содержит базовые кнопки форматирования (Bold, Italic, Underline, Horizontal Line, Insert Title, Change Font Size, [Вставить MathJax](advanced-features/mathjax.md) и Вставить удаление плазы).

source: It also allows the addition of user-defined toolbar buttons using HTML. HTML is a powerful language allowing nearly endless customization of your cards. [Our wiki](https://github.com/ankidroid/Anki-Android/wiki/Note-Editor-Toolbar-HTML-Samples) contains common code samples to get you started.
ar: كما أنه يسمح بإضافة أزرار شريط الأدوات المحددة للمستخدم باستخدام HTML. HTML هي لغة قوية تسمح بتخصيص بطاقاتك بدون نهاية تقريبا. [wiki](https://github.com/ankidroid/Anki-Android/wiki/Note-Editor-Toolbar-HTML-Samples) يحتوي على عينات من التعليمات البرمجية الشائعة للبدء.
ja: HTML を使用してユーザー定義のツールバーボタンを追加することもできます。HTML は強力な言語で、カードのほぼ無限のカスタマイズを可能にします。 format@@0(https://github.com/ankidroid/Anki-Android/wiki/Note-Editor-Toolbar-HTML-Samples) には、一般的なコードサンプルが含まれています。
ru: Он также позволяет добавлять пользовательские кнопки панели инструментов с помощью HTML. HTML является мощным языком, позволяющим практически бесконечную настройку карт. [Наша вики](https://github.com/ankidroid/Anki-Android/wiki/Note-Editor-Toolbar-HTML-Samples) содержит общие образцы кода, чтобы начать работу.

source: A user-defined toolbar button can be removed by long pressing the button and selecting **Delete**.
ar: يمكن إزالة زر شريط الأدوات المحدد للمستخدم بالضغط الطويل على الزر وتحديد **حذف**.
ja: ユーザー定義のツールバーボタンは、ボタンを長押しして **削除** を選択することで削除できます。
ru: Установленная пользователем кнопка на панели инструментов может быть удалена долгим нажатием кнопки и выбрав **Удалить**.

source: Home Screen
ar: الشاشة الرئيسية
ja: ホーム画面
ru: Домашний экран

source: Shortcut
ar: الاختصار
ja: ショートカット
ru: Ярлык

source: Purpose
ar: الغرض
ja: 目的
ru: Цель

source: A
ar: أ
ru: А

source: Add Note
ar: إضافة ملاحظة
ja: メモを追加
ru: Добавить заметку

source: B
ar: ب
ru: В

source: Y
ar: ص
ru: П

source: Sync
ar: مزامنة
ja: 同期
ru: Синхр.

source: Reviewer
ar: مراجعة
ja: 査読者
ru: Рецензент

source: Press the nth answer button
ar: اضغط على زر الإجابة nth
ja: nth answer ボタンを押す
ru: Нажмите кнопку "Да"

source: Gamepad Y
ar: لوحة اللعبة Y
ja: ゲームパッドY
ru: Геймпад Y

source: Flip Card/Press the first answer button
ar: قلب البطاقة/ألقي الضوء على زر الإجابة الأول
ja: カードを反転/最初の回答ボタンを押す
ru: Перевернуть карту/нажать первую кнопку ответа

source: Gamepad X
ar: لوحة اللعبة X
ja: ゲームパッドX
ru: Геймпад X

source: Flip Card/Press the second answer button
ar: قلب البطاقة/الضغط على زر الإجابة الثاني
ja: カードを裏返す/2番目の回答ボタンを押す
ru: Перевернуть карту/нажать вторую кнопку ответа

source: Gamepad B
ar: لوحة اللعبة B
ja: ゲームパッドB
ru: Геймпад B

source: Flip Card/Press the third answer button
ar: قلب البطاقة/الضغط على زر الإجابة الثالث
ja: カードを裏返す/3番目の回答ボタンを押す
ru: Перевернуть карту/нажать третью кнопку ответа
