Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Fix some issues with generated flashcard html and CSS selectors
ar: إصلاح بعض المشكلات مع محددات فلاشبطاقة html و CSS التي تم إنشاؤها
ja: 生成された flashcard html と CSS セレクターに関するいくつかの問題を修正
ru: Исправлены некоторые проблемы с созданной флешкартриджем html и CSS-селекторами

source: Fix some Glosbe and Beolingus regressions
ar: إصلاح بعض الانحدارات المسرد و بيولينغوس
ja: いくつかのGlosbeとBeolingus回帰を修正
ru: Исправлена регрессия Глосса и Белинга

source: Fix issue where new deck was created when note type was renamed
ar: إصلاح المشكلة حيث تم إنشاء مجموعة جديدة عند إعادة تسمية نوع الملاحظة
ja: ノートタイプの名前変更時に新しいデッキが作成された問題を修正
ru: Исправлена ошибка, при которой была создана новая пачка при переименовании типа заметок

source: Fix add note button disappearing from Card Browser when returning from search
ar: إصلاح زر إضافة ملاحظة يختفي من متصفح البطاقة عند العودة من البحث
ja: 検索から戻るときにカードブラウザからノート追加ボタンが消える問題を修正
ru: Исправлена кнопка "Добавить" при возврате из поиска из браузера карты

source: Fix some statistics display issues
ar: إصلاح بعض مشاكل عرض الإحصاءات
ja: 統計情報の表示の問題を修正
ru: Исправлены некоторые проблемы с отображением статистики

source: Fix incorrect display of some preferences
ar: إصلاح عرض غير صحيح لبعض التفضيلات
ja: いくつかの設定の間違った表示を修正
ru: Исправлено некорректное отображение некоторых настроек

source: Fix invisible notification bar in NoteEditor
ar: إصلاح شريط التنبيهات غير المرئي في محرر الملاحظات
ja: NoteEditor で非表示の通知バーを修正
ru: Исправить невидимую панель уведомлений в NoteEditor

source: Fix newline characters not working in cloze deletions
ar: إصلاح أحرف الخط الجديد التي لا تعمل في عمليات حذف الملابس
ja: 閉じる削除では改行文字が動作しない問題を修正
ru: Исправить символы новой строки, не работающие при удалении закладок

source: Increase max card count display from 1000 to 99999
ar: زيادة الحد الأقصى لعرض عدد البطاقات من 1000 إلى 99999
ja: カードの最大数を1000から9999999に増やします。
ru: Максимальное количество отображаемых карт с 1000 до 99999

source: Improve display handling of very long review intervals (> 68 years)
ar: تحسين طريقة عرض فترات المراجعة الطويلة جدا (> 68 سنة)
ja: 非常に長いレビュー間隔の表示処理を改善します（68年未満）
ru: Улучшить отображение интервалов очень длинного рассмотрения (> 68 лет)

source: Improve next/back buttons when using Previewer on multiple cards
ar: تحسين أزرار التالية/العودة عند استخدام المعاينة على بطاقات متعددة
ja: 複数のカードでプレビューを使用する場合は、次/戻るボタンを改善します
ru: Улучшить кнопки дальше/назад при использовании предварительного просмотра на нескольких картах

source: Improve handling of selected deck between statistics, card browser and deck picker
ar: تحسين التعامل مع المجموعة المحددة بين الإحصاءات، متصفح البطاقات ومنتقي المجموعة
ja: 統計情報、カードブラウザ、デッキピッカー間で選択されたデッキの処理を改善
ru: Улучшить обработку выбранной колоды между статистикой, браузером карт и выбором колоды

source: Improve Card Browser search by restoring when returning from other activities
ar: تحسين بحث متصفح البطاقة عن طريق استعادة عند العودة من الأنشطة الأخرى
ja: 他のアクティビティから戻るときに復元することで、カードブラウザの検索を改善します
ru: Улучшить поиск карт, восстанавливая при возвращении из других видов деятельности

source: Improve card focus handling when moving between Note Editor and Card Template Editor
ar: تحسين معالجة تركيز البطاقة عند الانتقال بين محرر الملاحظات ومحرر قالب البطاقة
ja: ノートエディタとカードテンプレートエディタの間で移動する際のカードフォーカス処理を改善
ru: Улучшить обработку фокуса при перемещении между редактором заметок и редактором шаблонов карт

source: Improve labeling of deck-group vs deck-specific options
ar: تحسين وضع العلامات على خيارات على سطح السفينة مقابل سطح السفينة
ja: デッキグループとデッキ固有のオプションのラベル付けを改善
ru: Улучшение маркировки deck-group и deck-specific опции

source: Improve formatting of HTTP error codes during sync
ar: تحسين تنسيق رموز الخطأ HTTP أثناء المزامنة
ja: 同期中の HTTP エラーコードのフォーマットを改善
ru: Улучшено форматирование кодов ошибок HTTP во время синхронизации

source: Improve handling of multi-touch events while whiteboard displayed
ar: تحسين التعامل مع الأحداث المتعددة اللمس أثناء عرض اللوحة البيضاء
ja: ホワイトボード表示中のマルチタッチイベントの処理を改善
ru: Улучшена обработка многокасательных событий при отображении доски

source: Improve permission dialog descriptions
ar: تحسين أوصاف مربع الحوار
ja: 権限ダイアログの説明を改善する
ru: Улучшить описание диалогового окна

source: Improve handling of "preview new cards" setting when creating custom study deck
ar: تحسين التعامل مع إعداد "معاينة البطاقات الجديدة" عند إنشاء مجموعة دراسة مخصصة
ja: カスタム学習デッキを作成する際の「新しいカードをプレビュー」設定の処理を改善
ru: Улучшение работы с настройками "Просмотр новых карт" при создании пользовательской учебной колоды

source: Improve Navigation Drawer performance on older devices
ar: تحسين أداء درج التنقل على الأجهزة القديمة
ja: 古いデバイスでのナビゲーション ドロワーのパフォーマンスを向上します
ru: Улучшить производительность панели навигации на более старых устройствах

source: Improve database check dialog with addition progress updates during check
ar: تحسين مربع حوار التحقق من قاعدة البيانات مع إضافة تحديثات التقدم أثناء التحقق
ja: チェック中の追加進行状況の更新でデータベースチェックダイアログを改善
ru: Улучшить диалог проверки базы данных с дополнительными обновлениями во время проверки

source: Use different notification channels for study reminders and general notifications
ar: استخدام قنوات إعلام مختلفة لتذكير الدراسة والإشعارات العامة
ja: 学習リマインダーと一般的な通知に異なる通知チャンネルを使用する
ru: Использовать различные каналы уведомлений для напоминаний об обучении и общих уведомлений

source: Drop support for Android \< Ice Cream Sandwich MR1 (API15, Android 4.0.3)
ar: إسقاط الدعم للأندرويد \< آيس كريم ساندويتش MR1 (API15، أندرويد 4.0.3)
ja: Android \< Ice Cream Sandwich MR1(API15, Android 4.0.3)のサポートを削除
ru: Drop поддержка Android \< Ice Cream Sandwich MR1 (API15, Android 4.0.3)

source: Add support for more features on Chromebook (import, export, restore backup, camera)
ar: إضافة دعم للمزيد من الميزات على Chromebook (استيراد، تصدير، استعادة النسخ الاحتياطي، الكاميرا)
ja: Chromebookでより多くの機能のサポートを追加（インポート、エクスポート、バックアップの復元、カメラ）
ru: Добавьте поддержку дополнительных функций для Chromebook (импорт, экспорт, восстановление резервной копии, камеры)

source: Add API support for card/note bury and suspend
ar: إضافة دعم API لبطاقة / ملاحظة دفن وتعليق
ja: カード/ノートを埋めるためのAPIサポートを追加し、一時停止します
ru: Добавить поддержку API для карты/заметки bury и приостановки

source: Add API to open Reviewer on specific decks from other apps
ar: إضافة واجهة برمجة التطبيقات لفتح المستعرض على مجموعات محددة من التطبيقات الأخرى
ja: 他のアプリから特定のデッキにレビューアを開くための API を追加
ru: Добавить API, чтобы открыть рецензент на определенных колодах из других приложений

source: Add support for HTML/Javascript debugging
ar: إضافة دعم لتصحيح أخطاء HTML/Javascript
ja: HTML/Javascriptデバッグのサポートを追加
ru: Добавить поддержку отладки HTML/Javascript

source: Add link to third party apps which support AnkiDroid API in advanced preferences
ar: إضافة رابط إلى تطبيقات الطرف الثالث التي تدعم API AnkiDroid في التفضيلات المتقدمة
ja: AnkiDroid API をサポートするサードパーティのアプリへのリンクを高度な設定で追加します
ru: Добавить ссылку на сторонние приложения, которые поддерживают AnkiDroid API в расширенных настройках

source: Fix issue with custom sync server certificates
ar: إصلاح المشكلة مع شهادات المزامنة المخصصة
ja: カスタム同期サーバー証明書の問題を修正
ru: Исправлена проблема с пользовательскими сертификатами сервера синхронизации

source: Perform basic DB integrity check on app upgrade
ar: إجراء التحقق الأساسي من سلامة DB عند ترقية التطبيق
ja: アプリのアップグレード時に基本的なDBの整合性チェックを実行します
ru: Выполните проверку целостности БД при обновлении приложения

source: Introduce optional analytics reporting
ar: تقديم تقارير تحليلية اختيارية
ja: オプションの分析レポートを導入する
ru: Представьте опциональную аналитическую отчетность

source: Version 2.8.4 (2018-04-27)
ar: الإصدار 2-8-4 (2018-04-27)
ru: Версия 2.8.4 (2018-04-27)

source: Fix error syncing due to too many card templates
ar: إصلاح خطأ في المزامنة بسبب كثرة قوالب البطاقة
ja: カードテンプレートが多すぎるため同期エラーを修正
ru: Исправлена ошибка синхронизации из-за слишком большого количества шаблонов карт

source: Version 2.8.3 (2017-11-10)
ar: النسخة 2-8-3 (2017-11-10)
ru: Версия 2.8.3 (2017-11-10)

source: Fix crash adding a picture from camera
ar: إصلاح تحطم إضافة صورة من الكاميرا
ja: カメラから写真を追加するクラッシュを修正
ru: Исправлена ошибка добавления изображения из камеры

source: Fix add note icon disappearing in browser after search
ar: إصلاح رمز إضافة ملاحظة يختفي في المتصفح بعد البحث
ja: 検索後にブラウザにノートアイコンが消える問題を修正
ru: Исправлена ошибка добавления заметки в браузере после поиска

source: Fix translations from Glosbe
ar: إصلاح الترجمات من المسرد
ja: Glosbe からの翻訳を修正
ru: Исправлены переводы из Глосса

source: Fix crash long-tapping when no deck is selected
ar: إصلاح الأعطال النقر مطولاً عند عدم تحديد مجموعة
ja: デッキが選択されていないときに長押しでクラッシュする問題を修正
ru: Исправление сбоя долгого нажатия, когда не выбрана колода

source: Fix crash entering advanced settings on some devices
ar: إصلاح تحطم إدخال الإعدادات المتقدمة على بعض الأجهزة
ja: 一部の端末でクラッシュする高度な設定を修正しました
ru: Исправлять ошибки при вводе расширенных настроек на некоторых устройствах

source: Fix incorrect graph display in statistics
ar: إصلاح عرض الرسم البياني غير صحيح في الإحصاءات
ja: 統計情報に不正なグラフが表示される問題を修正
ru: Исправлена ошибка отображения графика в статистике

source: Fix deck not changing properly in statistics
ar: إصلاح مجموعة الأدوات التي لا تتغير بشكل صحيح في الإحصاءات
ja: 統計情報でデッキが正しく変更されない問題を修正
ru: Исправлена ошибка изменения колоды в статистике

source: Fix rounding error in statistics weekly breakdown
ar: إصلاح خطأ التقريب في الاحصائيات المعطلة أسبوعيا
ja: 統計週間内訳の丸めエラーを修正
ru: Исправлена ошибка округления в статистике

source: Fix spurious new deck created on model rename
ar: إصلاح مجموعة جديدة زائفة تم إنشاؤها عند إعادة تسمية الموديل
ja: モデルの名前変更時に作成された偽造新しいデッキを修正
ru: Исправлена подделка новой колоды, созданная при переименовании модели

source: Improve error message on exception during media sync
ar: تحسين رسالة الخطأ على الاستثناء أثناء مزامنة الوسائط
ja: メディアの同期中に例外メッセージを改善する
ru: Улучшить сообщение об ошибке при синхронизации медиафайлов

source: Improve animation when transitioning between screens
ar: تحسين الرسوم المتحركة عند الانتقال بين الشاشات
ja: 画面間の遷移時のアニメーションを改善
ru: Улучшить анимацию при переходе между экранами

source: Use a round icon on devices that support it
ar: استخدام أيقونة مستديرة على الأجهزة التي تدعمها
ja: サポートしている端末で丸いアイコンを使用する
ru: Использовать круглый значок на устройствах, поддерживающих его

source: Version 2.8.2 (2017-02-28)
ar: النسخة 2-8-2 (2017-02-28)
ru: Версия 2.8.2 (2017-02-28)

source: Fix bugs showing confirmation dialogs in various places
ar: إصلاح الأخطاء التي تظهر مربعات حوار التأكيد في أماكن مختلفة
ja: 様々な場所で確認ダイアログを表示するバグを修正
ru: Исправлены ошибки, показывающие диалоги подтверждения в различных местах

source: Fix uncommon crash showing dialog after sync
ar: إصلاح الأعطال غير الشائعة التي تظهر مربع الحوار بعد المزامنة
ja: 同期後の珍しいクラッシュの表示を修正
ru: Исправлена редкая ошибка, показывающая диалог после синхронизации

source: Version 2.8.1 (2017-02-06)
ar: النسخة 2-8-1 (2017-02-06)
ru: Версия 2.8.1 (2017-02-06)

source: Allow sending exported apkg to arbitrary app (e.g. Google Drive)
ar: السماح بإرسال ملفات apkg المصدرة إلى التطبيق الاعتباطي (على سبيل المثال Google Drive)
ja: エクスポートされた apkg を任意のアプリ（Googleドライブなど）に送信することを許可する
ru: Разрешить отправку экспортированных apkg в произвольное приложение (например, Google Drive)

source: Allow AnkiWeb to display a warning on sync completion
ar: السماح لـ AnkiWeb بعرض تحذير عند اكتمال المزامنة
ja: AnkiWebによる同期完了時の警告表示を許可する
ru: Разрешить AnkiWeb отображать предупреждение при завершении синхронизации

source: Fix potential full-sync after sync cancellation
ar: إصلاح المزامنة الكاملة المحتملة بعد إلغاء المزامنة
ja: 同期キャンセル後の完全同期の可能性を修正
ru: Исправить потенциальную полную синхронизацию после отмены синхронизации

source: Fix media sync sometimes scanning all files again
ar: إصلاح مزامنة الوسائط في بعض الأحيان مسح جميع الملفات مرة أخرى
ja: すべてのファイルを再度スキャンするときにメディア同期を修正する
ru: Исправлять синхронизацию медиафайлов иногда сканирование всех файлов снова

source: Fix removing $ character when importing media files
ar: إصلاح إزالة الأحرف $ عند استيراد ملفات الوسائط
ja: メディアファイルをインポートする際に $ 文字削除する問題を修正
ru: Исправлено удаление $ символа при импорте медиа-файлов

source: Improve automatic card answer timing when audio is played
ar: تحسين توقيت إجابة البطاقة التلقائية عند تشغيل الصوت
ja: オーディオ再生時のカード自動応答タイミングを改善する
ru: Улучшить время автоматического ответа на карте при воспроизведении звука

source: Improve rendering of some statistics
ar: تحسين تقديم بعض الإحصاءات
ja: 統計情報のレンダリングを改善
ru: Улучшение отображения некоторых статистических данных

source: Fix some crashes in the Russian, Vietnamese, and Chinese translations
ar: إصلاح بعض الانهيارات في الترجمات الروسية والفيتنامية والصينية
ja: ロシア語、ベトナム語、中国語の翻訳でいくつかのクラッシュを修正
ru: Исправлены некоторые аварии на русском, вьетнамском и китайском языках

source: Fix crash sending exported apkg by email. NB: Export path can no longer be modified.
ar: إصلاح تعطل إرسال Apkg المصدرة عن طريق البريد الإلكتروني. NB: مسار التصدير لا يمكن تعديله بعد الآن.
ja: エクスポートされた apkg を電子メールで送信するクラッシュを修正しました。注意: エクスポートパスは変更できなくなりました。
ru: Исправлена ошибка отправки экспортированных apkg по электронной почте. NB: Путь к экспорту больше не может быть изменен.

source: Version 2.7 (2016-10-16)
ar: النسخة 2-7 (2016-10-16)
ru: Версия 2.7 (2016-10-16)

source: Add pull-to-sync feature
ar: إضافة ميزة السحب إلى المزامنة
ja: プルツー同期機能を追加
ru: Добавить функцию pull-to-sync

source: Add option to place answer buttons at the top
ar: إضافة خيار لوضع أزرار الإجابة في الأعلى
ja: 回答ボタンを上部に配置するオプションを追加
ru: Добавить опцию для размещения кнопок ответа вверху

source: Add widget to directly access "Add note" screen
ar: إضافة عنصر واجهة المستخدم للوصول مباشرة إلى شاشة "إضافة ملاحظة"
ja: 「メモを追加」画面に直接アクセスするためのウィジェットを追加
ru: Добавить виджет для прямого доступа к экрану "Добавить заметку"

source: Fix issue with importing whole collections and restoring backups
ar: إصلاح المشكلة مع استيراد المجموعات الكاملة واستعادة النسخ الاحتياطية
ja: コレクション全体のインポートとバックアップの復元に関する問題を修正しました。
ru: Исправлена проблема с импортом целых коллекций и восстановлением резервных копий

source: Fix deck import failing after the first successful one
ar: فشل إصلاح استيراد المجموعة بعد أول عملية ناجحة
ja: 最初に成功した後にデッキのインポートが失敗する問題を修正
ru: Исправлена ошибка импорта колоды после первого удачного

source: Fix cards in learning queue not being randomized
ar: إصلاح البطاقات في قائمة انتظار التعلم غير عشوائي
ja: 学習キューのカードがランダム化されていない問題を修正
ru: Исправлена ошибка в очереди обучения

source: Fix crash with fullscreen mode and hidden answer buttons
ar: إصلاح الأعطال باستخدام وضع ملء الشاشة وأزرار الإجابة المخفية
ja: フルスクリーンモードと非表示の回答ボタンでクラッシュを修正
ru: Исправлять ошибки при помощи полноэкранного режима и скрытые кнопки ответа

source: Fix rare crash when opening deck options
ar: إصلاح الأعطال النادرة عند فتح خيارات المجموعة
ja: デッキオプションを開いたときの稀なクラッシュを修正
ru: Исправление редких сбоев при открытии колоды

source: Improve support with TalkBack
ar: تحسين الدعم مع TalkBack
ja: TalkBack でサポートを改善
ru: Улучшить поддержку с TalkBack

source: Version 2.6.1 (2016-07-08)
ar: الإصدار 2-6-1 (2016-07-08)
ru: Версия 2.6.1 (2016-07-08)

source: Add card cycling in previewer (similar to desktop client)
ar: إضافة دورة البطاقة في المعاينة (شبيهة بعميل سطح المكتب)
ja: プレビューアでカードのサイクリングを追加します（デスクトップクライアントと同様）
ru: Добавить цикл карт в предпросмотрщике (по аналогии с настольным клиентом)

source: Add option to hide 'minutes left' in reviewer
ar: إضافة خيار لإخفاء 'الدقائق المتبقية' في المستعرض
ja: 査読者に 'minutes left' を非表示にするオプションを追加
ru: Добавить опцию для скрытия остатка минут

source: Fix language from app setting not always being used
ar: إصلاح اللغة من إعدادات التطبيق لا يتم استخدامها دائماً
ja: アプリの設定からの言語が常に使用されていない問題を修正
ru: Исправить язык из настроек приложения не всегда используется

source: Fix not being able to play back new sound recording
ar: إصلاح عدم القدرة على تشغيل تسجيل الصوت الجديد
ja: 新しいサウンド録音を再生できない問題を修正
ru: Исправлена ошибка при воспроизведении новой звуковой записи

source: Fix potential crash on Android 2.3 (Gingerbread)
ar: إصلاح الأعطال المحتملة على أندرويد 2.3 (الجيندرباء)
ja: Android 2.3 (ジンジャーブレッド) で潜在的なクラッシュを修正
ru: Устранение потенциальной аварии на Android 2.3 (Gingerbread)

source: Improved use of horizontal space when resizing large images
ar: تحسين استخدام المساحة الأفقية عند تغيير حجم الصور الكبيرة
ja: 大きな画像のサイズ変更時の水平方向のスペースの使用を改善
ru: Улучшено использование горизонтального пространства при изменении размера больших изображений

source: Minor adjustment to black theme colors
ar: تعديل طفيف لألوان السمة السوداء
ja: 黒のテーマの色への軽微な調整
ru: Небольшая настройка цвета чёрной темы

source: Version 2.6 (2016-06-14)
ar: النسخة 2-6 (2016-06-14)
ru: Версия 2.6 (2016-06-14)

source: Add two new themes (black, plain), selectable in preferences
ar: أضف موضوعين جديدين (سوداء، سهل)، قابل للاختيار في التفضيلات
ja: 2つの新しいテーマ（黒、プレーン）を追加します。設定で選択可能
ru: Добавить две новые темы (черный, простый), выбираемые в настройках

source: Make reviewer app bar icons customizable
ar: جعل أيقونات شريط التطبيقات للمستعرض قابلة للتخصيص
ja: レビューアプリのバーアイコンをカスタマイズ可能にする
ru: Сделать иконки панели обзоров настраиваемыми

source: Split "hide / delete" menu in reviewer into "bury", "suspend", "delete note"
ar: تقسيم القائمة "إخفاء / حذف" في المستعرض إلى "دفن"، "تعليق"، "حذف الملاحظة"
ja: 査読者の「非表示/削除」メニューを「ベリー」、「サスペンド」、「メモを削除」に分割
ru: Разделить меню «Скрыть / удалить» в рецензенте на «bury», «suspend», «delete note»

source: Reviewer undo button now removes last stroke when whiteboard in use
ar: استعراض زر التراجع الآن يزيل آخر سكرتة عند استخدام اللوحة البيضاء
ja: 査読者の元に戻すボタンがホワイトボード使用時に最後のストロークを削除するようになりました
ru: Кнопка отмены отзыва удаляет последний штрих при использовании доски

source: Add menu entry to change TTS language from reviewer
ar: إضافة إدخال القائمة لتغيير لغة TTS من المستعرض
ja: メニュー項目を追加してTTS言語を査読者から変更する
ru: Добавить пункт меню, чтобы изменить язык рецензента

source: Add more of the statistics available on the desktop client
ar: إضافة المزيد من الإحصاءات المتوفرة على عميل سطح المكتب
ja: デスクトップクライアントで利用可能な統計情報をさらに追加
ru: Добавьте больше статистики, доступной для настольного клиента

source: Add "advanced statistics" plugin (must be enabled in advanced settings)
ar: إضافة إضافة "إحصائيات متقدمة" (يجب تمكينها في الإعدادات المتقدمة)
ja: 「高度な統計情報」プラグインを追加（高度な設定で有効にする必要があります）
ru: Добавить плагин "Расширенная статистика" (должен быть включен в расширенных настройках)

source: Add setting to configure custom sync server (advanced)
ar: إضافة الإعداد لتكوين خادم مزامنة مخصص (متقدم)
ja: カスタム同期サーバーを構成する設定を追加します（高度な）
ru: Добавить параметр для настройки пользовательского сервера синхронизации (расширенный)

source: Fix card templates created in AnkiDroid incorrectly using bold style
ar: إصلاح قوالب البطاقة التي تم إنشاؤها في AnkiDroid بشكل غير صحيح باستخدام النمط العريض
ja: Bold styleを使用してAnkiDroidで作成されたカードテンプレートを間違って修正
ru: Исправьте шаблоны карт в AnkiDroid неправильно используя жирный стиль

source: Fix many importing issues (behavior now consistent with the desktop client)
ar: إصلاح العديد من مشاكل الاستيراد (السلوك يتسق الآن مع عميل سطح المكتب)
ja: 多くのインポートの問題を修正しました（デスクトップクライアントと一致する動作になりました）
ru: Исправлено множество проблем при импорте (поведение совместимо с настольным клиентом)

source: Fix long-tapping card in browser not always working
ar: إصلاح بطاقة النقر الطويل في المتصفح لا يعمل دائما
ja: ブラウザで長タップしているカードが常に動作しない問題を修正
ru: Исправление долгого нажатия на карте в браузере не всегда работает

source: Update sound playback button image
ar: تحديث صورة زر تشغيل الصوت
ja: サウンド再生ボタンの画像を更新
ru: Обновить изображение кнопки воспроизведения звука

source: Reduce size of whiteboard and gesture area for better interoperability with full screen
ar: تقليل حجم اللوحة البيضاء ومنطقة الإيماءة لتحسين التشغيل المتبادل مع ملء الشاشة
ja: ホワイトボードとジェスチャーエリアのサイズを小さくすると、フルスクリーンとの相互運用性が向上します。
ru: Уменьшить размер панели и области жестов для большей совместимости с полноэкранным режимом

source: Improve error messages with inaccessible collections
ar: تحسين رسائل الخطأ مع مجموعات يتعذر الوصول إليها
ja: アクセスできないコレクションでエラーメッセージを改善します
ru: Улучшить сообщения об ошибках с недоступными коллекциями

source: Allow auto-play of HTML media elements (for templates that enable it)
ar: السماح بتشغيل تلقائي لعناصر وسائط HTML (للنماذج التي تمكنها)
ja: HTML メディア要素の自動再生を許可する (有効化されたテンプレート用)
ru: Разрешить автовоспроизведение элементов мультимедиа HTML (для используемых шаблонов)

source: Significant updates to the content provider and API (for developers; see documentation)
ar: تحديثات هامة لمزود المحتوى و API (للمطورين؛ انظر الوثائق)
ja: コンテンツ プロバイダーと API の重要な更新(開発者向け; ドキュメントを参照)
ru: Значительные обновления для контент-провайдера и API (для разработчиков; см. документацию)

source: Many small bug fixes, improvements, theme adjustments, translation updates
ar: العديد من إصلاحات الأخطاء الصغيرة والتحسينات وتعديلات الموضوع وتحديثات الترجمة
ja: 多くの小さなバグ修正、改善、テーマ調整、翻訳の更新
ru: Множество исправлений ошибок, улучшений, корректировок темы, обновлений перевода

source: Version 2.5.4 (2015-12-14)
ar: الإصدار 2-5-4 (2015-12-14)
ru: Версия 2.5.4 (2015-12-14)

source: Fix background color in overflow menu of deck picker
ar: إصلاح لون الخلفية في قائمة فائقة المنتقي على سطح المجموعة
ja: デッキピッカーのオーバーフローメニューの背景色を修正
ru: Исправить цвет фона в меню переполнения палубы

source: Version 2.5.3 (2015-12-14)
ar: الإصدار 2-5-3 (2015-12-14)
ru: Версия 2.5.3 (2015-12-14)

source: Fix floating action button (blue +) interfering with deck list on Android 2.3
ar: إصلاح زر الإجراء العائم (الأزرق +) يتداخل مع قائمة المجموعة على أندرويد 2.3
ja: Android 2.3でフローティングアクションボタン(青+)がデッキリストに干渉している問題を修正
ru: Исправлена ошибка с плавающей кнопкой (синий +) вмешательства в список колод на Android 2.3

source: Fix opening apkg files from Gmail
ar: إصلاح فتح ملفات apkg من Gmail
ja: Gmail から apkg ファイルを開くように修正しました
ru: Исправлено открытие apkg файлов из Gmail

source: Fix automatic playback of consecutive videos
ar: إصلاح التشغيل التلقائي لفيديوهات متتالية
ja: 連続したビデオの自動再生を修正
ru: Исправлено автоматическое воспроизведение последовательных видео

source: Add a new launch screen
ar: إضافة شاشة تشغيل جديدة
ja: 新しい起動画面を追加
ru: Добавить новый экран запуска

source: Improve behaviour surrounding the deck overview screen
ar: تحسين السلوك المحيط بشاشة نظرة عامة على المجموعة
ja: デッキの概要画面を囲む動作を改善する
ru: Улучшить поведение вокруг экрана обзора палубы

source: Multiple media files can now be added to one field in the note editor
ar: يمكن الآن إضافة ملفات الوسائط المتعددة إلى حقل واحد في محرر الملاحظات
ja: ノートエディタのフィールドに複数のメディアファイルを追加できるようになりました
ru: Несколько медиа файлов теперь можно добавить в одно поле в редакторе заметок

source: Don't include unused media files on export
ar: لا تتضمن ملفات الوسائط غير المستخدمة عند التصدير
ja: エクスポート時に未使用のメディア ファイルを含めないでください
ru: Не включать неиспользуемые медиа-файлы при экспорте

source: Undo behaviour is now consistent with the desktop client (can no longer undo note edits)
ar: التراجع عن السلوك متوافق الآن مع عميل سطح المكتب (لم يعد يمكن التراجع عن تعديلات الملاحظة)
ja: 元に戻す動作がデスクトップクライアントと一致するようになりました (ノート編集を元に戻すことはできません)
ru: Действие отмены теперь совместимо с клиентом для рабочего стола (больше нельзя отменить редактирование заметок)

source: Enhancements to sync canceling
ar: تحسينات لمزامنة الإلغاء
ja: キャンセルを同期するための機能強化
ru: Улучшения для отмены синхронизации

source: Minor performance enhancements, crash fixes, and UI tweaks
ar: تحسينات طفيفة للأداء، إصلاحات التعطل، وتعديلات واجهة المستخدم
ja: マイナーパフォーマンスの向上、クラッシュ修正、UIの調整
ru: Незначительные улучшения производительности, исправления сбоев и твики интерфейса

source: Version 2.5.2 (2015-12-04)
ar: الإصدار 2-5-2 (2015-12-04)
ru: Версия 2.5.2 (2015-12-04)

source: Fix start-up crashes on Samsung devices running Android 4.2
ar: إصلاح أعطال بدء التشغيل على أجهزة سامسونج التي تعمل بنظام أندرويد 4.2
ja: Android 4.2を実行しているSamsungデバイスで起動クラッシュを修正
ru: Исправлены сбои запуска на устройствах Samsung под управлением Android 4.2
