Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: For questions and help concerning AnkiDroid, please visit the [user forum](https://groups.google.com/g/anki-android), or you can send your questions to the forum's [public email address](mailto:public-forum@ankidroid.org) if you don't want to register on the forum.
ar: للحصول على الأسئلة والمساعدة المتعلقة بـ AnkiDroid، يرجى زيارة [منتدى المستخدم] (https://groups.google. om/g/anki-android)، أو يمكنك إرسال أسئلتك إلى [عنوان البريد الإلكتروني العام] الخاص بالمنتدى (mailto:public-forum@ankidroid.org) إذا كنت لا تريد التسجيل في المنتدى.
ja: AnkiDroidに関する質問やヘルプは、format@@0(https://groups.google)をご覧ください。 om/g/anki-android)、またはフォーラムに登録したくない場合は、フォーラムのformat@@0(mailto:public-forum@ankidroid.org) に質問を送信することができます。
ru: По вопросам и по вопросам AnkiDroid, пожалуйста, посетите [форум пользователя](https://groups.google. om/g/anki-android) или вы можете отправить свои вопросы на [публичный адрес электронной почты](mailto:public-forum@ankidroid.org), если вы не хотите регистрироваться на форуме.

source: Bug Reports and Feature Requests
ar: تقارير الأخطاء وطلبات الميزات
ja: バグレポートと機能リクエスト
ru: Отчеты об ошибках и запросы

source: For bug reports and feature requests, please search through the current list of open issues on the [AnkiDroid issue tracker](https://github.com/ankidroid/Anki-Android/issues), and if there are no existing issues, create a new issue including as much information as possible. For bug reports, please also include the output of **debug info** by following the steps below:
ar: للحصول على تقارير الأخطاء وطلبات الميزات، يرجى البحث من خلال قائمة المشكلات المفتوحة الحالية على [AnkiDroid issuer](https://github. om/ankidroid/Anki-Android/issues)، وإذا لم تكن هناك مشاكل قائمة، قم بإنشاء مشكلة جديدة بما في ذلك أكبر قدر ممكن من المعلومات. للحصول على تقارير الأخطاء، يرجى أيضًا تضمين ناتج **معلومات التصحيح** باتباع الخطوات أدناه:
ja: バグレポートと機能リクエストについては、format@@0(https://github) にあるオープンな問題のリストを検索してください。 om/ankidroid/Anki-Android/issues)、および既存の問題がない場合は、できるだけ多くの情報を含む新しい問題を作成します。 バグレポートについては、以下の手順に従って、 **デバッグ情報** の出力を含めてください:
ru: Для сообщений об ошибках и запросов по функциям, пожалуйста, найдите текущий список открытых задач в [AnkiDroid issue tracker](https://github. om/ankidroid/Anki-Android/issues), и если нет существующих проблем, создайте новую проблему, включающую как можно больше информации. Для сообщений об ошибках укажите также результат **отладки информации**, следуя инструкциям ниже:

source: Open the navigation drawer by tapping the button on the top left of the screen
ar: فتح درج التنقل بالنقر على الزر الموجود في الجزء العلوي الأيسر من الشاشة
ja: 画面の左上にあるボタンをタップしてナビゲーションドロワーを開きます
ru: Откройте панель навигации, нажав кнопку в левом верхнем углу экрана

source: Tap **settings**
ar: انقر فوق **الإعدادات**
ja: **設定**をタップしてください
ru: Нажмите на **настройки**

source: Tap **advanced**
ar: انقر فوق **متقدم**
ja: **advanced** をタップ
ru: Нажмите на **продвинутый**

source: Tap **about AnkiDroid** at the bottom
ar: انقر فوق **حول أنكيدرويد** في الأسفل
ja: 下部の**AnkiDroidについて**をタップしてください
ru: Нажмите **про AnkiDroid** внизу

source: Tap the **copy debug info** button at the bottom (which copies **debug info** to the clipboard)
ar: اضغط على زر **نسخ معلومات التصحيح** في الأسفل (والذي ينسخ **معلومات التصحيح** إلى الحافظة)
ja: 下部にある **デバッグ情報** ボタンをタップします (**デバッグ情報** をクリップボードにコピーします)
ru: Нажмите на **скопировать отладочную информацию** внизу (копия **отладочная информация** в буфер обмена)

source: If filling out the bug report on your mobile device, paste the contents of the clipboard directly to the issue. Alternatively, you can paste the contents of the clipboard into a new email, send it to yourself, then copy and paste that into the bug report from your computer.
ar: إذا تم ملء تقرير الخطأ على جهازك المحمول، قم بلصق محتويات الحافظة مباشرة تجاه المشكلة. بدلاً من ذلك، يمكنك لصق محتويات الحافظة في بريد إلكتروني جديد، ارسلها لنفسك، ثم انسخها ولصقها في تقرير الأخطاء من جهاز الكمبيوتر الخاص بك.
ja: モバイルデバイスでバグレポートを記入する場合は、クリップボードの内容を直接問題に貼り付けます。 または、クリップボードの内容を新しいメールに貼り付けることもできます。 自分に送って、それをコピーしてコンピュータのバグレポートに貼り付けます。
ru: При заполнении сообщения об ошибке на вашем мобильном устройстве вставьте содержимое буфера обмена непосредственно в проблему. Кроме того, вы можете вставить содержимое буфера обмена в новый адрес электронной почты, затем скопируйте его и вставьте в сообщение об ошибке с вашего компьютера.

source: **Note:** if you are unable to open the app at all, so cannot even access **settings** then please follow [these instructions](https://github.com/ankidroid/Anki-Android/wiki/Unopenable-collections).
ar: **ملاحظة:** إذا كنت غير قادر على فتح التطبيق على الإطلاق، لذلك لا يمكنك حتى الوصول إلى **الإعدادات** ثم يرجى اتباع [هذه التعليمات](https://github.com/ankidroid/Anki-Android/wiki/Unopenable-collections).
ja: **注意：**アプリを開けない場合は**設定**にアクセスできません。format@@0(https://github.com/ankidroid/Anki-Android/wiki/Unnopenable-collections)に従ってください。
ru: **Примечание:** если вы вообще не можете открыть приложение, так что даже не можете получить доступ к **настройкам**, пожалуйста, следуйте [этим инструкциям](https://github.com/ankidroid/Anki-Android/wiki/Unopenable-collections).

source: This **debug info** is important as it allows us to match your report with our internal crash report data.
ar: هذه **معلومات التصحيح** مهمة لأنها تسمح لنا بمطابقة تقريرك مع بيانات تقرير الأعطال الداخلية لدينا.
ja: この**デバッグ情報**は、内部クラッシュレポートデータとレポートを一致させることができるため、重要です。
ru: Эта **отладочная информация** важна, так как она позволяет нам сопоставлять ваш отчет с нашими внутренними данными отчёта.

source: AnkiDroid is an open source project, and anyone is welcome to contribute (including non-developers)! For help with contributing to AnkiDroid, please first check the [contribution wiki page](https://github.com/ankidroid/Anki-Android/wiki/Contributing), and ask any further questions in the [main forum](https://groups.google.com/g/anki-android).
ar: أنكيدرويد هو مشروع مفتوح المصدر، وأي شخص مرحب به للمساهمة (بما في ذلك غير المطورين)! للحصول على مساعدة في المساهمة في AnkiDroid، يرجى أولا التحقق من [مساهمة صفحة ويكي](https://github. om/ankidroid/Anki-Android/wiki/Contributing)، وطرح أي أسئلة أخرى في [المنتدى الرئيسي] (https://groups.google.com/g/anki-android).
ja: AnkiDroidはオープンソースプロジェクトであり、誰でも(開発者以外を含む)貢献を歓迎します! AnkiDroidへの貢献については、まず[contribution wiki page](https://github) を確認してください。 om/ankidroid/Anki-Android/wiki/Contributing) format@@0(https://groups.google.com/g/anki-android) で質問してください。
ru: AnkiDroid - проект с открытым исходным кодом, и любой желающий может внести свой вклад (включая разработчиков)! Для помощи в создании AnkiDroid, пожалуйста, сначала проверьте [страницу вики вклада](https://github. om/ankidroid/Anki-Android/wiki/Contributing) и задавайте дополнительные вопросы на [главном форуме](https://groups.google.com/g/anki-android).

source: If you are more adventurous, you can also become an alpha tester, by joining the [alpha testers group](https://groups.google.com/forum/#!forum/ankidroidalphatesters) in addition to performing the above steps for beta testing.
ar: إذا كنت أكثر مغامرة، يمكنك أيضًا أن تصبح مختبر ألفا، بالانضمام إلى [مجموعة مختبري ألفا](https://groups). oogle.com/forum/#!forum/ankidroidalphatesters) بالإضافة إلى أداء الخطوات المذكورة أعلاه لاختبار بيتا.
ja: あなたがもっと冒険的であれば、format@@0(https://groups)に参加することで、アルファテスターになることもできます。 oogle.com/forum/#!forum/ankidroidalphatesters) ベータテストのために上記のステップを実行することに加えて。
ru: Если вы приключения, вы также можете стать альфа-тестером, присоединившись к [альфа-тестеры](https://groups. oogle.com/forum/#!forum/ankidroidalphatesters) в дополнение к выполнению вышеуказанных шагов для бета-тестирования.

source: If you want to try out the latest features in AnkiDroid, you can sign up for the beta testing program as follows:
ar: إذا كنت ترغب في تجربة أحدث الميزات في أنكيدرويد، يمكنك التسجيل في برنامج اختبار بيتا على النحو التالي:
ja: AnkiDroidの最新の機能を試してみたい場合は、以下のようにベータテストプログラムに登録してください。
ru: Если вы хотите попробовать последние функции AnkiDroid, вы можете зарегистрироваться на программу бета-тестирования следующим образом:

source: Visit the [Google Play Beta page](https://play.google.com/apps/testing/com.ichi2.anki)
ar: زيارة [Google Play Beta page](https://play.google.com/apps/testing/com.ichi2.anki)
ja: format@@0(https://play.google.com/apps/testing/com.ich2.anki) をご覧ください。
ru: Посетите [страницу бета-тестирования Google Play](https://play.google.com/apps/testing/com.ichi2.anki)

source: Click **Become a beta tester**
ar: انقر فوق **كن مختبر تجريبي**
ja: **ベータ版テスターになる**をクリックしてください
ru: Нажмите **Станьте бета-тестером**

source: After following these steps, the latest beta version will automatically be installed by Google Play in the same way as ordinary updates.
ar: بعد متابعة هذه الخطوات، سيتم تثبيت أحدث نسخة تجريبية تلقائياً بواسطة Google Play بنفس الطريقة التي يتم بها تثبيت التحديثات العادية.
ja: これらの手順に従うと、最新のベータ版は通常のアップデートと同じ方法でGoogle Playによって自動的にインストールされます。
ru: После выполнения этих шагов последняя бета-версия будет автоматически установлена Google Play таким же образом, как и обычные обновления.

source: If you are more adventurous, you can also become an alpha tester, by joining the [alpha testers group](https://groups.google.com/g/ankidroidalphatesters) in addition to performing the above steps for beta testing.
ar: إذا كنت أكثر مغامرة، يمكنك أيضًا أن تصبح مختبر ألفا، بالانضمام إلى [مجموعة مختبري ألفا](https://groups). oogle.com/g/ankidroidalphatesters) بالإضافة إلى أداء الخطوات المذكورة أعلاه لاختبار بيتا.
ja: あなたがもっと冒険的であれば、format@@0(https://groups)に参加することで、アルファテスターになることもできます。 ベータテストのために上記の手順を実行することに加えて、oogle.com/g/ankidroidalphatesters)。
ru: Если вы приключения, вы также можете стать альфа-тестером, присоединившись к [альфа-тестеры](https://groups. oogle.com/g/ankidroidalphatesters) в дополнение к выполнению вышеуказанных шагов для бета-тестирования.

source: Please submit any bugs you find in these development versions to the AnkiDroid issue tracker, as per the [main help page](help.md).
ar: يرجى إرسال أي أخطاء تجدها في إصدارات التطوير هذه إلى تتبع مشاكل أنكيدرويد، حسب [صفحة المساعدة الرئيسية](help.md).
ja: これらの開発バージョンで見つかったバグは、format@@0(help.md) に従って、AnkiDroidの課題トラッカーに提出してください。
ru: Пожалуйста, отправьте любые ошибки, которые вы обнаружили в этих версиях для разработчиков на AnkiDroid, на [главную страницу помощи](help.md).

source: If you wish to leave the testing program at any time, simply visit the [Google Play Beta page](https://play.google.com/apps/testing/com.ichi2.anki) and click **Leave the test**.
ar: إذا كنت ترغب في ترك برنامج الاختبار في أي وقت، ببساطة قم بزيارة [Google Play Beta page](https://play.google.com/apps/testing/com.ichi2.anki) وانقر فوق **اترك الاختبار**.
ja: テストプログラムをいつでも終了したい場合は、[Google Play Beta page](https://play.google.com/apps/testing/com.ichi2.anki)にアクセスして**テストを終了**をクリックしてください。
ru: Если вы хотите покинуть программу в любое время, просто посетите [страницу бета-тестирования Google Play](https://play.google.com/apps/testing/com.ichi2.anki) и нажмите **Оставить тест**.

source: [Get involved](#get-involved)
ar: [اشترك فيها](#get-involve)
ja: format@@0(#get-inclusived)
ru: [Принять участие](#get-involved)

source: [Translate](#translate)
ar: [Translate](#ترجمة)

source: AnkiDroid is an open source project, and its development relies on contributions from volunteers. Here are some of the ways you can contribute to the AnkiDroid project:
ar: أما مشروع أنكيدرويد فهو مشروع مفتوح المصدر، ويعتمد تطوره على مساهمات المتطوعين. إليك بعض الطرق التي يمكنك المساهمة بها في مشروع أنكيدرويد:
ja: AnkiDroidはオープンソースプロジェクトであり、その開発はボランティアからの貢献に依存しています。 AnkiDroidプロジェクトに貢献できる方法のいくつかは次のとおりです。
ru: AnkiDroid является проектом с открытым исходным кодом, и его развитие зависит от вклада волонтеров. Вот некоторые из способов, которые вы можете внести вклад в проект AnkiDroid:

source: Get involved
ar: شارك
ja: 参加する
ru: Принять участие

source: Rate the app, join the [AnkiDroid forum](https://groups.google.com/g/anki-android) and answer questions for other users, submit bug reports, become a [beta tester](beta-testing.md), etc. More detailed information on ways you can contribute as a non-developer can be found on the [Wiki](https://github.com/ankidroid/Anki-Android/wiki/Contributing).
ar: قيّم التطبيق، وانضم إلى [منتدى أنكيدرويد](https://groups.google.com/g/anki-android) وأجاب على أسئلة لمستخدمين آخرين، قدم تقارير الأخطاء، أصبح [اختبار بيتا] (بيتا-اختبار. يمكن الحصول على معلومات أكثر تفصيلا عن الطرق التي يمكنك المساهمة بها كغير مطور على [Wiki](https://github.com/ankidroid/Anki-Android/wiki/Contributing).
ja: アプリを評価して、[AnkiDroidフォーラム](https://groups.google.com/g/anki-android)に参加し、他のユーザーの質問に答えて、バグ報告を提出し、format@@0(beta-testing)になります。 d), その他 開発者以外として貢献できる方法の詳細については、 [Wiki](https://github.com/ankidroid/Anki-Android/wiki/Contributing)をご覧ください。

source: Translate
ar: ترجم
ja: 翻訳する
ru: Перевести

source: Translations of AnkiDroid and this user manual are all contributed by users, and are greatly appreciated. See the
ar: الترجمات لـ AnkiDroid ودليل المستخدم هذا كلها مساهمة من المستخدمين، وهي موضع تقدير كبير. انظر
ja: AnkiDroidの翻訳と、このユーザーマニュアルはすべてユーザーによって提供されており、大変感謝しています。参照:
ru: Все переводы AnkiDroid и этого руководства пользователя были сделаны пользователями и высоко оценены. Смотрите

source: translating
ar: ترجمة
ja: 翻訳
ru: перевод

source: wiki page for detailed instructions on how to contribute translations.
ar: صفحة ويكي للحصول على إرشادات مفصلة حول كيفية المساهمة بالترجمات.
ja: wikiページでは、翻訳を投稿する方法についての詳細な手順をご覧いただけます。
ru: wiki страница для подробных инструкций по внесению переводов.

source: Develop
ar: تطوير
ja: Desenvolver
ru: Развитие

source: The source code for AnkiDroid is available on our main [Github page](https://github.com/ankidroid/Anki-Android), and bug fixes as well as new features are very welcome. Before investing a lot of time on working on a new feature, you may like to ask on the forum first if it's likely to be merged into the main project, as not all features will be accepted. If you are just getting started with Android programming, feel free to ask on the forum for some tips and/or tasks which are suitable for beginners.
ar: رمز المصدر لـ AnkiDroid متاح على [Github page](https://github.com/ankidroid/Anki-Android) و إصلاحات الأخطاء فضلا عن الميزات الجديدة موضع ترحيب كبير. قبل استثمار الكثير من الوقت في العمل على سمة جديدة، قد ترغب في أن تسأل في المنتدى أولا إذا كان من المحتمل أن يتم دمجه في المشروع الرئيسي، حيث لن تكون كل الميزات مقبولة. إذا كنت فقط تبدأ ببرمجة الأندرويد، لا تتردد في طلب بعض النصائح و/أو المهام المناسبة للمبتدئين في المنتدى.
ja: AnkiDroid のソースコードはメインの [Github page](https://github.com/ankidroid/Anki-Android)で入手できます。バグ修正や新機能も大歓迎です。 新しい機能に取り組むことに多くの時間を投資する前 フォーラムで最初にメインプロジェクトに統合される可能性があるかどうか聞いてみてください 全ての機能が受け入れられるわけではありません Androidプログラミングを始めたばかりの場合 初心者に適したヒントやタスクについては、フォーラムでお気軽にお問い合わせください。
ru: Исходный код AnkiDroid доступен на нашей [странице Github](https://github.com/ankidroid/Anki-Android) и исправления ошибок, а также новые функции очень приветствуются. Прежде чем инвестировать много времени на работу над новой функцией, сначала, вы можете спросить на форуме о том, может ли он быть объединён в основной проект. так как не все возможности будут приняты. Если вы только начинаете программировать Android, не стесняйтесь задавать на форуме некоторые советы и/или задачи, которые подходят для начинающих.

source: Version 2.16.5 (20230906)
ar: الإصدار 2.16.5 (20230906)
ja: バージョン 2.16.5 (20230906)
ru: Версия 2.16.5 (20230906)

source: Fix potential crash in our crash report system. See: Murphy's Law
ar: إصلاح الانهيار المحتمل في نظام تقرير الانهيار لدينا. انظر: قانون مورفي
ja: クラッシュレポートシステムの潜在的なクラッシュを修正しました。参照: Murphy の法
ru: Устранение потенциальных сбоев в нашей системе отчёта об ошибках. См.

source: Fix incorrect default setting for analytics opt-in. Should be default off.
ar: إصلاح الإعداد الافتراضي غير صحيح للتحليلات اختيار. يجب أن يكون افتراضيا.
ja: アナリティクスのオプトインのデフォルト設定が正しくない問題を修正。デフォルトはオフにする必要があります。
ru: Исправлена некорректная настройка по умолчанию для варианта аналитики. Должно быть отключено по умолчанию.

source: Please check your setting if you want to make sure it is off
ar: الرجاء التحقق من إعدادك إذا كنت ترغب في التأكد من إيقاف تشغيله
ja: 設定がオフであることを確認してください
ru: Пожалуйста, проверьте ваши настройки, если вы хотите убедиться, что он выключен

source: Note1: our analytics is always anonymized and never shared as a first step
ar: ملاحظة: تحليلاتنا دائما مجهولة الهوية ولا تشارك أبدا كخطوة أولى
ja: 注1: アナリティクスは常に匿名化され、最初のステップとして共有されることはありません
ru: Примечание1: наша аналитика всегда анонимна и никогда не используется в качестве первого шага

source: Note2: the backend has been disabled for months, so there should be no exposure
ar: ملحوظة: تم تعطيل الخلفية لشهور، لذلك لا ينبغي أن يكون هناك تعرض
ja: 注2: バックエンドは数ヶ月間無効になっているため、露出がないはずです
ru: Примечание2: бэкенд был отключен в течение месяцев, поэтому не должно быть воздействия

source: Still this was in error and counter to our strict opt-in ethos. We are deeply sorry.
ar: ومع ذلك كان هذا في خطأ ويتعارض مع روح الاختيار الصارمة. نحن آسفون بشدة.
ja: それでも、厳格なオプトインの精神に反するエラーとなりました。深くお詫び申し上げます。
ru: Мы очень сожалеем о том, что все это было ошибочно и не противоречит нашим строгим этикам участия.

source: We will issue a future update shortly to opt everyone out as a precaution
ar: سوف نصدر تحديثاً في المستقبل قريباً لاختيار الجميع حذراً
ja: 全員を予防措置としてオプトアウトするため、まもなく今後のアップデートを発行します
ru: Мы опубликуем будущие обновления в ближайшее время, чтобы отключить всех как меры предосторожности

source: Thanks again for your patience waiting for 2.16 - we're on to 2.17 work already!
ar: شكرا مرة أخرى على صبرك في انتظار 2.16 - نحن في خدمة 2.17 بالفعل!
ja: 2.16を待っていただきありがとうございます。すでに2.17の作業が完了しています。
ru: Еще раз спасибо за ваше терпение в ожидании 2.16 - мы уже работаем с 2.17!

source: We are humbled by the [donations](https://opencollective.com/ankidroid) 🤯
ar: نحن مرتاحون من قبل [donations](https://opencollective.com/ankidroid) 🤯
ja: 私たちは [donations](https://opencollective.com/ankidroid) :exploting_head:

source: Version 2.16.4 (20230827)
ar: الإصدار 2-16-4 (20230827)
ja: バージョン 2.16.4 (20230827)
ru: Версия 2.16.4 (20230827)

source: Your dev team is still very excited to be able to release quick fixes for you again!
ar: فريق الـ dev الخاص بك لا يزال متحمس جدا لكي يكون قادرا على إصدار إصلاحات سريعة لك مرة أخرى!
ja: 開発チームはあなたのためにクイックフィックスをリリースできることをまだ非常に楽しみにしています!
ru: Ваша команда разработчиков очень рада выпустить быстрые исправления для вас!

source: Last big stability release for 2.16 series (see below for main 2.16 info)
ar: آخر إصدار كبير للاستقرار لسلسلة 2.16 (انظر أدناه معلومات 2-16 الرئيسية)
ja: 2.16 シリーズの最後の大きな安定性リリース(メイン情報については以下を参照)
ru: Последний релиз стабильности для серии 2.16 (подробнее см. ниже)

source: [❤️ We continue to be very thankful for your support](https://opencollective.com/ankidroid)
ar: [❤️ لا نزال ممتنين جدا لدعمك] (https://opencollective.com/ankidroid)
ja: [❤️ 今後もサポートに感謝しています](https://opencollective.com/ankidroid)
ru: [❤️ Мы по-прежнему благодарим вас за поддержку](https://opencollective.com/ankidroid)

source: Improved shortcut icons
ar: تحسين الأيقونات المختصرة
ja: ショートカットアイコンの改善
ru: Улучшенные значки ярлыков

source: Fix card browser scroll position after editing a card
ar: إصلاح موضع تمرير متصفح البطاقة بعد تحرير البطاقة
ja: カードを編集した後のカードブラウザのスクロール位置を修正する
ru: Исправлена прокрутка браузера карты после редактирования карты

source: Improve shared deck download handling
ar: تحسين معالجة تحميل المجموعة المشتركة
ja: 共有デッキのダウンロード処理を改善
ru: Улучшить обработку загрузки общей колоды

source: Fix sound replay on cards
ar: إصلاح إعادة تشغيل الصوت على البطاقات
ja: カードのサウンドリプレイを修正
ru: Исправить звук при воспроизведении карт

source: Fix deck rebuild not updating UI
ar: إصلاح إعادة إنشاء مجموعة لم يتم تحديث واجهة المستخدم
ja: デッキの再構築がUIを更新していないのを修正
ru: Исправлена пересборка колоды не обновлять интерфейс

source: Synced with [community language translations](https://crowdin.com/project/ankidroid)
ar: مزامنة مع [ترجمة لغة المجتمع](https://crowdin.com/project/ankidroid)
ja: format@@0(https://crowdin.com/project/ankidroid) と同期しました
ru: Синхронизировано с [переводами языков сообщества](https://crowdin.com/project/ankidroid)

source: Development for 2.17 is already in progress!
ar: التطوير ل 2.17 قيد التقدم بالفعل!
ja: 2.17の開発は既に進行中です！
ru: Разработка 2.17 уже продолжается!

source: Are you still reading this? Good luck in your studies 🤓
ar: هل مازلت تقرأ هذا؟ حظاً سعيداً في دراستك 🤓
ja: まだこれを読んでいますか？研究頑張ってください 🤓
ru: Вы все еще читаете? Удачи в вашем исследовании 🤓

source: Version 2.16.3 (20230818)
ar: الإصدار 2.16-3 (20230818)
ja: バージョン 2.16.3 (20230818)
ru: Версия 2.16.3 (20230818)

source: We meet Play Store requirements again, so we can release fixes quickly again!
ar: نحن نلبي متطلبات متجر بلاي مرة أخرى، حتى نتمكن من إصدار الإصلاحات بسرعة مرة أخرى!
ja: 私たちは再びPlayストアの要件を満たしているので、私たちは再び修正を迅速にリリースできます!
ru: Мы удовлетворяем требованиям Play Store снова, поэтому мы можем выпускать исправления быстро снова!

source: This is a stability release for the just-released 2.16 series (see below for 2.16 info)
ar: وهذا الإصدار هو إفراج عن الاستقرار في السلسلة 2-16 الصادرة لتوها (انظر أدناه للاطلاع على المعلومات 2-16).
ja: これはリリースされたばかりの2.16シリーズの安定版です(詳細は以下をご覧ください)。
ru: Это стабильный релиз для только что выпущенной серии 2.16 (подробнее см. ниже)

source: [🤜🤛 Thank you! Your support makes the fixes happen!](https://opencollective.com/ankidroid)
ar: [🤜🤛 شكرا لك! دعمك يجعل الإصلاحات تحدث!](https://opencollective.com/ankidroid)
ja: [🤜🤛 ありがとうございます！サポートが修正を行いました！](https://opencollective.com/ankidroid)
ru: [🤜🤛 Спасибо! Ваша поддержка делает исправления случилось!](https://opencollective.com/ankidroid)

source: Fix crash in certain cases adding images
ar: إصلاح الانهيار في بعض الحالات إضافة صور
ja: 画像の追加時にクラッシュを修正
ru: Исправлен сбой в некоторых случаях, добавляя изображения

source: Fix crash exporting decks with '/' in deck name
ar: إصلاح تعطل تصدير الطواقم مع '/' في اسم المجموعة
ja: デッキ名の「/」でクラッシュエクスポートを修正しました
ru: Исправлена ошибка экспорта колод с помощью '/' в названии колоды

source: Fix crash displaying whiteboard menu
ar: إصلاح تعطل عرض قائمة اللوحة البيضاء
ja: ホワイトボードメニューのクラッシュを修正
ru: Исправлена ошибка с отображением меню доски

source: Fix crash opening preferences after storage migration
ar: إصلاح تفضيلات فتح الأعطال بعد نقل التخزين
ja: ストレージ移行後にクラッシュ開く設定を修正しました
ru: Исправлена ошибка открытия настроек после миграции хранилища

source: Remove camera permission (not needed for single photo use)
ar: إزالة إذن الكاميرا (غير ضروري لاستخدام صورة واحدة)
ja: カメラの権限を削除します（写真1枚での使用には不要です）
ru: Удалить разрешение камеры (не требуется для использования одной фотографии)

source: Fix sync required indicator not disappearing
ar: إصلاح المزامنة يتطلب المؤشر الذي لا يختفي
ja: 同期が必要なインジケーターが消えない問題を修正
ru: Индикатор синхронизации не исчезает

source: Fix keyboard card answer highlighting whole card
ar: إصلاح إجابة بطاقة المفاتيح مع تسليط الضوء على كامل البطاقة
ja: キーボードカードの答えがカード全体に強調表示される問題を修正
ru: Исправить подсветку всей карты с помощью клавиатуры

source: Fix keyboard card answer causing double-tap
ar: إصلاح إجابة بطاقة المفاتيح مسبباً نقرة مزدوجة
ja: ダブルタップの原因となっているキーボードカードの応答を修正
ru: Исправить ответ на клавиатуру, вызывающий двойное нажатие

source: Fix incorrect deck highlight in tablet mode
ar: إصلاح تسليط الضوء غير الصحيح للمجموعة في وضع الكمبيوتر اللوحي
ja: タブレットモードで正しくないデッキのハイライトを修正
ru: Исправлена некорректная подсветка колоды в режиме планшета

source: Fix display of saved card searches
ar: إصلاح عرض عمليات البحث في البطاقة المحفوظة
ja: 保存されたカード検索の表示を修正
ru: Исправлено отображение сохраненных поисков карт

source: Fix inconsistent italics between Anki / AnkiDroid
ar: إصلاح الخط المائل غير المتسق بين أنكي / أنكيدرويد
ja: Anki / AnkiDroid間の不整合なイタリック体を修正
ru: Исправление несоответствий курсива между Анки / АнкиДроид
