Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Fix crash for new users on Android 6.0
ar: إصلاح الأعطال للمستخدمين الجدد على أندرويد 6.0
ja: Android 6.0での新規ユーザーのクラッシュを修正
ru: Исправлен сбой для новых пользователей на Android 6.0

source: Reverted to old typing method. The new method is now an option which is off by default.
ar: العودة إلى طريقة الكتابة القديمة. الطريقة الجديدة هي الآن خيار متوقف بشكل افتراضي.
ja: 古い入力方法に戻しました。新しいメソッドはデフォルトでオフになっています。
ru: Возврат к старому методу печати. Новый метод теперь является параметром, который по умолчанию отключен.

source: You can now click on the numbers in the right-most part of the deck list to open the deck overview screen
ar: يمكنك الآن النقر على الأرقام في الجزء الأيسر من قائمة المجموعة لفتح شاشة نظرة عامة على المجموعة
ja: デッキリストの右端にある数字をクリックして、デッキ概要画面を開くことができます。
ru: Теперь вы можете нажать на номера в правой части списка пачки, чтобы открыть окно обзора пачки

source: Various fixes to transition animations and progress bars
ar: إصلاحات مختلفة للرسوم المتحركة للتحول وأشرطة التقدم
ja: 遷移アニメーションとプログレスバーの様々な修正
ru: Различные исправления переходов анимации и индикаторов прогресса

source: Add option to remove empty cards (previously only possible on desktop)
ar: إضافة خيار لإزالة البطاقات الفارغة (سابقا ممكن فقط على سطح المكتب)
ja: 空のカードを削除するオプションを追加します（以前はデスクトップでのみ使用可能）
ru: Добавить опцию для удаления пустых карт (ранее возможно только на рабочем столе)

source: Remove: Google Translate filter. In practice, this feature had no effect and is not required
ar: حذف: فلتر ترجمة جوجل. من الناحية العملية، هذه الميزة ليس لها أي تأثير وليست مطلوبة
ja: 削除：Google翻訳フィルター。実際には、この機能は効果がなく、必要ではありません
ru: Удалить: Google Переводчик. На практике эта функция не имеет эффекта и не требуется

source: Remove: Google image search for multimedia card. The image search API has been discontinued by Google and no longer works
ar: إزالة: بحث صور Google عن بطاقة الوسائط المتعددة. تم إيقاف البحث عن الصور بواسطة Google ولم يعد يعمل
ja: 削除: マルチメディアカードのGoogle画像検索。画像検索APIはGoogleによって中止され、動作しなくなりました。
ru: Удалить: поиск изображений Google для мультимедиа карты. API поиска изображений был прекращен Google и больше не работает

source: Version 2.5.1 (2015-12-01)
ar: الإصدار 2-5-1 (2015-12-01)
ru: Версия 2.5.1 (2015-12-01)

source: Fix crash when loading deck list (could not open collection bug)
ar: إصلاح الأعطال عند تحميل قائمة المجموعة (تعذر فتح خطأ في المجموعة)
ja: デッキリストをロード中にクラッシュする問題を修正（コレクションバグを開くことができませんでした）
ru: Исправлен сбой при загрузке списка палуб (не удалось открыть ошибку коллекции)

source: Fix visible progress bar showing when answering card
ar: إصلاح شريط التقدم المرئي يظهر عند الإجابة على البطاقة
ja: カード応答時に表示されるプログレスバーを修正
ru: Исправлена видимая индикация прогресса, показываемая при ответе на карту

source: Version 2.5 (2015-11-30)
ar: الإصدار 2-5 (2015-11-30)
ru: Версия 2.5 (2015-11-30)

source: Redesign of user interface to use material design
ar: إعادة تصميم واجهة المستخدم لاستخدام تصميم المواد
ja: マテリアルデザインを使用するためのユーザーインターフェースの変更
ru: Перестройка пользовательского интерфейса для использования дизайна материала

source: Add new dark theme
ar: إضافة سمة مظلمة جديدة
ja: 新しいダークテーマを追加
ru: Добавить тёмную тему

source: Simplify the study process by bypassing deck overview screen
ar: تبسيط عملية الدراسة عن طريق تجاوز شاشة عرض المجموعة
ja: デッキの概要画面をバイパスして学習プロセスを簡素化する
ru: Упростить процесс обучения, минуя экран обзора палубы

source: Add ability to add, edit, delete note types
ar: إضافة القدرة على الإضافة، تعديل، حذف أنواع الملاحظات
ja: ノートタイプを追加、編集、削除する機能を追加
ru: Добавить возможность добавлять, редактировать, удалять типы заметок

source: Add setting to enable auto-sync and a Tasker intent to trigger sync
ar: إضافة إعدادات لتمكين المزامنة التلقائية و نية Tasker لتشغيل المزامنة
ja: 自動同期を有効にする設定と同期をトリガーするTaskerの意図を追加
ru: Добавить настройку, чтобы включить автосинхронизацию и Планировщик

source: Replace "instant add" feature with new API for 3rd party apps to add cards directly to AnkiDroid
ar: استبدال ميزة "الإضافة الفورية" بـ API جديدة لتطبيقات الطرف الثالث لإضافة بطاقات مباشرة إلى AnkiDroid
ja: カードを直接AnkiDroidに追加するには、「インスタント追加」機能をサードパーティのアプリ用の新しいAPIに置き換えてください。
ru: Замените функцию "мгновенного добавления" новым API для сторонних приложений, чтобы добавлять карты прямо в AnkiDroid

source: "Type in the answer" input box now built into the card html itself
ar: مربع الإدخال "اكتب في الإجابة" مدمج الآن في بطاقة html نفسها
ja: 「答えを入力」入力ボックスがカード html 自体に組み込まれました
ru: Теперь поле ввода "Введите в ответ" встроено в самой карте html

source: Make fullscreen-mode immersive and added setting to hide answer buttons when using gestures
ar: جعل وضع ملء الشاشة غمر و إضافة إعدادات لإخفاء أزرار الإجابة عند استخدام الإيماءات
ja: ジェスチャーを使用して解答ボタンを非表示にする、フルスクリーンモードの没入型設定を追加しました。
ru: Включить полноэкранный режим погружения и скрыть кнопки ответа при использовании жестов

source: Add css class for customizing card background color when night mode is enabled
ar: إضافة صف css لتخصيص لون خلفية البطاقة عند تمكين الوضع الليلي
ja: 夜間モードが有効になっているときにカードの背景色をカスタマイズするためのCSSクラスを追加
ru: Добавить класс css для настройки цвета фона карты при включенном ночном режиме

source: Allow changing media volume from the deck picker
ar: السماح بتغيير مستوى صوت الوسائط من منتقي المجموعة
ja: デッキピッカーからのメディア音量の変更を許可
ru: Разрешить изменение громкости мультимедиа с выбора колоды

source: Add ability to save and view common searches in the card browser
ar: إضافة القدرة على حفظ وعرض عمليات البحث الشائعة في متصفح البطاقة
ja: カードブラウザで共通の検索を保存して表示する機能を追加する
ru: Добавить возможность сохранять и просматривать общие запросы в браузере карты

source: Browser now shows full question and answer in the results by default
ar: يعرض المتصفح الآن السؤال الكامل والإجابة في النتائج بشكل افتراضي
ja: ブラウザがデフォルトで全質問と回答を結果に表示するようになりました
ru: Браузер теперь показывает полный вопрос и ответ в результатах по умолчанию

source: Only show tags relevant to that deck when doing custom study by tag
ar: إظهار العلامات ذات الصلة بتلك المجموعة فقط عند إجراء دراسة مخصصة عن طريق العلامة
ja: タグ別のカスタムスタディを行うときにのみ、そのデッキに関連するタグを表示する
ru: Показывать только теги, относящиеся к этой колоде при изучении по тегу

source: Fix some bugs in the widget
ar: إصلاح بعض الأخطاء في القطعة
ja: ウィジェットのバグを修正
ru: Исправлены ошибки в виджете

source: Remove "simple interface"
ar: إزالة "واجهة بسيطة"
ja: "シンプルなインターフェイス"を削除
ru: Удалить "простой интерфейс"

source: Remove support for Android version 2.1 and 2.2 (minimum is now 2.3.3)
ar: إزالة دعم للأندرويد الإصدار 2.1 و 2.2 (الحد الأدنى الآن هو 2.3.3)
ja: Android バージョン 2.1 と 2.2 のサポートを削除します(最小値は 2.3.3 になりました)。
ru: Удалите поддержку Android версии 2.1 и 2.2 (минимум 2.3.3)

source: Add support for Android 6 Marshmallow
ar: إضافة دعم لـ Android 6 Marshmallow
ja: Android 6 Marshmallow のサポートを追加
ru: Добавить поддержку Android 6 Marshmallow

source: Disable write-ahead-logging in sqlite database
ar: تعطيل تسجيل الدخول في قاعدة بيانات sqlite
ja: sqlite データベースでの先行書き込みログを無効にする
ru: Отключить запись в базу данных sqlite

source: Many other bug fixes and small improvements
ar: العديد من الإصلاحات الأخرى للأخطاء والتحسينات الصغيرة
ja: 他の多くのバグ修正と小規模な改善
ru: Множество других исправлений и мелких улучшений

source: Version 2.4.4 (2015-10-20)
ar: الإصدار 2.4-4 (2015-10-20)
ru: Версия 2.4.4 (2015-10-20)

source: Fix playback of sound files with apostrophes in file name
ar: إصلاح تشغيل الملفات الصوتية مع فترات الفاصلة في اسم الملف
ja: ファイル名のアポストロフィによるサウンドファイルの再生を修正
ru: Исправлено воспроизведение звуковых файлов с апострофями в имени файла

source: Fix new card siblings not being buried for the same day
ar: إصلاح الأخوة البطاقات الجديدة التي لا يتم دفنها لنفس اليوم
ja: 新しいカード兄弟が同じ日に埋まっていないのを修正
ru: Исправьте новых братьев и сестер, не похоронивших на тот же день

source: Fix media on cards when using the Hebrew Fix option
ar: إصلاح الوسائط على البطاقات عند استخدام خيار إصلاح العبرية
ja: ヘブライ語の修正オプションを使用しているときに、カード上のメディアを修正する
ru: Исправьте медиа на картах при использовании опции "Исправить иврит"

source: Fix crashes related to "Relative overdueness" and make this sort order available on AnkiDroid
ar: إصلاح الأعطال ذات الصلة "تجاوز الوقت النسبي" وجعل هذا الترتيب متاح على AnkiDroid
ja: "Relative overdueness"に関連するクラッシュを修正し、AnkiDroidでこのソート順を利用できるようにします
ru: Исправлена ошибка, связанная с «Относительной ненужностью» и приводила к появлению порядка сортировки на AnkiDroid

source: When mixing new and review cards, make their rotation more consistent with desktop
ar: عند مزج البطاقات الجديدة والبطاقات المستعرضة، جعل دورانها أكثر اتساقا مع سطح المكتب
ja: 新規カードとレビューカードを混在させる場合、回転をデスクトップと一致させます
ru: При смешивании новых и обзорных карт сделать их вращение более совместимым с настольным ПК

source: Version 2.4.3 (2015-04-21)
ar: النسخة 2-4-3 (2015-04-21)
ru: Версия 2.4.3 (2015-04-21)

source: Fix "unknown field" bug
ar: إصلاح خطأ "حقل غير معروف"
ja: 不明なフィールドのバグを修正
ru: Исправлена ошибка "неизвестное поле"

source: Fix crash showing welcome screen on Android 2.3
ar: إصلاح التعطل الذي يظهر شاشة الترحيب على أندرويد 2.3
ja: Android 2.3でウェルカム画面を表示するクラッシュを修正
ru: Исправлен сбой экрана приветствия на Android 2.3

source: Fix crash caused by widget
ar: إصلاح الأعطال الناجمة عن القطعة
ja: ウィジェットによるクラッシュを修正
ru: Исправление сбоя, вызванного виджетом

source: Fix rare crash in browser
ar: إصلاح الأعطال النادرة في المتصفح
ja: ブラウザでまれなクラッシュを修正
ru: Исправить редкий сбой в браузере

source: Fix a couple of sync issues
ar: إصلاح اثنين من مشكلات المزامنة
ja: いくつかの同期の問題を修正
ru: Исправлена проблема синхронизации

source: Fix crash starting AnkiDroid on a small number of devices
ar: إصلاح تحطم بدء AnkiDroid على عدد صغير من الأجهزة
ja: 少ないデバイスでAnkiDroidを起動するクラッシュを修正
ru: Исправлен сбой AnkiDroid на небольшом количестве устройств

source: Update translations
ar: تحديث الترجمات
ja: 翻訳を更新
ru: Обновить переводы

source: Version 2.4.2 (2015-03-18)
ar: الإصدار 2-4-2 (2015-03-18)
ru: Версия 2.4.2 (2015-03-18)

source: Fix some bugs with cloze templates
ar: إصلاح بعض الأخطاء مع قوالب الملابس
ja: クローズズテンプレートでバグを修正
ru: Исправлены ошибки с помощью шаблонов cloze

source: Fix a translation error
ar: إصلاح خطأ في الترجمة
ja: 翻訳エラーを修正
ru: Исправлена ошибка перевода

source: Version 2.4.1 (2015-03-15)
ar: الإصدار 2-4-1 (2015-03-15)
ru: Версия 2.4.1 (2015-03-15)

source: Fix some bugs with filtered decks
ar: إصلاح بعض الأخطاء مع فرقات التصفية
ja: フィルタリングされたデッキでバグを修正
ru: Исправлены ошибки с отфильтрованными колодами

source: Improve importing of shared decks
ar: تحسين استيراد الطوابق المشتركة
ja: 共有デッキのインポートを改善
ru: Улучшен импорт общих колод

source: Open settings if AnkiDroid dir inaccessible
ar: فتح الإعدادات إذا تعذر الوصول إلى نظام AnkiDroid
ja: AnkiDroidディレクトリにアクセスできない場合は設定を開く
ru: Открыть настройки, если каталог AnkiDroid недоступен

source: Fix a bug with zooming
ar: إصلاح مشكلة مع التكبير
ja: ズーム時のバグを修正
ru: Исправлена ошибка с увеличением

source: Fix a bug where old card was still shown in reviewer after changing deck
ar: إصلاح خطأ حيث لا تزال البطاقة القديمة تظهر في المستعرض بعد تغيير المجموعة
ja: デッキを変更した後でレビューアに古いカードが表示されているバグを修正しました。
ru: Исправлена ошибка, при которой старая карта по-прежнему отображалась в редакторе после изменения колоды

source: Fix some issues with cloze deletion
ar: إصلاح بعض المشكلات مع حذف الملبس
ja: クローズ削除のいくつかの問題を修正
ru: Исправлены некоторые проблемы с удалением cloze

source: Fix various crashes
ar: إصلاح الأعطال المختلفة
ja: さまざまなクラッシュを修正
ru: Исправлены различные сбои

source: Version 2.4 (2015-01-28)
ar: الإصدار 2.4 (2015-01-28)
ru: Версия 2.4 (2015-01-28)

source: Move "preview" feature to browser
ar: نقل ميزة "المعاينة" إلى المتصفح
ja: "プレビュー" 機能をブラウザーに移動
ru: Переместить функцию "предпросмотр" в браузер

source: Add ability to change note type of existing flashcards
ar: إضافة القدرة على تغيير نوع الملاحظة من البطاقات الموجودة
ja: 既存のフラッシュカードのノートタイプを変更する機能を追加
ru: Добавить возможность изменять тип заметок существующих карточек

source: Add ability to view and delete card templates
ar: إضافة القدرة على عرض وحذف قوالب البطاقة
ja: カードテンプレートを表示および削除する機能を追加
ru: Добавить возможность просмотра и удаления шаблонов карт

source: Fix TTS for most devices
ar: إصلاح TTS لمعظم الأجهزة
ja: ほとんどのデバイスでTTSを修正
ru: Исправить TTS для большинства устройств

source: Support playback of videos (see supported formats [here](http://developer.android.com/guide/appendix/media-formats.html))
ar: دعم تشغيل الفيديوهات (أنظر الصيغ المدعومة [here](http://developer.android.com/guide/appendix/media-formats.html))
ja: 動画の再生をサポートします (サポートされている形式 [here]を参照してください。(http://developer.android.com/guide/appendix/media-formats.html))

source: Improve rendering of second column in browser
ar: تحسين عرض العمود الثاني في المتصفح
ja: ブラウザの第二列のレンダリングを改善
ru: Улучшить отображение второй колонки в браузере

source: Improve detection of swipe gestures
ar: تحسين الكشف عن إيماءات السحب
ja: スワイプジェスチャーの検出を改善
ru: Улучшить определение жестов

source: Increase number of languages in Glosbe translator
ar: زيادة عدد اللغات في المسرد المترجم
ja: Glosbe 翻訳者の言語数を増加
ru: Увеличить количество языков в словаре Glosbe

source: Add support for Chromebooks
ar: إضافة دعم لـ Chromebook
ja: Chromebooks のサポートを追加
ru: Добавить поддержку Chromebooks

source: New crash report system
ar: نظام تقرير الانهيار الجديد
ja: 新しいクラッシュレポートシステム
ru: Новая система отчёта об ошибке

source: Bug fixes
ar: إصلاح الأخطاء
ja: バグの修正
ru: Исправления ошибок

source: Version 2.3.2 (2014-11-06)
ar: النسخة 2-3-2 (2014-11-06)
ru: Версия 2.3.2 (2014-11-06)

source: Bug fixes: Sync, TTS, Remote images, Advanced editor, Export
ar: إصلاح الأخطاء: المزامنة، TTS، الصور البعيدة، المحرر المتقدم، التصدير
ja: バグ修正: 同期、TTS、リモート画像、高度なエディタ、エクスポート
ru: Исправления ошибок: Sync, TTS, удаленные изображения, Расширенный редактор, Экспорт

source: Note: This is the last version of AnkiDroid supported by AnkiWeb. Previous versions will not sync.
ar: ملاحظة: هذه هي النسخة الأخيرة من AnkiDroid التي تدعمها AnkiWeb. لن يتم مزامنة الإصدارات السابقة.
ja: 注:これはAnkiWebでサポートされているAnkiDroidの最後のバージョンです。以前のバージョンは同期しません。
ru: Примечание: Это последняя версия AnkiDroid, поддерживаемая AnkiWeb. Предыдущие версии не будут синхронизироваться.

source: Version 2.3 (2014-10-27)
ar: الإصدار 2.3 (2014-10-27)
ru: Версия 2.3 (2014-10-27)

source: Add new user manual
ar: إضافة دليل مستخدم جديد
ja: 新しいユーザーマニュアルを追加
ru: Добавить новое руководство пользователя

source: Make statistics identical to Anki Desktop
ar: جعل الإحصاءات متطابقة مع سطح المكتب أنكي
ja: 統計情報をAnki Desktopと同じにする
ru: Сделать статистику идентичной Anki Desktop

source: Fixes to media sync
ar: إصلاح مزامنة الوسائط
ja: メディアの同期を修正
ru: Исправлена синхронизация с медиа

source: Fix bug where images were not showing
ar: إصلاح الأخطاء حيث لا تظهر الصور
ja: 画像が表示されていないバグを修正
ru: Исправлена ошибка, когда изображения не показывались

source: Change layout of note editor
ar: تغيير تخطيط محرر الملاحظات
ja: ノートエディタのレイアウトを変更
ru: Изменить макет редактора заметок

source: Add new disable whiteboard option to reviewer and update icons
ar: إضافة خيار معطل جديد للوحة البيضاء للمراجع وتحديث الأيقونات
ja: 新しいホワイトボードを無効にするオプションを追加し、アイコンを更新する
ru: Добавить новую опцию отключения доски для рецензента и обновить иконки

source: Add full support for APKG export and import
ar: إضافة دعم كامل لتصدير واستيراد APKG
ja: APKG のエクスポートとインポートを完全にサポートします。
ru: Добавить полную поддержку экспорта и импорта APKG

source: Add feature to email exported APKG
ar: إضافة ميزة إلى البريد الإلكتروني تصدير APKG
ja: エクスポートされたAPKGを電子メールで送信する機能を追加
ru: Добавить функцию для электронной почты экспортированного APKG

source: Increase default number of backups and use APKG
ar: زيادة العدد الافتراضي للنسخ الاحتياطي واستخدام APKG
ja: デフォルトのバックアップ数を増やし、APKGを使用します
ru: Увеличить количество резервных копий по умолчанию и использовать APKG

source: Make preview card accessible from card browser
ar: جعل بطاقة المعاينة متاحة من متصفح البطاقة
ja: ブラウザからプレビューカードにアクセスできるようにする
ru: Разрешить предварительный просмотр карты из браузера карты

source: Make shared decks download with Android browser
ar: اجعل مجموعات التنزيل المشتركة مع متصفح الأندرويد
ja: Androidブラウザで共有デッキをダウンロードする
ru: Сделать загрузку общих колод в браузере Android

source: Add reset and reschedule feature in note editor
ar: إضافة إعادة تعيين وإعادة جدولة الميزة في محرر الملاحظات
ja: ノートエディターにリセットとリスケジュール機能を追加
ru: Добавить функцию сброса и изменения расписания в редакторе заметок

source: Add a new notification system and icon
ar: إضافة نظام إشعار جديد وأيقونة
ja: 新しい通知システムとアイコンを追加
ru: Добавить новую систему уведомлений и значок

source: Replace tutorial deck with new welcome screen
ar: استبدال مجموعة البرامج التعليمية بشاشة الترحيب الجديدة
ja: チュートリアルデッキを新しい歓迎画面に置き換え
ru: Заменить учебную колоду новым приветственным экраном

source: Disable opening navigation drawer from reviewer when swipe is used
ar: تعطيل فتح درج التنقل من المستعرض عند استخدام السحب
ja: スワイプが使用されている場合、レビューアからナビゲーションドロワーを開くことを無効にする
ru: Отключить открытие навигационной панели от рецензента при использовании свайпа

source: Improve audio recording quality
ar: تحسين جودة تسجيل الصوت
ja: 音声録音の品質を向上させます
ru: Улучшить качество записи звука

source: Support sticky fields when enabled in Anki Desktop
ar: دعم الحقول المثبتة عند تمكينها في سطح المكتب أنكي
ja: Anki Desktop で有効にした場合、付箋フィールドをサポートする
ru: Поддержка липких полей при включении на Anki Desktop

source: Many other bug fixes
ar: العديد من إصلاحات الأخطاء الأخرى
ja: 他の多くのバグ修正
ru: Множество других исправлений

source: Version 2.2.3 (2014-08-04)
ar: الإصدار 2-2-3 (2014-08-04)
ja: Version 2.3 (2014-08-04)
ru: Версия 2.2.3 (2014-08-04)

source: New media sync protocol
ar: بروتوكول مزامنة الوسائط الجديدة
ja: 新しいメディア同期プロトコル
ru: Новый протокол синхронизации

source: Fix 2 bugs for opening links and resuming the app
ar: إصلاح 2 من الأخطاء لفتح الروابط واستئناف التطبيق
ja: リンクを開いてアプリを再開するための2つのバグを修正します
ru: Исправьте 2 ошибки при открытии ссылок и возобновлении приложения

source: Version 2.2 (2014-07-21)
ar: النسخة 2-2 (2014-07-21)
ru: Версия 2.2 (2014-07-21)

source: Redesign layout
ar: إعادة تصميم التصميم
ja: レイアウト変更
ru: Перестроить макет

source: Add pictures and sounds to flashcards (experimental)
ar: إضافة صور وأصوات إلى بطاقات الفلاش (تجريبي)
ja: フラッシュカードに写真とサウンドを追加（実験的）
ru: Добавить картинки и звуки в карточки (экспериментальный)

source: Make second column in card browser configurable
ar: جعل العمود الثاني في متصفح البطاقة قابل للتكوين
ja: カードブラウザ設定で2列目を作成する
ru: Сделать второй столбец в обозревателе карт настраиваемым

source: Make images on flashcards zoomable
ar: اصنع الصور على بطاقات الفلاش قابلة للتكبير
ja: フラッシュカード上の画像をズーム可能にする
ru: Сделать изображения на флешкартах для увеличения

source: Improve preview feature and access via action bar
ar: تحسين ميزة المعاينة والوصول عبر شريط العمل
ja: プレビュー機能を改善し、アクションバーからのアクセス
ru: Улучшить функцию предварительного просмотра и доступ через панель действий

source: Simplify menus and settings
ar: تبسيط القوائم والإعدادات
ja: メニューと設定を簡素化する
ru: Упростить меню и настройки

source: Make slow searches in card browser cancellable
ar: جعل عمليات البحث البطيئة في متصفح البطاقة قابلة للإلغاء
ja: カードブラウザで遅い検索をキャンセル可能にする
ru: Делает медленный поиск в браузере карты отменимым

source: Improve adding/removing tags
ar: تحسين إضافة/إزالة العلامات
ja: タグの追加/削除を改善
ru: Улучшить добавление/удаление тегов

source: Fix "type in the answer" and cloze deletion features
ar: إصلاح "اكتب في الإجابة" ومميزات الحذف
ja: 「解答タイプ」を修正し、削除機能を閉じます
ru: Исправлена возможность удаления заклинаний "наберите ответ" и заклинание

source: Fix whiteboard feature
ar: إصلاح ميزة اللوحة البيضاء
ja: ホワイトボード機能を修正
ru: Исправить функции доски

source: Restore backups from within the app
ar: استعادة النسخ الاحتياطي من داخل التطبيق
ja: アプリ内からバックアップを復元
ru: Восстановить резервные копии из приложения

source: Make volume duck on any background music when sounds played
ar: اجعل بطلة الصوت على أي موسيقى في الخلفية عند تشغيل الأصوات
ja: サウンド再生時にバックグラウンドミュージックのボリュームをアヒルにする
ru: Громкость при воспроизведении звука

source: Make playing of sounds consistent with Desktop version
ar: تشغيل الأصوات بما يتوافق مع إصدار سطح المكتب
ja: デスクトップ版と同じサウンドを再生する
ru: Сделать воспроизведение звуков совместимым с настольной версией

source: Remove animations feature due to being buggy
ar: إزالة ميزة الرسوم المتحركة بسبب خطأ
ja: バグが原因でアニメーション機能を削除します
ru: Удалить функцию анимации из-за ошибки

source: Improve speed of showing cards
ar: تحسين سرعة عرض البطاقات
ja: カードの表示速度を向上させる
ru: Улучшить скорость отображения карт

source: Remove duplicate check dialog when adding new flashcards
ar: إزالة مربع فحص مكرر عند إضافة بطاقات جديدة
ja: 新しいフラッシュカードを追加するときに重複チェックダイアログを削除
ru: Удалить дублирующийся диалог проверки при добавлении новых карт

source: Remove swap button when adding or editing flashcards
ar: إزالة زر التبديل عند إضافة أو تعديل البطاقات
ja: フラッシュカードを追加または編集するときにスワップボタンを削除
ru: Удалить кнопку поменять местами при добавлении или редактировании карточек

source: Remove kanji info feature (will become optional plugin in the future)
ar: إزالة ميزة معلومات كانجي (سوف تصبح إضافة اختيارية في المستقبل)
ja: 漢字情報機能を削除します（将来的にはオプションのプラグインになります）
ru: Функция удаления информации кандзи (станет необязательным плагином в будущем)

source: Make minimum Android version 2.1
ar: اجعل الحد الأدنى من إصدار Android 2.1
ja: Android バージョン 2.1 を最小にする
ru: Сделать минимальную версию Android 2.1

source: Fix lots of bugs
ar: إصلاح الكثير من الأخطاء
ja: 多くのバグを修正
ru: Исправлено множество ошибок

source: Version 2.1.3 (2014-04-05)
ar: النسخة 2-1-3 (2014-04-05)
ru: Версия 2.1.3 (2014-04-05)

source: Create new notes in correct deck
ar: إنشاء ملاحظات جديدة في المجموعة الصحيحة
ja: 正しいデッキに新しいメモを作成
ru: Создать новые заметки в правильной колоде

source: TTS fixes
ar: إصلاحات TTS
ja: TTSの修正
ru: Исправления TTS

source: Version 2.1 (2014-03-27)
ar: النسخة 2-1 (2014-03-27)
ru: Версия 2.1 (2014-03-27)

source: Lots of Bug Fixes
ar: الكثير من إصلاحات الأخطاء
ja: 多くのバグ修正
ru: Множество исправлений ошибок

source: New custom study option with improved tag selection
ar: خيار دراسة مخصص جديد مع تحسين اختيار العلامة
ja: タグ選択を改善した新しいカスタム学習オプション
ru: Новая опция обучения с улучшенным выбором тегов

source: New preview card feature in note editor (experimental)
ar: ميزة بطاقة المعاينة الجديدة في محرر الملاحظات (تجريبي)
ja: ノートエディタの新しいプレビューカード機能（実験的）
ru: Новая функция предварительного просмотра в редакторе заметок (экспериментальная)

source: New override font preference in addition to default font
ar: تجاوز جديد لتفضيل الخط بالإضافة إلى الخط الافتراضي
ja: 新しいフォント設定を既定のフォントに加えてオーバーライドする
ru: Новый параметр переопределения шрифта в дополнение к стандартному шрифту

source: New "Kanji Info" feature (enabled in preferences->reviewing->Kanji Info)
ar: ميزة جديدة "معلومات كانجي" (مفعلة في التفضيلات-> استعراض > معلومات كانجي)
ja: 新しい「漢字情報」機能（設定→審査→漢字情報で有効）
ru: Новая функция "Информация о Кандзи" (включена в настройках->обзор информации->Кандзи

source: Improve Aedict integration
ar: تحسين اندماج Aedict
ja: Aedict統合の改善
ru: Улучшить интеграцию с Aedict

source: Support for Samsung Multi-Window
ar: دعم نافذة سامسونج المتعددة
ja: Samsung Multi-Windowのサポート
ru: Поддержка Samsung Multi-Window

source: Fix Some TTS Issues
ar: إصلاح بعض مشاكل TTS
ja: TTSの問題を修正
ru: Исправлены некоторые проблемы TTS

source: Updated Translations
ar: تحديث الترجمات
ja: 翻訳の更新
ru: Обновленные переводы

source: Remove unused media check when deleting decks
ar: إزالة التحقق من الوسائط غير المستخدمة عند حذف المجموعات
ja: デッキ削除時に未使用のメディアチェックを削除
ru: Убрать неиспользуемые медиа проверки при удалении колод

source: Significantly increase speed for reducing filtered decks
ar: زيادة كبيرة في السرعة لتقليل الأسطح المصفاة
ja: フィルターデッキの減少速度を大幅に向上させます。
ru: Значительно увеличивает скорость для уменьшения фильтрованных колод

source: Remove upgrade wizard
ar: إزالة معالج الترقية
ja: アップグレードウィザードを削除
ru: Удалить мастер обновления

source: Version 2.0.4 (2014-02-03)
ar: الإصدار 2.0.4 (2014-02-03)
ru: Версия 2.0.4 (2014-02-03)
