Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Fix issue with typing answers
ar: إصلاح المشكلة مع كتابة الإجابات
ja: 回答を入力して問題を修正
ru: Исправлена проблема с вводом ответов

source: Default font now overrides card font
ar: الخط الافتراضي الآن يتجاوز خط البطاقة
ja: 既定のフォントがカードフォントを上書きします。
ru: Шрифт по умолчанию теперь переопределяет шрифт карты

source: Fixed audio playback image being covered by text on Android 2.3
ar: تثبيت صورة تشغيل الصوت التي يتم تغطيتها بالنص على أندرويد 2.3
ja: Android 2.3 でテキストでカバーされているオーディオ再生イメージを修正しました
ru: Исправлено воспроизведение аудио в тексте на Android 2.3

source: Fixed reviewer crash when language set to Romanian
ar: إصلاح عطل المستعرض عند تعيين اللغة إلى الرومانية
ja: 言語がルーマニア語に設定された時のレビューアクラッシュを修正しました
ru: Исправлена ошибка рецензента, когда язык установлен в румынский

source: Translation fixes
ar: إصلاحات الترجمة
ja: 翻訳の修正
ru: Исправления перевода

source: Version 2.0.2 (2013-12-15)
ar: الإصدار 2.0.2 (2013-12-15)
ru: Версия 2.0.2 (2013-12-15)

source: Fixed lots of crashes
ar: الكثير من حوادث الاصطدام الثابتة
ja: 多くのクラッシュを修正
ru: Исправлено множество сбоев

source: Tablet UI fixes
ar: إصلاح واجهة الجهاز اللوحي
ja: タブレットUIの修正
ru: Исправлена ошибка интерфейса планшета

source: Fixed new card ordering issues
ar: إصلاح مشاكل طلب البطاقة الجديدة
ja: 新しいカードの順序の問題を修正しました
ru: Исправлены проблемы с заказом новой карты

source: Card appearance now matches desktop Anki. (Centering cards is off by default but can be re-enabled)
ar: مظهر البطاقة يطابق الآن أنكي سطح المكتب. (بطاقات الدخول متوقفة افتراضيا ولكن يمكن إعادة تفعيلها)
ja: カードの外観がデスクトップのAnkiと一致するようになりました。（中央にカードがデフォルトでオフになっていますが、再び有効にできます）
ru: Внешний вид карты теперь совпадает с настольным Anki. (Включение карт отключено по умолчанию, но может быть перевключено)

source: Option groups can now be changed in AnkiDroid
ar: يمكن الآن تغيير مجموعات الخيارات في AnkiDroid
ja: オプショングループをAnkiDroidで変更できるようになりました
ru: Группы опций теперь можно изменить в AnkiDroid

source: Clear error message when using a bad template
ar: مسح رسالة الخطأ عند استخدام قالب سيئ
ja: 不正なテンプレートを使用するときにエラーメッセージをクリアする
ru: Очистить сообщение об ошибке при использовании плохих шаблонов

source: Fixed timeboxing notifications
ar: إشعارات المربع الزمني الثابتة
ja: 時間ボックスの通知を修正
ru: Фиксированные уведомления

source: Properly scale images
ar: الحجم الصحيح للصور
ja: 画像を適切に拡大縮小する
ru: Правильно масштабировать изображения

source: Better custom font handling
ar: معالجة أفضل لخط مخصص
ja: より良いカスタムフォントの処理
ru: Лучшая обработка шрифтов

source: More settings (next day starts at, timeboxing value, etc.)
ar: المزيد من الإعدادات (يبدأ في اليوم التالي ، قيمة المربع الزمني، إلخ.)
ja: その他の設定（次の日から開始、タイムボックスの値など）
ru: Другие настройки (на следующий день, значение часового ящика и т. д.)

source: Changing AnkiDroid interface language now works.
ar: تغيير لغة واجهة أنكيدرويد تعمل الآن.
ja: AnkiDroid のインターフェイス言語を変更することができます。
ru: Изменение языка интерфейса AnkiDroid теперь работает.

source: Fixed import/shared deck download issues ("not a valid apkg file")
ar: إصلاح مشاكل تحميل المجموعة/الاستيراد/المشاركة ("ليس ملف apkg صالح")
ja: インポート/共有デッキのダウンロードの問題を修正しました ("有効な apkg ファイルではありません")
ru: Исправлены проблемы загрузки импорта/общей пачки ("некорректный apkg файл")

source: Fixed invisible text on Motorola devices
ar: نص غير مرئي ثابت على أجهزة موتورولا
ja: Motorolaデバイスでの非表示テキストを修正しました
ru: Исправлено невидимый текст на устройствах Motorola

source: Focus on answer when revealed
ar: التركيز على الإجابة عند الكشف
ja: 明らかになったときに答えに焦点を合わせます
ru: Сфокусироваться на ответе при обнаружении

source: Filtered decks are now blue in deck list
ar: الطوابق المصفاة هي الآن أزرق في قائمة المجموعات
ja: フィルターされたデッキはデッキリストで青になりました
ru: Отфильтрованные колоды теперь синие в списке колоды

source: Removed unused circle button in note editor
ar: إزالة زر الدائرة غير المستخدمة في محرر الملاحظات
ja: メモエディタの未使用の円ボタンを削除しました
ru: Убрана неиспользуемая кнопка круга в редакторе заметок

source: Version 2.0.1 (2013-02-06)
ar: الإصدار 2.0.1 (2013-02-06)
ru: Версия 2.0.1 (2013-02-06)

source: Upgrade wizard
ar: ترقية المعالج
ja: ウィザードをアップグレード
ru: Мастер обновления

source: Fix importing apkgs
ar: إصلاح استيراد الأيقونات
ja: apkgs のインポートを修正
ru: Исправлен импорт apkgs

source: Fix media syncing
ar: إصلاح مزامنة الوسائط
ja: メディアの同期を修正
ru: Исправлена синхронизация медиа

source: Version 2.0 (2013-01-03)
ar: الإصدار 2.0 (2013-01-03)
ru: Версия 2.0 (2013-01-03)

source: complete revision
ar: مراجعة كاملة
ja: 完全なリビジョン
ru: полная версия

source: libanki2.0 scheduling
ar: جدولة libanki2.0
ja: libangi2.0スケジュール
ru: Планирование libanki2.0

source: new learning mode
ar: وضع التعلم الجديد
ja: 新しい学習モード
ru: новый режим обучения

source: new layout
ar: تخطيط جديد
ja: 新しいレイアウト
ru: новый макет

source: merge syncing possible now
ar: دمج المزامنة الممكنة الآن
ja: マージ同期が可能になりました
ru: слияние теперь возможно

source: better statistics
ar: إحصائيات أفضل
ja: より良い統計
ru: лучшая статистика

source: decks are now saved in a single collection
ar: يتم الآن حفظ الطوابق في مجموعة واحدة
ja: 単一のコレクションにデッキが保存されました
ru: пачки теперь сохраняются в одной коллекции

source: options are shareable now
ar: الخيارات قابلة للمشاركة الآن
ja: オプションを共有できるようになりました
ru: опции теперь доступны для использования

source: tablet layout
ar: تخطيط الجهاز اللوحي
ja: タブレットのレイアウト
ru: раскладка планшета

source: tons of performance improvements
ar: أطنان من تحسينات الأداء
ja: 何トンものパフォーマンスの向上が
ru: тонны улучшений производительности

source: card import function
ar: وظيفة استيراد البطاقة
ja: カードのインポート機能
ru: функция импорта карты

source: collection can be saved on internal memory
ar: يمكن حفظ المجموعة في الذاكرة الداخلية
ja: コレクションは内部メモリに保存できます
ru: коллекция может быть сохранена во внутренней памяти

source: AnkiDroid has continuously evolved collectively as an open source project, with the first version released to the Google Market on [June 28 2009](http://nicolas-raoul.blogspot.jp/2009/06/just-published-ankidroid-on-market.html).
ar: وتطور أنكيدرويد باستمرار بشكل جماعي كمشروع مفتوح المصدر، حيث صدرت النسخة الأولى منه إلى سوق جوجل في [28 حزيران/يونيه 2009] (http://nicolas-raoul.blogspot.jp/2009/06/just-published-ankidroid-on-market.html).
ja: AnkiDroidは、オープンソースプロジェクトとして継続的に進化し、最初のバージョンは、format@@0(http://nicolas-raoul.blogspot.jp/2009/06/just-published-ankidroid-on-market.html)でGoogle Marketにリリースされています。
ru: AnkiDroid постоянно развивался коллективно как проект с открытым исходным кодом, а первая версия, выпущенная на Google Market [28 Июня 2009](http://nicolas-raoul.blogspot.jp/2009/06/just-published-ankidroid-on-market.html).

source: Version 1.1.3 was the last 1.x version (released on 26th June 2012), before the incompatible AnkiDroid v2.0 was released, essentially rewritten from scratch to be compatible with the new Anki Desktop v2.0.
ar: الإصدار 1-1-3 كان آخر إصدار 1.x (صدر في 26 حزيران/يونيه 2012)، قبل AnkiDroid v2 غير متوافق. تم اصداره، تمت اعادة كتابته أساسا من الصفر لتكون متوافقة مع سطح المكتب الأنكي الجديد v2.0.
ja: バージョン 1.1.3 は、互換性のない AnkiDroid v2 以前のバージョン 1.x (2012 年 6 月 26 日にリリースされたバージョン) でした。 リリースされました。基本的には一から書き換えて新しいAnki Desktop v2.0と互換性があるようにしました。
ru: Версия 1.1.3 была последней версией 1.x (выпущена 26 июня 2012 года) до несовместимых AnkiDroid v2. был выпущен, существенно переписан с нуля, чтобы совместить с новым Anki Desktop v2.0.

source: Next to each field is an attach icon, which allows you to add media to your note (this feature is currently in the experimental phase). Add image lets you add images either via your device's camera (if it has one), or from your photo library. Record audio allows you to record your voice and place it into a field. The advanced editor lets you automatically search for translations or pronunciation audio files online.
ja: 各フィールドの横にはアタッチアイコンが表示され、ノートにメディアを追加することができます(この機能は現在実験段階です)。 画像を追加すると、お使いのデバイスのカメラまたはフォトライブラリから画像を追加することができます。 録音オーディオを使用すると、音声を録音してフィールドに配置できます。 上級エディタを使用すると、オンラインで翻訳または発音オーディオファイルを自動的に検索できます。
ru: Рядом с каждым полем находится значок приложения, который позволяет добавлять медиа-файлы в заметку (эта функция находится в экспериментальной фазе). Добавить изображение позволит вам добавлять изображения либо через камеру вашего устройства (если таковой имеется), либо из вашей библиотеки фотографий. Запись аудио позволяет записать свой голос и поместить его в поле. Расширенный редактор позволяет автоматически искать переводы или произношение аудио файлов онлайн.

source: [front:rabbit](#frontrabbit)
ru: [вперед:rabbit](#frontrabbit)

source: [Vibrate](#vibrate)
ja: [Vibrate](#バイブレーション)
ru: [Vibrate](#вибрация)

source: [Center align](#center-align)
ja: format@@0(#center-align)
ru: [Выравнивание по центру](#center-align)

source: "en_GB"
ru: "ru_GB"

source: Via USB
ja: USB 経由で
ru: Через USB

source: [Deck](#deck)
ja: [Deck](#デッキ)

source: https://github.com/ankidroid/Anki-Android/issues/14893
ja: https://github.com/anki-Android/issues/14893
