Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: AnkiDroid can remind you to devote some time to reviewing cards every day at a specific time via Android's notification framework. You can configure reminders for each options group independently. To configure a notification go to Deck options > Reminders, then tick the checkbox and select the time you want to be notified at. To stop receiving notifications go to Deck options > Reminders and unmark the checkbox.
ar: يمكن لـ AnkiDroid أن يذكرك بتكريس بعض الوقت لمراجعة البطاقات كل يوم في وقت محدد من خلال إطار اشعار الأندرويد. يمكنك تكوين تذكيرات لكل مجموعة خيارات بشكل مستقل. لتكوين إشعار انتقل إلى خيارات مجموعة > تذكيرات، ثم ضع علامة على مربع الاختيار وحدد الوقت الذي تريد إعلامك فيه. للتوقف عن تلقي الإشعارات انتقل إلى خيارات مجموعة > تذكير وإلغاء وضع علامة على خانة الاختيار.
ja: AnkiDroidは、Androidの通知フレームワークを介して特定の時間に毎日カードを確認するために時間を費やすことを思い出させることができます。 各オプション グループごとにリマインダーを設定できます。 通知を設定するには、デッキオプション > リマインダーに移動し、チェックボックスにチェックを入れ、通知を受け取る時間を選択します。 通知の受信を停止するには、デッキオプション > リマインダーに移動し、チェックボックスをオフにします。
ru: AnkiDroid может напомнить вам, чтобы посвящать некоторое время рассмотрению карт каждый день в определенное время через систему уведомлений Android. Вы можете настроить напоминания для каждой опции группы самостоятельно. Чтобы настроить уведомление перейдите в меню Deck > Reminders, затем отметьте флажок и выберите время, в которое вы хотите получать уведомление. Чтобы прекратить получение уведомлений, перейдите в настройки Deck > Reminders и снимите флажок.

source: Notifications only work for top level decks. Please let us know if you want us to add notifications for subdecks too.
ar: الإشعارات تعمل فقط لمجموعات أعلى مستوى. الرجاء إعلامنا إذا كنت تريد منا إضافة إشعارات لمجموعات فرعية أيضًا.
ja: 通知はトップレベルのデッキでのみ動作します。サブデッキの通知を追加したい場合は、お知らせください。
ru: Уведомления работают только для колод верхнего уровня. Пожалуйста, дайте нам знать, если вы хотите, чтобы мы также добавили уведомления для подколод.

source: AnkiDroid has an in Automatic Language Selection feature in the Note Editor starting with AnkiDroid 2.13. This feature allows you to define a default language to be used in your keyboard for a field in a note type.
ar: لدى AnkiDroid ميزة اختيار اللغة التلقائية في محرر الملاحظات بدءاً من AnkiDroid 2.13. هذه الميزة تسمح لك بتحديد لغة افتراضية لاستخدامها في لوحة المفاتيح لحقل في نوع الملاحظة.
ja: AnkiDroidは、AnkiDroid2.13以降のノートエディタで自動言語選択機能を備えています。 この機能を使用すると、キーボードでノートタイプのフィールドに使用するデフォルト言語を定義できます。
ru: AnkiDroid имеет функцию автоматического выбора языка в редакторе заметок, начиная с версии 2.13. Эта функция позволяет определить язык по умолчанию для клавиатуры поля в типе заметок.

source: For example, if you have Russian and English note fields, and your keyboard supports the setImeHintLocales Android API, the keyboard layout will switch to Russian in the first field and back to English in the second automatically when the fields get focus. [Checkout video reference for demonstration](https://www.youtube.com/watch?v=JrxDjTrRhBE)
ar: على سبيل المثال، إذا كان لديك حقول ملاحظة الروسية والإنجليزية، ولوحة المفاتيح الخاصة بك تدعم setImeHintLocales Android API، سيتحول تخطيط لوحة المفاتيح إلى اللغة الروسية في الحقل الأول والعودة إلى اللغة الإنجليزية في الحقل الثاني تلقائياً عند تركيز الحقول. [تسجيل الدخول مرجع للعرض التوضيحي] (https://www.youtube.com/watch?v=JrxDjTrRhBE)
ja: たとえば、ロシア語と英語のノートフィールドがあり、キーボードが setImeHintLocales Android API をサポートしている場合。 キーボードのレイアウトは、フィールドにフォーカスを得ると自動的に2番目のフィールドでロシア語に戻り、英語に戻ります。 format@@0(https://www.youtube.com/watch?v=JrxDjTrRhBE)
ru: Например, если у вас есть поля заметок на русском и английском языках, и клавиатура поддерживает Android setImeHintLocales API, раскладка клавиатуры переключится на русский язык в первом поле, а затем автоматически переключится на английский. [Посмотрите ссылку на видео на демонстрацию](https://www.youtube.com/watch?v=JrxDjTrRhBE)

source: Automatic night mode color inversion
ar: انعكاس لون الوضع الليلي التلقائي
ja: 自動夜間モードの色反転
ru: Автоматическая инверсия цвета ночного режима

source: NOTE: Removed in AnkiDroid 2.17
ar: ملاحظة: تمت إزالتها في AnkiDroid 2.17
ja: 注: AnkiDroid 2.17 で削除されました
ru: ПРИМЕЧАНИЕ: Удалено в AnkiDroid 2.17

source: Feature Description
ar: وصف الميزة
ja: 機能の説明
ru: Описание функции

source: Previously, AnkiDroid contained a very basic color inverter for card content in night mode. For example it changed white to black and black to white. It inverted _all_ colors though for example green inverts to pink. These changes were frequently unwanted.
ar: سابقاً، كان AnkiDroid يحتوي على انعكاس ألوان أساسي جداً لمحتوى البطاقة في الوضع الليلي. على سبيل المثال، قام بتغيير اللون الأبيض إلى الأسود والأسود إلى اللون الأبيض. عكس الألوان _all_ على الرغم من أنه على سبيل المثال انعكاسات خضراء إلى الورد. كانت هذه التغييرات في كثير من الأحيان غير مطلوبة.
ja: 以前は、AnkiDroidには、夜間モードのカードコンテンツ用の非常に基本的なカラーインバーターが含まれていました。たとえば、白は黒、黒は白に変更されました。 たとえば緑色がピンク色に反転するなど、すべての色を反転させました。これらの変更はしばしば望まれないことがありました。
ru: Раньше AnkiDroid содержал очень основной инвертор цвета для содержимого карты в ночном режиме. Например, он изменился на черно-белый и белый. Он инвертирует _all_ цветов, хотя и зеленые инверторы в розовый. Эти изменения часто не нужны.

source: Reason for removal
ar: سبب الإزالة
ja: 削除の理由
ru: Причина удаления

source: This feature was introduced in 2012, before either Android or Anki had night mode functionality.
ar: تم إدخال هذه الميزة في عام 2012، قبل أن يكون لدى أندرويد أو أنكي وظيفة الوضع الليلي.
ja: この機能は2012年に導入され、AndroidまたはAnkiがナイトモード機能を搭載する以前のものです。
ru: Эта функция была введена в 2012 году, прежде чем Android или Anki имели функциональность ночного режима.

source: AnkiDroid implemented Android's 'follow system' night mode functionality in 2.16, which made the functionality more prominent.
ar: طبق أنكيدرويد وظيفة "نظام المتابعة" الليلية لنظام أندرويد في 2.16، مما جعل الوظيفة أكثر بروزا.
ja: AnkiDroidは、Androidの「フォローシステム」ナイトモード機能を2.16で実装しました。
ru: AnkiDroid реализовал функциональность ночного режима Android в 2.16, что сделало его более функциональным.

source: In 2.17, AnkiDroid was updated to use unified night mode card rendering code across the Anki ecosystem. As color inversion was an unexpected feature for our users, and did not match Anki Desktop's behavior, it was removed.
ar: وفي الفقرة 2-17، تم تحديث أنكيدرويد لاستخدام بطاقة الوضع الليلي الموحدة التي تقدم الكود عبر النظام الإيكولوجي لأنكي. بما أن انعكاس الألوان كان ميزة غير متوقعة لمستخدمينا، ولم يتطابق مع سلوك أنكي سطح المكتب، فقد تمت إزالته.
ja: 2.17では、AnkiDroidがAnkiエコシステム全体で統一されたナイトモードカードレンダリングコードを使用するように更新されました。 カラーインバージョンはユーザーにとって予期せぬ機能であり、Anki Desktopの動作と一致しなかったため、削除されました。
ru: В 2.17 году AnkiDroid был обновлен для использования единой ночной карты для генерации кода в экосистеме Anka. Так как цветовая инверсия была неожиданной функцией для наших пользователей и не соответствовала поведению Anki Desktop, она была удалена.

source: Action to take
ar: الإجراء الذي يتعين اتخاذه
ja: 取るべきアクション
ru: Принять

source: If you are impacted by these changes, you may [customizing card layout](advanced-features/customizing-card-layout.md) of your card templates using the `night_mode` selector. The css: `filter: invert(1)`
ar: إذا تأثرت بهذه التغييرات، فيمكنك [تخصيص تخطيط البطاقة](المتقدمة/الميزات/التخصيص - card-layout.md) من قوالب البطاقة الخاصة بك باستخدام منتقي 'night_mode'. css: 'filter: invert(1)'
ja: これらの変更の影響を受けた場合は、`night_mode` セレクターを使用してカードテンプレートのformat@@0(advanced-features/customizing-card-layout.md)を使用してください。css: `filter: invert(1)`
ru: Если на вас влияют эти изменения, то вы можете [настраивать расположение карт](advanced-features/customizing-card-layout.md) шаблонов вашей карты с помощью селектора `night_mode`. Фильтр: invert(1)`

source: /* filter could also be used */
ar: /* يمكن أيضا استخدام عامل التصفية */
ja: /* フィルターは */ でも使用できます
ru: /* фильтр может также использоваться */

source: Gesture Action: Answer better than recommended
ar: إجراء الإيماءات: الإجابة أفضل من الموصى به
ja: ジェスチャーアクション：推奨よりも良く答えます
ru: Действие с жестами: ответ лучше, чем рекомендовано

source: Reason for Removal
ar: سبب الإزالة
ja: 削除の理由
ru: Причина удаления

source: Previous versions of the Anki Scheduler had a variable number of buttons. The V3 scheduler always has 4 buttons, so this option no longer has unique functionality.
ar: الإصدارات السابقة لجدولة أنكي كان لها عدد متغير من الأزرار. جدول V3 لديه دائما 4 أزرار، لذلك لم يعد لهذا الخيار وظيفة فريدة.
ja: Anki Scheduler の以前のバージョンでは、ボタンの変数がありました。 V3スケジューラには常に4つのボタンがあるため、このオプションには固有の機能はありません。
ru: В предыдущих версиях Anki Scheduler было количество кнопок. Планировщик V3 всегда имеет 4 кнопки, поэтому эта опция больше не имеет уникальной функциональности.

source: The functionality is now equivalent to 'Answer easy', either reassign the action, or remove it.
ar: الوظيفة تعادل الآن "الإجابة السهلة"، إما إعادة تعيين الإجراء أو إزالته.
ja: この機能は、アクションを再割り当てするか、削除するかのいずれかの「簡単に答える」と同等になりました。
ru: Функциональность теперь эквивалентна "Простота ответа", либо переназначить действие или удалить его.

source: Gesture Action: Answer recommended (green)
ar: إجراء الإيماءات: الإجابة الموصى بها (أخضر)
ja: ジェスチャーアクション：推奨される回答（緑）
ru: Действие с жестами: ответ рекомендован (зеленый)

source: The functionality is now equivalent to 'Answer good', either reassign the action, or remove it.
ar: الوظيفة تعادل الآن "الإجابة جيدة"، إما إعادة تعيين الإجراء أو إزالته.
ja: この機能は、アクションを再割り当てするか、それを削除するかのいずれかの 'Answer good' と同等になりました。
ru: Функциональность теперь эквивалентна "Ответить Google", либо переназначить действие или удалить его.

source: Unexpected error during Storage Migration
ar: خطأ غير متوقع أثناء نقل التخزين
ja: ストレージ移行中に予期しないエラーが発生しました
ru: Непредвиденная ошибка во время миграции хранилища

source: There was an error copying your media to a folder supported by Android R. Before the process started, your data was backed up to AnkiWeb and can be restored.
ar: حدث خطأ أثناء نسخ الوسائط الخاصة بك إلى مجلد يدعمه أندرويد ر. قبل بدء العملية، تم النسخ الاحتياطي لبياناتك إلى أنكيويب، ويمكن استعادتها.
ja: Android Rでサポートされているフォルダにメディアをコピー中にエラーが発生しました。 プロセスが開始される前に、データはAnkiWebにバックアップされ、復元できます。
ru: Произошла ошибка при копировании вашего мультимедиа в папку, поддерживаемую Android R. Перед началом процесса ваши данные были скопированы в AnkiWeb и могут быть восстановлены.

source: Before continuing, please:
ar: قبل المتابعة، من فضلك:
ja: 続行する前に、以下を行ってください:
ru: Перед продолжением пожалуйста:

source: Take a backup of your collection (including scheduling + media) via Deck Picker -> Export collection
ar: خذ نسخة احتياطية من مجموعتك (بما في ذلك جدولة + الوسائط) عن طريق منتقي سطح السفينة -> مجموعة التصدير
ja: デッキピッカー -> エクスポートコレクションを介してコレクション（スケジュールとメディアを含む）のバックアップを取る
ru: Возьмите резервную копию вашей коллекции (включая планирование + медиа) с помощью Выбор колоды -> Экспорт коллекции

source: See [Manual Backups](#manual-backups) if you desire a file-based backup
ar: انظر [يدويك النسخ الاحتياطي](#manual-backups) إذا كنت ترغب في نسخة احتياطية قائمة على الملف
ja: ファイルベースのバックアップが必要な場合は、format@@0(#manual-backups) を参照してください。
ru: Смотрите [Ручные резервные копии](#manual-backups), если вы хотите сделать резервную копию на основе файлов

source: Report the error to us: https://docs.ankidroid.org/help.html#\_support
ar: أبلغ عن الخطأ لنا: https://docs.ankidroid.org/help.html#\_Support
ja: エラーを私たちに報告してください: https://docs.ankidroid.org/help.html#\_support
ru: Сообщите нам об ошибке: https://docs.ankidroid.org/help.html#\_support

source: Restoring from AnkiWeb Backup
ar: الاستعادة من AnkiWeb backup
ja: AnkiWebバックアップからの復元
ru: Восстановление из AnkiWeb бэкапа

source: If you have reviewed a significant number of cards using AnkiDroid since the migration started, see: [Modified Collection](#restoring-a-modified-collection)
ar: إذا كنت قد راجعت عددا كبيرا من البطاقات باستخدام أنكيدرويد منذ بدء الهجرة، انظر: [المجموعة المعدلة](#Resing-a-modified-collection)
ja: 移行が開始されてからAnkiDroidを使用してかなりの数のカードをレビューしている場合は、以下を参照してください: format@@0(#restoring-a-modified-collection)
ru: Если с начала миграции вы рассмотрели значительное количество карт, использующих AnkiDroid, посмотрите: [Модифицированная коллекция](#restoring-a-modified-collection)

source: Reinstall AnkiDroid
ar: إعادة تثبيت أنكيدرويد
ja: AnkiDroidを再インストールする
ru: Переустановить AnkiDroid

source: Do not keep app data on uninstall. (_Ensure you have backed up, this will delete the AnkiDroid collection, media and backups from the AnkiDroid folder_)
ar: لا تبقي بيانات التطبيق على إلغاء التثبيت. (_تأكد من أنك قمت بنسخ احتياطي، سيؤدي هذا إلى حذف مجموعة أنكيدرويد والوسائط والنسخ الاحتياطية من مجلد أنكيدرويد_)
ja: アンインストール時にアプリのデータを保持しないでください。(_必ずバックアップしてください。AnkiDroidのコレクション、メディア、バックアップはAnkiDroidフォルダから削除されます。
ru: Не храните данные приложения при удалении. (_Убедитесь, что у вас есть резервная копия, это удалит коллекцию AnkiDroid, медиа и резервные копии из AnkiDroid_)

source: Open AnkiDroid, select "Sync from AnkiWeb",
ar: افتح AnkiDroid، اختر "المزامنة من AnkiWeb"،
ja: AnkiDroidを開き、「AnkiWebから同期」を選択します。
ru: Откройте AnkiDroid, выберите "Sync from AnkiWeb",

source: Log in and re-sync your collection
ar: تسجيل الدخول وإعادة مزامنة مجموعتك
ja: ログインしてコレクションを再同期
ru: Войти и повторно синхронизировать свою коллекцию

source: Syncing will be significantly faster than AnkiDroid 2.15
ar: المزامنة ستكون أسرع بكثير من أنكيدرويد 2.15
ja: AnkiDroid 2.15 より同期が大幅に高速になります
ru: Синхронизация будет значительно быстрее, чем AnkiDroid 2.15

source: Once you are synced, you may delete the folder collection in `/storage/emulated/0/AnkiDroid` to save space.
ar: بمجرد مزامنتك، يمكنك حذف مجموعة المجلدات في `/storage/emulated/0/AnkiDroid` لتوفير المساحة.
ja: 同期したら、`/storage/emulated/0/AnkiDroid` 内のフォルダコレクションを削除してスペースを節約できます。
ru: После синхронизации вы можете удалить коллекцию папок в папке `/storage/emulated/0/AnkiDroid`, чтобы сохранить место.

source: Your collection is now located at `/storage/emulated/0/Android/data/com.ichi2.anki/files`
ar: توجد مجموعتك الآن في `/storage/emulated/0/Android/data/com.ichi2.anki/files`
ja: コレクションは `/storage/emulated/0/Android/data/com.ichi2.anki/files` にあります。
ru: Ваша коллекция находится в `/storage/emulated/0/Android/data/com.ichi2.anki/files`

source: Restoring a Modified Collection
ar: استعادة مجموعة معدلة
ja: 修正されたコレクションの復元
ru: Восстановление измененной коллекции

source: _Ensure that you have backed up your collection and media_
ar: _تأكد من أنك قمت بالنسخ الاحتياطي للمجموعة والوسائط الخاصة بك_
ja: _コレクションとメディアがバックアップされていることを確認してください_
ru: _Убедитесь, что вы сохранили резервную копию вашей коллекции и медиа_

source: Uninstall AnkiDroid
ar: إلغاء تثبيت AnkiDroid
ja: AnkiDroidをアンインストール
ru: Удалить AnkiDroid

source: Do not keep app data. (**This will delete the AnkiDroid collection, media and backups**)
ar: لا تحافظ على بيانات التطبيق. (**سيؤدي هذا إلى حذف مجموعة AnkiDroid والوسائط والنسخ الاحتياطية**)
ja: アプリのデータを保持しないでください。(**AnkiDroidコレクション、メディア、バックアップを削除します**)
ru: Не храните данные приложения. (**Это удалит коллекцию AnkiDroid, медиа и резервные копии**)

source: Select _Get Statred_
ar: حدد _الحصول على الحالة_
ja: _統計情報を取得_を選択してください
ru: Выберите _статистику_

source: Select _Deck Picker -> Import_
ar: حدد _منتقي المجموعة-> استيراد_
ja: デッキピッカー -> インポート_ を選択してください
ru: Выберите _Выбор колоды -> Импорт_

source: Import the backup which was created
ar: استيراد النسخة الاحتياطية التي تم إنشاؤها
ja: 作成されたバックアップをインポート
ru: Импорт резервной копии, которая была создана

source: Open a file browser and browse to `/storage/emulated/0/Android/data/com.ichi2.anki/files`
ar: افتح متصفح الملفات و تصفح إلى `/storage/emulated/0/Android/data/com.ichi2.anki/files`
ja: ファイルブラウザを開き、`/storage/emulated/0/Android/data/com.ich2.anki/files` を参照してください。
ru: Откройте файловый браузер и выберите `/storage/emulated/0/Android/data/com.ichi2.anki/files`

source: Delete the `collection.media` folder and file: `collection.media.ad.db2`. Delete `collection.media.ad.db2-journal` if it exists.
ar: يحذف المجلد والملف `collection.media': `collection.media.ad.db2'. تحذف `collection.media.ad.db2-journal' إن وجدت.
ja: `collection.media` フォルダとファイル: `collection.media.ad.db2` を削除します。`collection.media.ad.db2-journal` が存在する場合は削除します。
ru: Удалите папку `collection.media` и файл: `collection.media.ad.db2`. Удалите `collection.media.ad.db2-journal`, если она существует.

source: Sync with AnkiWeb and your missing media will be downloaded
ar: سيتم تحميل المزامنة مع AnkiWeb والوسائط المفقودة الخاصة بك
ja: AnkiWebとの同期と不足しているメディアがダウンロードされます
ru: Синхронизация с AnkiWeb и отсутствующими файлами будут загружены

source: Personalised Help
ar: مساعدة مخصصة
ja: 個人化されたヘルプ
ru: Персонализированная помощь

source: If you require personalised help, please contact us using one of the following:
ar: إذا كنت بحاجة إلى مساعدة شخصية، فيرجى الاتصال بنا باستخدام أحد ما يلي:
ja: パーソナライズされたヘルプが必要な場合は、以下のいずれかを使用してお問い合わせください:
ru: Если вам нужна персональная помощь, пожалуйста, свяжитесь с нами по следующему адресу:

source: [Mailing List](https://groups.google.com/g/anki-android)
ar: [القائمة البريدية] (https://groups.google.com/g/anki-android)
ja: format@@0(https://groups.google.com/g/anki-android)
ru: [Список рассылки](https://groups.google.com/g/anki-android)

source: [Discord](https://discord.gg/qjzcRTx) (`#help` and/or `#mobile-apps`)
ar: [Discord](https://discord.gg/qjzcRTx) (`#help` و/أو `#mobile-apps`)
ja: [Discord](https://discord.gg/qjzcRTx) (`#help` と `#mobile-apps` )
ru: [Discord](https://discord.gg/qjzcRTx) (`#help` и/или `#mobile-apps`)

source: [Our Reddit community](https://www.reddit.com/r/Anki/)
ar: [مجتمعنا الريدي] (https://www.reddit.com/r/Anki/)
ja: format@@0(https://www.reddit.com/r/Anki/)
ru: [Наше сообщество Reddit](https://www.reddit.com/r/Anki/)

source: [AnkiWeb forums](https://forums.ankiweb.net/c/ankidroid/16)
ar: [منتديات أنكيويب] (https://forums.ankiweb.net/c/ankidroid/16)
ja: format@@0(https://forums.ankiweb.net/c/ankidroid/16)
ru: [AnkiWeb форумы](https://forums.ankiweb.net/c/ankidroid/16)

source: Manual Backups
ar: النسخ الاحتياطي اليدوي
ja: 手動バックアップ
ru: Ручные резервные копии

source: Your migrated data exists at the folder listed in _Settings -> Advanced -> AnkiDroid directory_. This is typically: `/storage/emulated/0/Android/data/com.ichi2.anki/files`
ar: بياناتك المنقولة موجودة في المجلد المدرج في _Settings -> Advanced -> AnkiDroid directory_. هذا عادة: `/storage/emulated/0/Android/data/com.ichi2.anki/files`
ja: 移行されたデータは、_Settings -> Advanced -> AnkiDroidディレクトリ_にリストされたフォルダに存在します。これは通常、次のとおりです: `/storage/emulated/0/Android/data/com.ichi2.anki/files`
ru: Ваши перенесенные данные существуют в папке, перечисленной в _Settings -> Advanced -> AnkiDroid directory_. Это типично: `/storage/emulated/0/Android/data/com.ichi2.anki/files`

source: If you installed a parallel build, replace `com.ichi2.anki` with `com.ichi2.anki.A`
ar: إذا قمت بتثبيت بناء موازٍ، استبدل 'com.ichi2.anki' بـ 'com.ichi2.anki.A`
ja: 並列ビルドをインストールした場合は、`com.ichi2.anki`を`com.ich2.anki.A`に置き換えます。
ru: Если вы установили параллельную сборку, замените `com.ichi2.anki` на `com.ichi2.anki.A`

source: Some file managers will be unable to access this folder. You should be able to access this folder via USB.
ar: لن يتمكن بعض مديري الملفات من الوصول إلى هذا المجلد. يجب أن تكون قادراً على الوصول إلى هذا المجلد عبر USB.
ja: 一部のファイルマネージャーはこのフォルダにアクセスできません。USB経由でこのフォルダにアクセスできるはずです。
ru: Некоторые файловые менеджеры не смогут получить доступ к этой папке. Вы должны иметь доступ к этой папке через USB.

source: Android will offer to delete this folder when AnkiDroid is uninstalled
ar: سيقوم الأندرويد بعرض حذف هذا المجلد عند إلغاء تثبيت AnkiDroid
ja: AndroidはAnkiDroidがアンインストールされたときにこのフォルダを削除します
ru: Android предложит удалить эту папку при удалении AnkiDroid

source: Your non-migrated media and backups of your collection exist at `/storage/emulated/0/AnkiDroid`
ar: الوسائط غير المهاجرة الخاصة بك والنسخ الإحتياطية لمجموعتك موجودة في `/storage/emulated/0/AnkiDroid`
ja: 移行されていないメディアとコレクションのバックアップは `/storage/emulated/0/AnkiDroid` にあります。
ru: Ваши непереносимые медиа и резервные копии вашей коллекции существуют в `/storage/emulated/0/AnkiDroid`

source: Help & Support
ar: المساعدة والدعم
ja: ヘルプ & サポート
ru: Помощь и поддержка

source: Before Asking
ar: قبل السؤال
ja: 依頼する前
ru: Перед запросом

source: Before asking for help, please try searching through the [AnkiDroid Manual](intro.md), the list of [Frequently Asked Questions](https://github.com/ankidroid/Anki-Android/wiki/FAQ), and also the main [Anki Manual](https://docs.ankiweb.net) for general help with the Anki system and features, and any issues not limited to Android.
ar: قبل طلب المساعدة، يرجى محاولة البحث من خلال [AnkiDroid Manual](intro.md)، قائمة [الأسئلة المتكررة](https://github. om/ankidroid/Anki-Android/wiki/FAQ)، وأيضاً format@@0Anki Manual](https://docs.ankiweb.net) للمساعدة العامة مع نظام أنكي والميزات، وأي مشاكل لا تقتصر على Android.
ja: ヘルプを求める前に、format@@0(https://github) のリストである [AnkiDroid Manual](intro.md) から検索してみてください。 om/ankidroid/Anki-Android/wiki/FAQ)、そしてAnkiのシステムと機能の一般的なヘルプ、およびAndroidに限定されない問題に関するメインのformat@@0(https://docs.ankiweb.net)もあります。
ru: Прежде чем обратиться за помощью, попробуйте найти [AnkiDroid Manual](intro.md), список [Часто задаваемые вопросы](https://github. om/ankidroid/Anki-Android/wiki/FAQ), а также главное [руководство для Анки](https://docs.ankiweb.net) для получения общей помощи с системой и функциями Anki, и любые вопросы, не ограничивающиеся Android.

source: Support
ar: الدعم
ja: サポート
ru: Поддержка

source: If you were unable to find what you needed in the documentation above, please visit the relevant site below:
ar: إذا لم تتمكن من العثور على ما تحتاجه في الوثائق المذكورة أعلاه، يرجى زيارة الموقع ذي الصلة أدناه:
ja: 上記のドキュメントに必要なものが見つからない場合は、以下の関連サイトをご覧ください:
ru: Если вы не смогли найти то, что вам необходимо в документации выше, пожалуйста, посетите соответствующий сайт ниже:

source: Non-Android-Specific Issues
ar: مشاكل غير خاصة بالأندرويد
ja: 非Android固有の問題
ru: Особые проблемы неАндроида

source: AnkiDroid (the Android version of Anki) is created and managed independently from other Anki versions. For the PC / Web / iOS versions, and general Anki issues that are not limited to Android, please visit the main [Anki support site](https://forums.ankiweb.net).
ar: أنكيدرويد (نسخة أندرويد من أنكي) يتم إنشاؤها وإدارتها بشكل مستقل عن إصدارات أنكي الأخرى. للحصول على إصدارات الكمبيوتر / Web / iOS ، ومشكلات أنكي العامة التي لا تقتصر على أندرويد، يرجى زيارة الموقع الرئيسي [Anki للدعم] (https://forums.ankiweb.net).
ja: AnkiDroid(AnkiDroidのAndroid版)は、他のAnkiバージョンとは別に作成・管理されています。 PC / Web / iOS バージョンと、Android に限定されない一般的な Anki の問題については、メインの format@@0(https://forums.ankiweb.net を参照してください。
ru: AnkiDroid (Android версия Anki) создается и управляется независимо от других версий Anki. Для версий PC / Web / iOS и общих проблем Anki, которые не ограничиваются Android, пожалуйста, посетите главный [сайт поддержки Ank](https://forums.ankiweb.net).

source: AnkiDroid Questions
ar: أسئلة أنكيدرويد
ja: AnkiDroidに関する質問
ru: AnkiDroid вопросы
