Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Fix text scaling bug in card browser
ar: إصلاح خطأ في قياس النص في متصفح البطاقة
ja: カードブラウザでのテキストスケーリングのバグを修正
ru: Исправлена ошибка масштабирования текста в браузере карты

source: Fix crash in export while using v2 scheduler
ar: إصلاح التعطل في التصدير أثناء استخدام مجدول v2
ja: v2スケジューラの使用中にエクスポートがクラッシュする問題を修正
ru: Исправлена ошибка при экспорте при использовании планировщика v2

source: Fix Custom Tabs crash with non-default system web browser
ar: إصلاح علامات التبويب المخصصة مع متصفح الويب غير الافتراضي للنظام
ja: デフォルト以外のシステムウェブブラウザでカスタムタブがクラッシュする問題を修正
ru: Исправлен сбой пользовательских вкладок при использовании системного веб-браузера не по умолчанию

source: Fix issues with import of packages with long Unicode names
ar: إصلاح المشكلات مع استيراد الحزم مع أسماء يونيكود الطويلة
ja: 長いUnicode名のパッケージのインポートに関する問題を修正
ru: Исправлены проблемы с импортом пакетов с длинными юникодами

source: Fix incorrect intervals on lapsed filtered v2 scheduler cards
ar: إصلاح الفواصل غير الصحيحة على بطاقات المجدولة المنقضية v2
ja: キャンセルされたv2スケジューラカードで間違った間隔を修正しました。
ru: Исправлены некорректные интервалы в закрытых отфильтрованных картах v2 планировщика

source: Fix multimedia editor save/cancel behavior
ar: إصلاح محرر الوسائط المتعددة حفظ/إلغاء السلوك
ja: マルチメディアエディタの保存/キャンセル動作を修正
ru: Исправить поведение мультимедийного редактора для сохранения/отмены

source: Fix incorrect button/gesture availability while existing task is still active
ar: إصلاح توفر الزر/الإيماءة غير صحيح بينما المهمة الحالية لا تزال نشطة
ja: 既存のタスクがアクティブである間、不正なボタン/ジェスチャーの可用性を修正
ru: Исправьте некорректную доступность кнопок/жестов при сохранении активной задачи

source: Fix type answer crash on invalid characters
ar: إصلاح نوع تعطل إجابة على أحرف غير صالحة
ja: 不正な文字で答えがクラッシュする問題を修正
ru: Исправить ошибки в ответе на недопустимые символы

source: Fix cloze references not being recognized in all fields
ar: اصلاح مراجع الملابس التي لم يتم التعرف عليها في جميع الحقول
ja: すべてのフィールドでクローズ参照が認識されない問題を修正しました。
ru: Исправить ссылки на заклинания не во всех полях

source: Fix invalid ability to change deck to a filtered deck
ar: إصلاح القدرة غير صالحة لتغيير المجموعة إلى مجموعة مصفاة
ja: デッキをフィルターデッキに変更する無効な機能を修正
ru: Исправить некорректную возможность изменения колоды на отфильтрованную колоду

source: Fix crashes on adding invalid images, audios, and videos
ar: إصلاح الأعطال عند إضافة صور وصوت ومقاطع فيديو غير صالحة
ja: 無効な画像、オーディオ、ビデオの追加時にクラッシュを修正
ru: Исправлена ошибка при добавлении некорректных изображений, аудио и видео

source: Fix CardBrowser crash after deleting card
ar: إصلاح تعطل بطاقة المتصفح بعد حذف البطاقة
ja: カードを削除した後のCardBrowserのクラッシュを修正
ru: Исправлена ошибка CardBrowser после удаления карты

source: Fix crash and help user if no browser detected
ar: إصلاح الأعطال ومساعدة المستخدم إذا لم يتم اكتشاف المتصفح
ja: ブラウザーが検出されなかった場合、クラッシュとヘルプユーザーを修正します
ru: Исправлен сбой и помощь пользователя, если браузер не обнаружен

source: Fix Reviewer crash if card not available
ar: إصلاح عطل المستعرض إذا كانت البطاقة غير متوفرة
ja: カードが利用できない場合、査読者のクラッシュを修正
ru: Исправить ошибки рецензента, если карта недоступна

source: Fix crash / improve import of pasted decks
ar: إصلاح الأعطال / تحسين استيراد طواقم اللصق
ja: クラッシュを修正/ペーストされたデッキのインポートを改善
ru: Исправление сбоя / улучшить импорт вставленных колод

source: Fix clicking hint field blocks key input in Reviewer
ar: إصلاح النقر فوق حقل تلميح إدخال مفتاح الإدخال في المستعرض
ja: レビューアでのヒントフィールドブロックキー入力を修正しました
ru: Исправление блокирования ввода клавиши при нажатии кнопки подсказки в Обзоре

source: Fix Previewer forgetting which card to show on device rotation
ar: إصلاح نسيان المعاينة البطاقة التي ستظهر على تدوير الجهاز
ja: 端末の回転時に表示するカードを忘れてしまうプレビューを修正
ru: Исправлена ошибка забывания карты при повороте устройства

source: Fix Mathjax/cloze interactions
ar: إصلاح تفاعلات Mathjax/cloze
ja: Mathjax/cloze 相互作用を修正
ru: Исправить взаимодействия Mathjax/cloze

source: Fix vertical alignment of touch area in full-screen review
ar: إصلاح المواءمة العمودية لمنطقة اللمس في مراجعة ملء الشاشة
ja: タッチ領域の垂直方向の位置合わせを全画面表示で修正する
ru: Исправить вертикальное выравнивание сенсорной области в обзоре

source: Fix handling of ':::' in deck names
ar: إصلاح التعامل مع '::' في أسماء المجموعات
ja: デッキ名の「:::」の扱いを修正
ru: Исправлена обработка '::' в названии колоды

source: Fix incorrect display of HTML comments in card browser
ar: إصلاح عرض غير صحيح لتعليقات HTML في متصفح البطاقة
ja: カードブラウザでHTMLコメントが正しく表示されない問題を修正
ru: Исправлено некорректное отображение HTML-комментариев в браузере карты

source: Version 2.9.7 (2020-04-30)
ar: الإصدار 2.9-7 (2020-04-30)
ja: バージョン 2.9.7 (2020-04-30)
ru: Версия 2.9.7 (2020-04-30)

source: Fix crash / workaround deck options timer config regression in AnkiDesktop
ar: إصلاح انحطاط / حول خيارات ضبط ضبط إعدادات مجموعة الخيارات في AnkiDesktop
ja: AnkiDesktopでクラッシュ/回避デッキオプションタイマー設定リグレッションを修正しました。
ru: Исправлена регрессия конфигурации конфигурации в AnkiDesktop

source: Version 2.9.6 (2020-04-03)
ar: الإصدار 2.9.6 (2020-04-03)
ja: バージョン 2.9.6 (2020-04-03)
ru: Версия 2.9.6 (2020-04-03)

source: Fix multimedia crashes (permissions handling, image add, preview)
ar: إصلاح تعطل الوسائط المتعددة (مناولة الأذونات، إضافة صورة، معاينة)
ja: マルチメディアクラッシュの修正 (パーミッション処理、画像追加、プレビュー)
ru: Исправлены сбои мультимедиа (обработка разрешений, добавление изображения, предпросмотр)

source: Fix UI and crashes in database check (user dialog + exception handling)
ar: إصلاح واجهة المستخدم وتعطل في التحقق من قاعدة البيانات (مربع حوار المستخدم + مناولة الاستثناء)
ja: データベースのUIとクラッシュを修正(ユーザーダイアログと例外処理)
ru: Исправлена ошибка пользовательского интерфейса и произошла ошибка при проверке базы данных (диалог пользователя + обработка исключений)

source: Fix Windows 10 image compatibility issue with image paths
ar: إصلاح مشكلة توافق صور Windows 10 مع مسارات الصور
ja: イメージパスでWindows 10のイメージ互換性の問題を修正しました。
ru: Исправлена проблема совместимости образов Windows 10 с путями к изображениям

source: Fix AnkiDesktop sync compatibility issue if more than 1000 cards due
ar: إصلاح مشكلة التوافق في مزامنة Ankiktop إذا كان أكثر من 1000 بطاقة مستحقة
ja: 1000枚以上のカードに問題がある場合、AnkiDesktopの同期互換性の問題を修正しました。
ru: Исправлена проблема совместимости с синхронизацией AnkiDesktop, если в срок более 1000 карт

source: Fix crash in card browser render
ar: إصلاح الأعطال في عرض متصفح البطاقة
ja: ブラウザのレンダリングでクラッシュを修正
ru: Исправлен сбой в рендеринге браузера карты

source: Fix parsing of image tags in card browser
ar: إصلاح تحليل وسوم الصور في متصفح البطاقة
ja: カードブラウザで画像タグの解析を修正
ru: Исправлена разбор тегов изображений в браузере карты

source: Fix crash in StudyOptionsFragment
ar: إصلاح الأعطال في تجزئة OpyOptionsFragment
ja: StudyOptionsFragmentでクラッシュを修正
ru: Фрагменты Исправления

source: Fix issue with deck options group changing on export
ar: إصلاح المشكلة مع مجموعة خيارات المجموعة المتغيرة عند التصدير
ja: エクスポート時にデッキオプショングループが変更される問題を修正
ru: Исправлена проблема с изменением группы опций пачки при экспорте

source: Fix issue with exports containing unexpected media
ar: إصلاح المشكلة مع الصادرات المحتوية على وسائط غير متوقعة
ja: 予期しないメディアを含むエクスポートで問題を修正
ru: Исправлена ошибка экспорта, содержащая неожиданные средства массовой информации

source: Fix issue with dynamic decks (crash fix, export fix)
ar: اصلاح المشكلة مع سطح السفينة الديناميكية (اصلاح التعطيل، اصلاح التصدير)
ja: 動的デッキの問題を修正（クラッシュ修正、エクスポート修正）
ru: Исправлена проблема с динамическими колодами (исправления сбоев, экспортных ошибок)

source: Fix high frequency issue "AnkiDroid directory is inaccessible"
ar: إصلاح مشكلة التردد العالي "دليل AnkiDroid غير قابل للوصول"
ja: 高頻度の問題「AnkiDroidディレクトリにアクセスできない」を修正
ru: Исправлена проблема с высокой частотой "Недоступная папка AnkiDroid"

source: Fix high frequency WebView (card viewer) crash
ar: إصلاح ارتفاع تردد عرض WebView (عارض البطاقة)
ja: 高頻度WebView(カードビューア)クラッシュを修正
ru: Исправлен сбой WebView (окно просмотра карты)

source: Add columns to card browser (due, ease, changed, created, edited)
ar: إضافة أعمدة إلى متصفح البطاقة (مستحق، سهل، تغيير، تم إنشاؤها، تحرير)
ja: カードブラウザに列を追加 (期限、変更、作成、編集)
ru: Добавить столбцы в обозреватель карт (проще, изменено, создан, отредактировано)

source: Fix card scheduler not respecting maximum intervals
ar: إصلاح جدولة البطاقات التي لا تحترم الحد الأقصى للفواصل
ja: カードスケジューラが最大間隔を尊重していない問題を修正
ru: Исправить планировщик карт не соблюдая максимальные интервалы времени

source: Fix card browser spins forever on images or empty strings
ar: إصلاح متصفح البطاقة يعمل إلى الأبد على الصور أو المقاطع الفارغة
ja: 画像または空の文字列でカードのブラウザが永遠に回転するのを修正
ru: Исправление бесконечно прокрутки браузера карты на изображениях или пустой строке

source: Version 2.9.5 (2020-03-15)
ar: الإصدار 2-9-5 (2020-03-15)
ja: バージョン 2.9.5 (2020-03-15)
ru: Версия 2.9.5 (2020-03-15)

source: Fix crash rendering card list while updating card browser search
ar: إصلاح عطل عرض قائمة البطاقة أثناء تحديث بحث متصفح البطاقة
ja: ブラウザ検索の更新中にクラッシュレンダリングカードのリストを修正しました
ru: Исправлен сбой списка карт при обновлении поиска карты

source: Fix case-sensitivity issue with pronunciation words not being found
ar: إصلاح مشكلة حساسية الحالة مع عدم العثور على كلمات النطق
ja: 発音単語が見つからない場合、大文字と小文字の区別の問題を修正
ru: Исправлена проблема чувствительности к регистру с не найденными произношениями

source: Fix crash caused by auto-sync on startup showing dialog too soon
ar: إصلاح الأعطال الناجمة عن المزامنة التلقائية عند بدء التشغيل تظهر مربع الحوار في وقت مبكر جداً
ja: 起動時の自動同期によるクラッシュを修正ダイアログが早すぎます
ru: Исправление сбоя, вызванного автосинхронизацией при запуске диалога слишком скоро

source: Fix crash on preview of TTS cards showing language selectiond dialog too slowly
ar: إصلاح الأعطال عند معاينة بطاقات TTS التي تظهر مربع حوار اختيار اللغة ببطء شديد
ja: TTSカードのプレビュー時に言語選択ダイアログが遅すぎるクラッシュを修正
ru: Исправлен сбой при предварительном просмотре карточек TTS с слишком медленным диалогом выбора языка

source: Fix crash on import if collection not found
ar: إصلاح الأعطال عند الاستيراد إذا لم يتم العثور على مجموعة
ja: コレクションが見つからない場合、インポート時にクラッシュする問題を修正
ru: Исправлена ошибка при импорте, если коллекция не найдена

source: Fix Anki ecosystem deck configuration issue for Anki Desktop users \<= 2.16
ar: إصلاح مشكلة تكوين سطح المكتب أنكي لأنكي للمستخدمين سطح المكتب \<= 2.16
ja: Anki Desktopユーザーのアンキエコシステムデッキ設定の問題を修正 \<= 2.16
ru: Исправлена проблема конфигурации колоды экосистем Anki Desktop пользователей \<= 2.16

source: Fix crash if user attempts to open camera or gallery and no app is available
ar: إصلاح التعطل إذا حاول المستخدم فتح الكاميرا أو المعرض ولا يوجد تطبيق متاح
ja: ユーザーがカメラやギャラリーを開こうとし、アプリがない場合にクラッシュするのを修正
ru: Исправлен сбой, если пользователь пытается открыть камеру или галерею, и приложение недоступно

source: Fix crash building deck reminders while deck is synchronizing
ar: إصلاح تذكيرات مجموعة الأعطال عند مزامنة المجموعة
ja: デッキ同期中にクラッシュビルディングのデッキリマインダーを修正
ru: Исправить напоминания о сбое колоды зданий во время синхронизации колоды

source: Fix crash related to audio recording stop
ar: إصلاح الأعطال المرتبطة بإيقاف تسجيل الصوت
ja: 録音停止に関連するクラッシュを修正
ru: Исправлена ошибка, связанная с остановкой аудиозаписи

source: Show helpful messages if import fails because device is out of space
ar: إظهار الرسائل المفيدة في حالة فشل الاستيراد لأن الجهاز خارج المساحة
ja: デバイスの空き容量が少なくなっているため、インポートが失敗した場合に役立つメッセージを表示する
ru: Показывать полезные сообщения, если импорт не удался, потому что устройство не занято

source: Fix crash when taking pictures on devices with Lollipop and older
ar: إصلاح الأعطال عند التقاط الصور على الأجهزة مع Lollipop والأقدم
ja: Lollipop 以前のデバイスで写真を撮った時のクラッシュを修正
ru: Исправлять ошибки при съемке изображений на устройствах с помощью Lollipop и старше

source: Version 2.9.4 (2020-02-18)
ar: الإصدار 2.9-4 (2020-02-18)
ja: バージョン 2.9.4 (2020-02-18)
ru: Версия 2.9.4 (2020-02-18)

source: Fix crash when fetching pronunciations in note editor
ar: إصلاح الأعطال عند جلب النطقات في محرر الملاحظات
ja: ノートエディタで発音を取得するときにクラッシュする問題を修正
ru: Исправлен сбой при получении произношения в редакторе заметок

source: Fix issue with pronunciation words not being found
ar: إصلاح مشكلة مع كلمات النطق غير موجودة
ja: 発音単語が見つからない問題を修正
ru: Исправление проблемы с произношением слов не найдено

source: Fix crash on startup for users with auto-sync on startup
ar: إصلاح الأعطال عند بدء التشغيل للمستخدمين مع المزامنة التلقائية عند بدء التشغيل
ja: 起動時に自動同期を持つユーザーの起動時のクラッシュを修正
ru: Исправление сбоя при запуске для пользователей с автосинхронизацией при запуске

source: Fix crash on deck import when app is in background
ar: إصلاح الأعطال عند استيراد المجموعة عندما يكون التطبيق في الخلفية
ja: アプリがバックグラウンドで動作している時のデッキインポート時のクラッシュを修正
ru: Исправлен сбой при импорте колоды, когда приложение находится в фоновом режиме

source: Fix crash for users of Google Chrome Canary
ar: إصلاح الأعطال لمستخدمي كناري Google Chrome
ja: Google Chrome Canary のユーザーのクラッシュを修正
ru: Исправлен сбой пользователей Google Chrome Canary

source: Fix crash when adding certain audio clips
ar: إصلاح الأعطال عند إضافة مقاطع صوتية معينة
ja: 特定のオーディオクリップを追加する際のクラッシュを修正
ru: Исправлен сбой при добавлении некоторых аудиоклипов

source: Fix crash related to fetching Sound metadata
ar: إصلاح الأعطال المتصلة بجلب بيانات التعريف الصوتية
ja: サウンドメタデータの取得に関連するクラッシュを修正
ru: Исправлен сбой, связанный с извлечением метаданных Звука

source: Fix issue where audio plays twice
ar: إصلاح المشكلة حيث يشغل الصوت مرتين
ja: オーディオ再生が2回行われる問題を修正
ru: Исправлена проблема, когда дважды воспроизводился звук

source: Version 2.9.3 (2020-02-09)
ar: الإصدار 2-9-3 (2020-02-09)
ja: バージョン 2.9.3 (2020-02-09)
ru: Версия 2.9.3 (2020-02-09)

source: Fix issues with connection timeouts and new encryption library
ar: إصلاح المشكلات مع مواعيد الاتصال ومكتبة التشفير الجديدة
ja: 接続タイムアウトと新しい暗号化ライブラリの問題を修正
ru: Исправлены проблемы с таймаутами соединения и новой библиотекой шифрования

source: Fix incorrect handling of decks with ':::' in their name
ar: إصلاح المعالجة غير الصحيحة لطوابق مع '::' في إسمهم
ja: 名前が「:::」のデッキの扱いが間違っている問題を修正しました
ru: Исправьте неправильную обработку колод с ':::' в их имени

source: Version 2.9.2 (2020-02-03)
ar: الإصدار 2-9-2 (2020-02-03)
ja: バージョン 2.9.2 (2020-02-03)
ru: Версия 2.9.2 (2020-02-03)

source: Add support for new AnkiWeb encryption changes
ar: إضافة دعم للتغييرات الجديدة في تشفير AnkiWeb
ja: 新しいAnkiWeb暗号化の変更をサポートします。
ru: Добавить поддержку новых изменений в AnkiWeb шифровании

source: Fix some bugs using filtered decks
ar: إصلاح بعض الأخطاء باستخدام فرقات التصفية
ja: フィルタリングされたデッキを使用してバグを修正
ru: Исправлены ошибки с помощью отфильтрованных колод

source: Fix crash on app startup with uninitialized collection
ar: إصلاح الأعطال عند بدء تشغيل التطبيق مع مجموعة غير مهيأة
ja: 初期化されていないコレクションでアプリの起動時にクラッシュする問題を修正
ru: Исправить сбой при запуске приложения с неинициализированной коллекцией

source: Fix some issues with new cloze deletion menu
ar: إصلاح بعض المشكلات مع قائمة حذف الملابس الجديدة
ja: 新しい閉じる削除メニューでいくつかの問題を修正
ru: Исправлены некоторые проблемы с новым меню удаления cloze

source: Fix issue with Mathjax + cloze deletion
ar: إصلاح المشكلة مع حذف Mathjax + cloze
ja: Mathjax + cloze deletion で問題を修正
ru: Исправлена проблема с удалением Mathjax + cloze

source: Fix incorrect intervals bug with new scheduler
ar: إصلاح خلل الفواصل غير صحيحة مع المجدول الجديد
ja: 新しいスケジューラで間隔が正しくないバグを修正
ru: Исправлена ошибка некорректных интервалов с новым планировщиком

source: Add various patches from Anki Desktop
ar: إضافة العديد من التصحيحات من سطح المكتب أنكي
ja: Anki Desktop から様々なパッチを追加
ru: Добавить различные патчи из Anki Desktop

source: Version 2.9.1 (2019-10-16)
ar: الإصدار 2-9-1 (2019-10-16)
ru: Версия 2.9.1 (2019-10-16)

source: Fix crash reviewing on Android 5 - 7
ar: إصلاح تعطل المراجعة على أندرويد 5 - 7
ja: Android 5-7でクラッシュレビューを修正しました
ru: Исправлен обзор сбоев на Android 5 - 7

source: Fix crash on Hungarian translation
ar: إصلاح الأعطال على الترجمة الهنغارية
ja: ハンガリー語の翻訳時にクラッシュを修正
ru: Исправлена ошибка при венгерском переводе

source: Version 2.9 (2019-10-14)
ar: الإصدار 2.9 (2019-10-14)
ru: Версия 2.9 (2019-10-14)

source: Change to new adaptive icon
ar: تغيير إلى أيقونة تكيفية جديدة
ja: 新しいアダプティブアイコンに変更
ru: Изменить на новый адаптивный значок

source: Add multi-select in the card browser (delete, change deck, reschedule)
ar: إضافة تحديد متعدد في متصفح البطاقة (حذف، تغيير المجموعة، إعادة الجدول)
ja: カードブラウザに複数選択を追加（削除、デッキの変更、スケジュール変更）
ru: Добавить мульти-выборку в обозреватель карты (удалять, изменить колоду, перепланировать)

source: Add support for new Anki 2.1 scheduler
ar: إضافة دعم لجدولة أنكي 2.1 جديدة
ja: 新しいAnki 2.1スケジューラのサポートを追加
ru: Добавить поддержку нового планировщика Anki 2.1

source: Add support for Mathjax
ar: إضافة دعم لـ Mathjax
ja: Mathjax のサポートを追加
ru: Добавить поддержку Mathjax

source: Add ability to add local audio files to notes
ar: إضافة القدرة على إضافة ملفات صوتية محلية إلى الملاحظات
ja: ローカルオーディオファイルをノートに追加する機能を追加
ru: Добавить возможность добавлять локальные аудио файлы в заметки

source: Add ability to specify filename and folder on export and import
ar: إضافة القدرة على تحديد اسم الملف والمجلد عند التصدير والاستيراد
ja: エクスポートとインポート時にファイル名とフォルダを指定する機能を追加
ru: Добавить возможность указания имени файла и папки при экспорте и импорте

source: Add ability to insert cloze in Note Editor
ar: إضافة القدرة على إدراج ملابس في محرر الملاحظات
ja: ノートエディターにクローズを挿入する機能を追加
ru: Добавить возможность заклеивания в редактор заметок

source: Add ability to reposition cards
ar: إضافة القدرة على إعادة توجيه البطاقات
ja: カードの位置を変更する機能を追加
ru: Добавить возможность переводить карты

source: Add ability to use due reminders for specific decks
ar: إضافة القدرة على استخدام التذكيرات الواجبة لمجموعات محددة
ja: 特定のデッキに期限切れのリマインダーを使用する機能を追加
ru: Добавить возможность использовать напоминания для определенных колод

source: Add support for gamepad input when reviewing
ar: إضافة دعم لمدخلات لوحة اللعبة عند المراجعة
ja: レビュー時にゲームパッド入力のサポートを追加
ru: Добавить поддержку ввода геймпада при просмотре

source: Add support for common keyboard shortcuts from Anki Desktop
ar: إضافة دعم لاختصارات لوحة المفاتيح الشائعة من سطح المكتب أنكي
ja: Anki Desktopから一般的なキーボードショートカットのサポートを追加
ru: Добавить поддержку общих горячих клавиш с Anki Desktop

source: Add ability to search in Card Browser for text from system context menu
ar: إضافة القدرة على البحث في متصفح البطاقة عن النص من قائمة سياق النظام
ja: カードブラウザでシステムコンテキストメニューからテキストを検索する機能を追加
ru: Добавить возможность поиска в Card Browser для текста из контекстного меню системы

source: Add ability to recognize tts HTML elements in questions and answers
ar: إضافة القدرة على التعرف على عناصر HTML في الأسئلة والإجابات
ja: 質問と回答に HTML 要素を認識する機能を追加
ru: Добавить возможность распознавать HTML элементы в вопросах и ответах

source: Add ability to display LaTeX rendered to SVG (vs PNG) from Anki Desktop
ar: إضافة القدرة على عرض LaTeX المقدمة إلى SVG (مقابل PNG) من سطح المكتب أنكي
ja: Anki DesktopからSVG（対PNG）にレンダリングされたLaTeXを表示する機能を追加する
ru: Добавить возможность отображения LaTeX в SVG против PNG) с Anki рабочего стола

source: Add confirmation check for full sync trigger in preferences
ar: إضافة تأكيد التحقق للمزامنة الكاملة في التفضيلات
ja: 設定に完全な同期トリガーの確認を追加する
ru: Добавить проверку подтверждения полной синхронизации триггера в настройках

source: Fix excessive pull-to-sync false positives. Disable when not at top of page.
ar: إصلاح الموجبات الزائفة الزائفة للسحب للمزامنة. تعطيل عندما لا يكون في أعلى الصفحة.
ja: Pull-to-sync誤検知を多く修正しました。ページ上部にない場合は無効にしてください。
ru: Исправлено чрезмерное срабатывание срабатывания. Отключать, если вверху страницы нет срабатывания.

source: Fix some issues with focus in Note Editor
ar: إصلاح بعض المشكلات مع التركيز في محرر الملاحظات
ja: ノートエディターでフォーカスを合わせていくつかの問題を修正
ru: Исправить некоторые проблемы с фокусом в редакторе заметок

source: Fix media sync errors related to file creation issues
ar: إصلاح أخطاء مزامنة الوسائط ذات الصلة بمشاكل إنشاء الملفات
ja: ファイル作成に関するメディア同期エラーを修正
ru: Исправлены ошибки синхронизации медиафайлов, связанные с созданием файла

source: Fix crash related to use of camera without permission or no camera hardware
ar: إصلاح الأعطال ذات الصلة باستخدام الكاميرا بدون إذن أو بدون أي أجهزة كاميرا
ja: カメラハードウェアの許可なしにカメラの使用に関連するクラッシュを修正
ru: Исправлена ошибка, связанная с использованием камеры без разрешения или без аппаратного обеспечения камеры

source: Fix crash related to Card Browser allowing preview with no cards selected
ar: إصلاح الأعطال ذات الصلة بمتصفح البطاقة مع عدم تحديد بطاقات
ja: カードブラウザに関連するクラッシュを修正し、カードが選択されていないプレビューを可能にしました。
ru: Исправлена ошибка, связанная с обозревателем карт, позволяющая предварительный просмотр без выбранных карт

source: Fix crash in Reviewer when collection inaccessible
ar: إصلاح الأعطال في المستعرض عندما يتعذر الوصول إلى المجموعة
ja: コレクションにアクセスできないときにレビューアでクラッシュを修正する
ru: Исправлена ошибка в рецензенте, когда коллекция недоступна

source: Fix crash related to TTS when TTS not initialized
ar: إصلاح الأعطال ذات الصلة بTTS عندما لا يتم تهيئة TTS
ja: TTSが初期化されていないときにTTSに関連するクラッシュを修正しました
ru: Исправлена ошибка, связанная с TTS, когда TTS не инициализирован

source: Fix crash related to sdcard mount/unmount on inaccessible collection
ar: إصلاح الانهيار المتصل بحمل/إلغاء تحميل بطاقة الذاكرة على مجموعة لا يمكن الوصول إليها
ja: アクセスできないコレクションでSDカードのマウント/マウント解除に関連するクラッシュを修正
ru: Исправлен сбой в связи с монтированием/отключением карты на недоступной коллекции

source: Fix crash related to audio button being visible after loading pronunciation media
ar: إصلاح الأعطال المرتبطة بكون زر الصوت مرئيًا بعد تحميل وسائط النطق
ja: 発音メディアを読み込んだ後に音声ボタンが表示される不具合を修正
ru: Исправлена ошибка, связанная с появлением звуковой кнопки после загрузки произношения медиа

source: Fix crash when attempting to import invalid zip files
ar: إصلاح الأعطال عند محاولة استيراد ملفات zip غير صالحة
ja: 無効なzipファイルをインポートしようとした時のクラッシュを修正
ru: Исправлен сбой при попытке импорта недопустимых zip-файлов

source: Fix crash related to switching from split-window mode to single-window mode
ar: إصلاح الأعطال المتصلة بالتبديل من وضع تقسيم النافذة إلى وضع النافذة الواحدة
ja: 分割ウィンドウモードから単一ウィンドウモードへの切り替えに関連するクラッシュを修正
ru: Исправлена ошибка, связанная с переключением режима сплит-окна в однооконный режим

source: Fix crash related to missing preferences in Preference editor
ar: إصلاح التعطل المتصل بفضيلات ناقصة في محرر التفضيل
ja: 環境設定エディターで不足している設定に関連するクラッシュを修正
ru: Исправлена ошибка, связанная с отсутствием настроек в редакторе настроек

source: Fix crash on deck selection after deleting a deck and immediately closing app
ar: إصلاح الأعطال عند اختيار مجموعة بعد حذف مجموعة وإغلاق التطبيق على الفور
ja: デッキを削除してアプリを直ちに閉じた後のデッキ選択時にクラッシュする問題を修正
ru: Исправлен сбой при выборе колоды после удаления колоды и немедленного закрытия приложения

source: Fix crash in Reviewer when non-standard browser installed
ar: إصلاح الأعطال في المستعرض عند تثبيت المتصفح غير القياسي
ja: 標準以外のブラウザがインストールされた場合にレビューアでクラッシュする問題を修正
ru: Исправлен сбой в редакторе при установке нестандартного браузера

source: Fix type-answer field showing unexpectedly after undo in Reviewer
ar: إصلاح حقل نوع الإجابة يظهر بشكل غير متوقع بعد التراجع في المستعرض
ja: レビューアで元に戻した後に予期せず表示するタイプ応答フィールドを修正
ru: Исправить поле ввода типа ответа неожиданно после отмены в Reviewer

source: Fix incorrect display of some characters when using type-answer
ar: إصلاح عرض غير صحيح لبعض الأحرف عند استخدام نوع الإجابة
ja: 型解答を使用しているときに一部の文字が間違って表示される問題を修正しました
ru: Исправлено некорректное отображение некоторых символов при использовании типового ответа

source: Fix error related to media in subfolders not showing in Reviewer
ar: إصلاح الخطأ المتصل بالوسائط في المجلدات الفرعية التي لا تظهر في المستعرض
ja: Reviewerに表示されないサブフォルダのメディアに関連するエラーを修正しました
ru: Исправлена ошибка, связанная с файлами в подпапках, которые не отображаются в Reviewer
