Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Gamepad A
ar: لوحة اللعبة A
ja: ゲームパッドA
ru: Геймпад A

source: Flip Card/Press the fourth answer button
ar: قلب البطاقة/الضغط على زر الإجابة الرابع
ja: カードを裏返す/4番目の回答ボタンを押す
ru: Перевернуть карту/Нажмите четвертую кнопку ответа

source: Space
ar: المساحة
ja: スペース
ru: Пространство

source: Enter
ar: أدخل
ru: Вход

source: Flip Card/Answer Good
ar: قلب البطاقة/اجابة جيدة
ja: カードを裏返し/良い答え
ru: Перевернуть карту/ответ Хорошо

source: e
ar: ج
ru: е

source: Edit Note
ar: تعديل الملاحظة
ja: メモを編集
ru: Изменить заметку

source: Mark Note
ar: ملاحظة علامة
ja: メモをマークする
ru: Пометить заметку

source: Bury Card
ar: بطاقة دفن
ja: カードを破棄する
ru: Жуткая карта

source: Bury Note
ar: دفن ملاحظة
ja: ノートを一時的に削除
ru: Заметка бури

source: Suspend Card
ar: تعليق البطاقة
ja: カードを一時停止する
ru: Приостановить Карту

source: Suspend Note
ar: تعليق الملاحظة
ja: ノートを中断
ru: Приостановить заметку

source: r
ar: ص
ru: п

source: F5
ar: ف5

source: Replay Media
ar: إعادة عرض الوسائط
ja: メディアの再生
ru: Повторить медиа

source: z
ar: ز

source: Note Editor
ar: محرر الملاحظة
ja: ノートエディター
ru: Редактор заметок

source: Save Note
ar: حفظ الملاحظة
ja: メモを保存
ru: Сохранить заметку

source: D
ar: د
ru: Д

source: Select Deck
ar: حدد مجموعة
ja: デッキを選択
ru: Выбрать колоду

source: L
ar: ل
ru: Л

source: Card Template Editor
ar: محرر قالب البطاقة
ja: カードテンプレートエディター
ru: Редактор шаблонов карт

source: N
ar: ن
ru: Н

source: Select Note Type
ar: حدد نوع الملاحظة
ja: ノートタイプの選択
ru: Выберите тип заметки

source: T
ar: ت
ru: Т

source: Edit Tags
ar: تعديل العلامات
ja: タグを編集
ru: Изменить теги

source: P
ar: ب
ru: П

source: Preview Note
ar: معاينة الملاحظة
ja: メモをプレビュー
ru: Предпросмотр заметки

source: I
ar: ص
ru: В

source: U
ar: يو
ru: У

source: Underline
ar: أسفل
ja: アンダーライン
ru: Подчёркивание

source: R
ar: ر
ru: Р

source: Insert Horizontal Rule
ar: إدراج قاعدة أفقية
ja: 水平方向のルールを挿入
ru: Вставить горизонтальную линейку

source: H
ar: خ
ru: Н

source: Insert Title
ar: إدراج عنوان
ja: タイトルを挿入
ru: Вставить заголовок

source: F
ar: ف
ru: П

source: Change Font Size
ar: تغيير حجم الخط
ja: フォントサイズの変更
ru: Изменить размер шрифта

source: M
ar: م
ru: М

source: Insert MathJax Equation
ar: إدراج معادلة MathJax
ja: MathJax 式を挿入
ru: Вставить уравнение MathJax

source: Shift
ar: تبديل
ru: Сдвиг

source: C
ar: ج
ru: С

source: Insert New Cloze Deletion
ar: إدراج حذف جديد من Cloze
ja: 新しい閉じる削除を挿入
ru: Вставить новое удаление Клога

source: Insert Cloze Deletion using existing number
ar: إدراج حذف Cloze باستخدام الرقم الموجود
ja: 既存の番号を使用して閉じる削除を挿入
ru: Вставить удаление цилиндра, используя существующий номер

source: Insert User-Defined HTML
ar: إدراج تعريف المستخدم HTML
ja: ユーザー定義HTMLの挿入
ru: Вставить HTML, определённый пользователем

source: Select All
ar: حدد الكل
ja: すべて選択
ru: Выделить все

source: E
ar: ه
ru: В

source: Change Deck
ar: تغيير مجموعة
ja: デッキを変更
ru: Изменить колоду

source: K
ar: ك
ru: К

source: Preview Changed
ar: تم تغيير المعاينة
ja: プレビューが変更されました
ru: Предпросмотр изменен

source: Anki and AnkiDroid have full support for RTL languages such as Arabic, Hebrew, and Persian.
ar: ويحظى كل من أنكي وأنكيدرويد بالدعم الكامل للغات إعادة التأهيل مثل العربية والعبرية والفارسية.
ja: AnkiとAnkiDroidは、アラビア語、ヘブライ語、ペルシャ語などのRTL言語を完全にサポートしています。
ru: Анки и Анкидроид поддерживают такие языки как арабский, иврит и персийский.

source: Editing Fields as RTL
ar: تعديل الحقول كـ RTL
ja: フィールドをRTLとして編集する
ru: Редактирование полей как RTL

source: Fields can be marked as RTL (currently possible only from Anki Desktop) for RTL editing. When a field is marked as RTL, then the text is right-aligned in editing fields and punctuation is correctly displayed at the end (left) of sentences. Text that contains blocks of LTR characters will be properly displayed as well, with the beginning of the sentence appearing to the right of the LTR block and the end of the sentence being displayed to the left of the LTR block.
ar: يمكن وضع علامة على الحقول كـ RTL (ممكن حاليا فقط من سطح مكتب أنكي) لتحرير RTL. عندما يتم وضع علامة على حقل كـ RTL، ثم يتم محاذاة النص إلى اليمين في تحرير الحقول ويتم عرض علامات الترقيم بشكل صحيح في نهاية الجمل (اليسار). سيتم عرض النص الذي يحتوي على كتل من أحرف LTR بشكل صحيح أيضًا. مع بداية الجملة التي تظهر لليمين في كتلة LTR ونهاية الجملة المعروضة على يسار كتلة LTR.
ja: フィールドは RTL (現時点ではAnki Desktop からのみ可能) としてマークでき、RTL 編集できます。 フィールドがRTLとしてマークされている場合 次に、編集フィールドでは右揃えのテキストが表示され、文の最後(左)に句読点が正しく表示されます。 LTR文字のブロックを含むテキストも正しく表示されます。 LTRブロックの右側に文の先頭が表示され、LTRブロックの左側に文の末尾が表示されます。
ru: Поля могут быть помечены как RTL (сейчас возможно только из Anki Desktop) для редактирования RTL. Когда поле помечено как RTL, , то текст выравнивается правой кнопкой в полях редактирования и знаки пунктуации правильно отображаются в конце (слева) предложений. Текст, содержащий блоки LTR символов, также будет правильно отображен. с началом предложения, появляющегося справа от блока LTR, и конца отображаемого предложения слева от блока LTR.

source: Directionality is especially important for editing and creating RTL cloze deletions as the cloze format includes both neutral and LTR markup characters. Therefore it is recommended to use a separate note type for LTR cloze deletions and RTL cloze deletions.
ar: والاتجاه مهم بشكل خاص لتحرير وإنشاء عمليات حذف ملابس RTL لأن تنسيق الملابس يشمل حروف العلامات المحايدة وLTR على حد سواء. ولذلك يوصى باستخدام نوع ملاحظات منفصل لحذف الحذف من LTR والكساء وحذف الحذف من RTL.
ja: クロゼ形式にニュートラルとLTRマークアップ文字の両方が含まれているため、方向性は、RTLクローゼット削除を編集して作成するために特に重要です。 したがって、LTRのクローズ削除とRTLのクローズ削除には、別のノートタイプを使用することをお勧めします。
ru: Направленность особенно важна для редактирования и создания RTL cloze удалений, поскольку формат cloze включает как нейтральные, так и LTR разметки. Поэтому рекомендуется использовать отдельный тип заметок для удалений из LTR-клеза и удаления клезных заклинаний RTL.

source: Displaying Fields as RTL during study
ar: عرض الحقول كـ RTL أثناء الدراسة
ja: 研究中にフィールドをRTLとして表示する
ru: Отображение полей как RTL во время обучения

source: To display a field as RTL, with proper right-alignment and directionality (punctuation at left of sentences, proper flow around LTR blocks), the field should be wrapped in a div or span element with the RTL directionality specified:
ar: لعرض حقل كـ RTL، مع محاذاة اليمين والاتجاه الصحيحين (علامات الترقيم على اليسار من الجمل)، التدفق الصحيح حول كتل LTR )، يجب تغليف الحقل في صفيف أو عنصر امتداد مع اتجاه RTL المحدد:
ja: フィールドをRTLとして表示するには、適切な右揃えと方向(文章の左側に句読点)を使用します。 LTRブロック周りの適切なフロー)、フィールドはRTL方向が指定されたdivまたはスパン要素でラップする必要があります。
ru: Для отображения поля как RTL, с правильным правом-выравниванием и направленностью (пунктуация слева от предложений, правильный поток вокруг блоков LTR), поле должно быть обернуто в div или span элемент с указанием RTL направления:

source: [Via Cloud Sync](#via-cloud-sync)
ar: [مزامنة Via Cloud Sync](#via-cloud-sync)
ja: format@@0(#via-cloud-sync)
ru: [Через облачную синхронизацию](#via-cloud-sync)

source: [Sync existing decks into a new AnkiDroid install](#sync-existing-decks-into-a-new-ankidroid-install)
ar: [مزامنة الطواقم الموجودة في تثبيت أنكيدرويد جديد](#sync-existing-decks-into-a-new-ankidroid-install)
ja: format@@0(#sync-existing-decks-into-a-new-ankiddroid-install)
ru: [Синхронизировать существующие колоды с новыми установками AnkiDroid](#sync-existing-decks-into-a-new-ankidroid-install)

source: [Sync from AnkiDroid to Computer](#sync-from-ankidroid-to-computer)
ar: [مزامنة من AnkiDroid إلى الكمبيوتر] (#sync-from-ankidroidإلى الكمبيوتر)
ja: format@@0(#sync-from-ankidroid-to-computer)
ru: [Синхронизировать с AnkiDroid на компьютер](#sync-from-ankidroid-to-computer)

source: Anki has a free cloud synchronization service called AnkiWeb that makes it easy to keep your card decks in sync between mobile devices and your computer. If you cannot use sync for some reason, it's also possible to use USB, though this method is more laborious.
ar: لدى أنكي خدمة مزامنة سحابية مجانية تسمى AnkiWeb تجعل من السهل الحفاظ على مجموعات البطاقة في تزامن بين الأجهزة المحمولة وأجهزة الكمبيوتر. إذا لم تستطع استخدام المزامنة لسبب ما، فمن الممكن أيضًا استخدام USB، على الرغم من أن هذه الطريقة أكثر صعوبة.
ja: Ankiには無料のクラウド同期サービスAnkiWebがあり、モバイルデバイスとコンピュータ間でカードデッキを簡単に同期させることができます。 何らかの理由でsyncを使用できない場合は、USBを使用することもできますが、このメソッドはより面倒です。
ru: В Anki есть бесплатная облачная синхронизация, которая позволяет легко синхронизировать колоды между мобильными устройствами и компьютером. Если вы не можете использовать синхронизацию по какой-то причине, то также возможно использовать USB, хотя этот метод более трудоемкий.

source: Note that AnkiDroid is not affiliated with Anki Desktop or AnkiWeb. AnkiDroid is based on Anki Desktop but it is developed by an entirely separate community of volunteers.
ar: لاحظ أن أنكيدرويد غير منتسب إلى سطح المكتب أنكي أو موقع أنكيويب. ويستند أنكيدرويد إلى حاسوب أنكي المكتبي، ولكنه يطوره مجتمع مستقل تماما من المتطوعين.
ja: AnkiDroidは、AnkiデスクトップまたはAnkiWebとは提携していません。 AnkiDroidはAnkiデスクトップをベースにしていますが、完全に別々のボランティアコミュニティによって開発されています。
ru: Обратите внимание, что AnkiDroid не связан с Anki Desktop или AnkiWeb. AnkiDroid основан на Anki Desktop, но разрабатывается совершенно отдельным сообществом волонтеров.

source: Via Cloud Sync
ar: مزامنة عبر السحابة
ja: クラウド同期による
ru: Через облачную синхронизацию

source: Before you can use AnkiWeb, you'll first need to create an account by visiting [https://ankiweb.net](https://ankiweb.net) and clicking the **Sign Up** button. If you have used AnkiWeb in the past, you can skip this step. After signing up, see the corresponding instructions below, depending on whether you are trying to get your existing decks into AnkiDroid or out of AnkiDroid.
ar: قبل أن تتمكن من استخدام AnkiWeb، ستحتاج أولاً إلى إنشاء حساب عن طريق زيارة [https://ankiweb.net](https://ankiweb. et) و انقر فوق زر **التسجيل**. إذا كنت قد استخدمت AnkiWeb في الماضي، يمكنك تخطي هذه الخطوة. بعد التسجيل، انظر التعليمات المقابلة أدناه اعتماداً على ما إذا كنت تحاول الحصول على أسطح الأنكيدرويد أو الخروج من أنكيدرويد.
ja: AnkiWebを使用する前に、まず[https://ankiweb.net](https://ankiweb)からアカウントを作成する必要があります。 ) **サインアップ** ボタンをクリックしてください。過去にAnkiWebを使用したことがある場合は、この手順をスキップしてください。 サインアップ後、既存のデッキをAnkiDroidに入れようとしているか、AnkiDroidから抜けようとしているかどうかに応じて、以下の対応する手順を参照してください。
ru: Прежде чем использовать AnkiWeb, вам нужно сначала создать учетную запись, посетив [https://ankiweb.net](https://ankiweb. и т.д) и нажав на кнопку **Регистрация**. Если вы использовали AnkiWeb в прошлом, вы можете пропустить этот шаг. После регистрации, смотрите соответствующие инструкции ниже, в зависимости от того, пытаетесь ли вы получить ваши существующие колоды в AnkiDroid или из AnkiDroid.

source: Sync existing decks into a new AnkiDroid install
ar: مزامنة المجموعات الموجودة في تثبيت أنكيدرويد جديد
ja: 既存のデッキを新しいAnkiDroidのインストールに同期
ru: Синхронизировать существующие колоды в новую установку AnkiDroid

source: In this scenario you have some existing Anki decks that you want to copy into a new install of AnkiDroid by syncing with AnkiWeb. Open the Anki client with your existing decks (usually this would be Anki desktop, but it could also mean a version of AnkiDroid you have been using on another device), and click the synchronization button (which has two arrows in a circle) at the top right of the deck list.
ar: في هذا السيناريو لديك بعض طواقم أنكي الموجودة التي تريد نسخها إلى تثبيت جديد من أنكيدرويد بالمزامنة مع أنكيويب. افتح عميل أنكي بفرقك الحالية (عادة ما يكون هذا سطح مكتب أنكي، ولكن يمكن أن يعني أيضا إصدار من AnkiDroid كنت تستخدمه على جهاز آخر)، وانقر فوق زر المزامنة (الذي يحتوي على سهمين في دائرة) في أعلى يمين قائمة المجموعة.
ja: このシナリオでは、AnkiWebと同期してAnkiDroidの新しいインストールにコピーする既存のアンキデッキがいくつかあります。 既存のデッキでAnkiクライアントを開きます(通常はAnkiデスクトップになります)。 他のデバイスで使用しているAnkiDroidのバージョンを意味することもあります) をクリックして、デッキリストの右上にある同期ボタン(円に2つの矢印があります)をクリックします。
ru: В этом сценарии у вас есть несколько существующих колод Anki, которые вы хотите скопировать в новую установку AnkiDroid, синхронизируя с AnkiWeb. Откройте Anki клиент с существующими колодами (обычно это Анки рабочий стол, но это также может означать версию AnkiDroid, которую вы использовали на другом устройстве), и нажмите на кнопку синхронизации (которая имеет две стрелки в круге) в правом верхнем углу списка.

source: If you have never used AnkiWeb before you will need to enter your credentials if prompted, and then press the **Upload to AnkiWeb** button to confirm overwriting the empty collection on AnkiWeb with your existing decks in Anki. Anki will upload all your cards, images and audio to AnkiWeb. If you have a lot of media, this may take some time.
ar: إذا كنت لم تستخدم AnkiWeb قبل أن تحتاج إلى إدخال بيانات الاعتماد الخاصة بك إذا طُلب منك، ثم اضغط على زر **التحميل إلى AnkiWeb** لتأكيد الكتابة فوق المجموعة الفارغة على AnkiWeb مع عناوينك الموجودة في Anki. سيقوم Anki بتحميل جميع بطاقاتك وصورك وصوتك إلى موقع AnkiWeb. إذا كان لديك الكثير من الوسائط، قد يستغرق هذا بعض الوقت.
ja: AnkiWeb を使用したことがない場合は、プロンプトが表示されたら認証情報を入力する必要があります。 そして、**AnkiWebにアップロード**ボタンを押して、AnkiWebの空のコレクションをAnkiの既存のデッキで上書きすることを確認します。 Ankiはすべてのカード、画像、音声をAnkiWebにアップロードします。メディアが多い場合は、時間がかかる場合があります。
ru: Если вы никогда не использовали AnkiWeb прежде чем вам нужно будет ввести ваши учетные данные при появлении запроса, и нажмите кнопку **Загрузить на AnkiWeb**, чтобы подтвердить перезапись пустой коллекции на AnkiWeb с существующими колодами в Anki. Anki загрузит все ваши карты, изображения и аудио на AnkiWeb. Если у вас много носителей, это может занять некоторое время.

source: Once the synchronization has completed, open AnkiDroid in the device that you are trying to copy the existing decks into, and tap the **Sync** button in the app bar at the top of the main [deck list](deck-picker.md). After entering your AnkiWeb credentials, AnkiDroid will download all your cards and media, and remember your login information for next time.
ar: بمجرد اكتمال المزامنة، افتح AnkiDroid في الجهاز الذي تحاول نسخ الطوابق الموجودة فيه، وانقر على زر **المزامنة** في شريط التطبيقات في الجزء العلوي من [قائمة المجموعة](blockk-picker. د). بعد دخول بيانات اعتماد AnkiWeb الخاصة بك، سيقوم AnkiDroid بتنزيل جميع بطاقاتك ووسائطك، وتذكر معلومات تسجيل الدخول الخاصة بك للمرة القادمة.
ja: 同期が完了したら、既存のデッキをコピーしようとしているデバイスで AnkiDroid を開きます。 そして、メインのformat@@0(deck-picker) の上部にあるアプリバーの**同期**ボタンをタップします。 D). AnkiWebの資格情報を入力した後、AnkiDroidはすべてのカードとメディアをダウンロードし、次回のログイン情報を記憶します。
ru: После завершения синхронизации откройте AnkiDroid на устройстве, в котором вы пытаетесь скопировать существующие колоды, в и нажмите на кнопку **Синхронизация** в верхней части главного [списка колод](deck-picker. d). После ввода учетных данных AnkiWeb AnkiDroid загрузит все ваши карты и медиа, и запомните ваши данные для входа в систему в следующий раз.

source: Note that if you have any existing material in AnkiDroid before attempting to sync, you may be shown a message asking you to choose to either download from AnkiWeb, or upload to AnkiWeb. If you are happy to lose the cards in AnkiDroid then simply choose **Download**. If you need to merge the existing cards with AnkiDroid then you should see the [resolving conflicts](ankiweb-conflicts.md#dealing-with-merge-conflicts-on-ankiweb) section before continuing.
ar: لاحظ أنه إذا كان لديك أي مواد موجودة في AnkiDroid قبل محاولة المزامنة، قد تظهر لك رسالة تطلب منك إما أن تختار التحميل من موقع AnkiWeb، أو أن تحمّل إلى موقع AnkiWeb. إذا كنت سعيدة لفقدان البطاقات في أنكيدرويد فإختر ببساطة **تنزيل**. إذا كنت بحاجة إلى دمج البطاقات الموجودة مع AnkiDroid فيجب عليك رؤية قسم [حل التنازع] (ankiweb-conflicts.md#dealing-with-merge-conflicts-on-ankiweb) قبل المتابعة.
ja: 同期を試みる前にAnkiDroidに既存の素材がある場合に注意してください。 AnkiWebからダウンロードするか、AnkiWebにアップロードするかを選択するメッセージが表示される場合があります。 AnkiDroidでカードを紛失したい場合は、**ダウンロード**を選択してください。 既存のカードをAnkiDroidとマージする必要がある場合は、続行する前にformat@@0(ankiweb-conflicts.md#dealing-with-merge-conflicts-on-ankiweb) セクションを参照してください。
ru: Обратите внимание, что если у вас есть какой-либо существующий материал в AnkiDroid перед попыткой синхронизации, вам может быть показано сообщение с просьбой выбрать загрузку с AnkiWeb, или загрузить на AnkiWeb. Если вы счастливы потерять карты в AnkiDroid, тогда просто выберите **Загрузить**. Если вам нужно объединить существующие карты с AnkiDroid, то перед продолжением вы увидите раздел [разрешение конфликтов](ankiweb-conflicts.md#dealing-with-merge-conflicts-on-ankiweb).

source: After the first synchronization has completed, you can click the sync button again any time you wish to synchronize your changes to the cloud. Only changes made since the previous sync will be sent, so subsequent syncs are a lot faster.
ar: بعد اكتمال المزامنة الأولى، يمكنك النقر على زر المزامنة مرة أخرى في أي وقت ترغب في مزامنة التغييرات على السحابة. فقط التغييرات التي أجريت منذ المزامنة السابقة سيتم إرسالها، لذلك المزامنات اللاحقة أسرع بكثير.
ja: 最初の同期が完了したら、クラウドに変更を同期したいときはいつでも同期ボタンを再度クリックできます。 前の同期以降に加えられた変更のみが送信されるため、その後の同期はより高速になります。
ru: После того, как первая синхронизация завершится, вы можете нажать на кнопку "Синхронизация" в любое время и синхронизировать изменения в облаке. Только изменения, сделанные с момента предыдущей синхронизации, будут отправлены, поэтому последующая синхронизация намного быстрее.

source: If you add some new cards on the desktop computer and want to sync them to AnkiDroid, you'd repeat the same basic process: sync on desktop (or close the program, as it syncs automatically on close by default), and then tap the sync button on AnkiDroid.
ar: إذا قمت بإضافة بعض البطاقات الجديدة على جهاز الكمبيوتر المكتبي و تريد مزامنتها إلى أنكيدرويد، أنت تكرر نفس العملية الأساسية: المزامنة على سطح المكتب (أو إغلاق البرنامج)، كما أنه يزامن تلقائياً عند الإغلاق الافتراضي)، ثم انقر على زر المزامنة على أنكيدرويد.
ja: デスクトップコンピュータに新しいカードをいくつか追加して、AnkiDroidに同期したい場合。 デスクトップで同期(またはプログラムを閉じる)と同じ基本的なプロセスを繰り返します。 デフォルトで閉じると自動的に同期されます)し、AnkiDroidの同期ボタンをタップします。
ru: Если вы добавляете новые карты на настольный компьютер и хотите синхронизировать их с AnkiDroid, вы повторяете один и тот же базовый процесс: синхронизация на рабочем столе (или закрытие программы, при синхронизации автоматически при закрытии по умолчанию), а затем нажмите на кнопку синхронизации на AnkiDroid.

source: Sync from AnkiDroid to Computer
ar: المزامنة من AnkiDroid إلى الكمبيوتر
ja: AnkiDroidからコンピューターへ同期
ru: Синхронизация с AnkiDroid на компьютер

source: The process of syncing from AnkiDroid to computer is essentially the same as syncing from computer to AnkiDroid, but in reverse.
ar: عملية المزامنة من أنكيدرويد إلى الكمبيوتر هي في الأساس نفس عملية المزامنة من الكمبيوتر إلى أنكيدرويد، ولكن العكس.
ja: AnkiDroidからコンピュータへの同期のプロセスは、基本的にはコンピュータからAnkiDroidへの同期と同じですが、逆です。
ru: Процесс синхронизации с AnkiDroid на компьютер по существу такой же, как синхронизация с AnkiDroid, но наоборот.

source: From the [deck list](deck-picker.md), tap the sync button in the top right (it has two arrows in a circle). If it's your first time using AnkiWeb, you may need to enter your login credentials, and then press the "upload" button to upload your AnkiDroid collection to AnkiWeb.
ar: من [قائمة المجموعة](deck-picker.md)، انقر على زر المزامنة في أعلى اليمين (يحتوي على سهمين في دائرة). إذا كانت المرة الأولى التي تستخدم فيها AnkiWeb، فقد تحتاج إلى إدخال بيانات اعتماد تسجيل الدخول الخاصة بك، ثم اضغط على زر "تحميل" لتحميل مجموعة AnkiDroid الخاصة بك إلى AnkiWeb.
ja: format@@0(deck-picker.md) から、右上にある同期ボタンをタップします (円には2つの矢印があります)。 AnkiWebを初めて使用する場合は、ログイン情報を入力する必要があります。 をクリックして、AnkiDroidコレクションをAnkiWebにアップロードするには、「アップロード」ボタンを押します。
ru: Из [списка колоды](deck-picker.md), нажмите кнопку синхронизации в правом верхнем углу (у нее две стрелки в круге). Если вы используете AnkiWeb, вам может потребоваться ввести ваши учетные данные, и затем нажмите кнопку "загрузить" для загрузки вашей коллекции AnkiDroid на AnkiWeb.

source: Once the synchronization has completed, open Anki Desktop on your computer and press the sync button there (with two arrows in a circle), and Anki will download your collection.
ar: بمجرد اكتمال المزامنة، افتح سطح المكتب أنكي على جهاز الكمبيوتر الخاص بك واضغط على زر المزامنة هناك (مع سهمين في دائرة)، وستقوم أنكي بتنزيل مجموعتك.
ja: 同期が完了したら、コンピュータでAnki Desktopを開き、そこに同期ボタンを押します(円に2本の矢印があります)。 そしてAnkiはあなたのコレクションをダウンロードします。
ru: После завершения синхронизации откройте Anki Desktop на вашем компьютере и нажмите там кнопку синхронизации (с двумя стрелками в кружке), и Anki загрузит вашу коллекцию.

source: Although it should not happen often, occasionally you may end up in the position where your cards on AnkiDroid can not be automatically merged with the cards on AnkiWeb. In this case it's necessary to choose to either upload to or download from AnkiWeb, which would overwrite any changes on the other side.
ar: ورغم أنه لا ينبغي أن يحدث في كثير من الأحيان، قد ينتهي بك الأمر أحياناً في الوضع الذي لا يمكن فيه دمج بطاقاتك على أنكيدرويد تلقائياً مع البطاقات على موقع أنكيويب. في هذه الحالة من الضروري الاختيار بين تحميل أو تنزيل من AnkiWeb، الذي سيلغي أي تغييرات على الجانب الآخر.
ja: それは頻繁に起こるべきではないが。 AnkiDroid上のカードが自動的にAnkiWeb上のカードとマージできない位置になることがあります。 この場合、AnkiWebへのアップロードまたはダウンロードを選択する必要があります。これにより、反対側の変更が上書きされます。
ru: Хотя это не должно происходить часто, Иногда вы можете в конечном итоге попасть в положение, в котором ваши карты на AnkiDroid не могут быть автоматически объединены с картами AnkiWeb. В этом случае необходимо выбрать загрузку или загрузку с AnkiWeb, что перезапишет любые изменения на другой стороне.

source: If you have new cards on both sides which you want to keep, before syncing you can [export a deck package](exporting.md) for each deck containing new cards from AnkiDroid, then when you do the sync choose **download** to download from AnkiWeb. After the synchronization has completed, you can import the decks you previously exported from AnkiDroid, as per the [importing section](importing/importing-anki-files.md).
ar: إذا كان لديك بطاقات جديدة على كلا الجانبين تريد الاحتفاظ بها، قبل المزامنة، يمكنك [تصدير حزمة المجموعة](التصدير. (د) لكل مجموعة تحتوي على بطاقات جديدة من AnkiDroid، ثم عندما تقوم بالمزامنة اختر **تحميل** للتنزيل من AnkiWeb. بعد اكتمال المزامنة، يمكنك استيراد الطبقات التي قمت بتصديرها سابقا من AnkiDroid، حسب [قسم الاستيراد] (استيراد / استيراد -anki-files.md).
ja: 両側に新しいカードがある場合は、同期する前にformat@@0(exporting a deck package) をエクスポートできます。 d) AnkiDroidの新しいカードを含むデッキごとに、同期を行ったらAnkiWebからダウンロードするために**ダウンロード**を選択します。 同期が完了したら、format@@0(importing-importing-anki-files.md)のように、AnkiDroidから以前にエクスポートしたデッキをインポートできます。
ru: Если у вас есть новые карты на обеих сторонах, которые вы хотите сохранить, перед синхронизацией, вы можете [экспортировать пакет колоды](exporting. d) для каждой колоды, содержащей новые карты из AnkiDroid, затем при синхронизации выберите **загрузку** для загрузки из AnkiWeb. После завершения синхронизации вы можете импортировать ранее экспортированные колоды из AnkiDroid, в соответствии с [импортируемыми разделами](importing/importing-anki-files.md).

source: If you don't have regular internet access, it's still possible to copy decks back and forth to your device, by using USB.
ar: إذا لم يكن لديك وصول منتظم للإنترنت، فإنه لا يزال من الممكن نسخ المجموعات ذهابا وإيابا إلى جهازك، باستخدام USB.
ja: 通常のインターネットアクセスをお持ちでない場合でも、USBを使用してデッキをデバイスにコピーすることができます。
ru: Если у вас нет обычного доступа в интернет, все равно есть возможность копировать колоды обратно на ваше устройство, используя USB.
