Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: show cards that with the tag **marked**
ar: إظهار بطاقات تحتوي على وسم **علامة**
ja: タグが **マークされた** カードを表示
ru: показать карты, которые с тегом **помечены**

source: is:due
ar: هو:الواجب
ru: есть:due

source: show only cards that are waiting for review
ar: إظهار فقط البطاقات التي تنتظر المراجعة
ja: レビュー待ちのカードのみを表示する
ru: показывать только карты, ожидающие проверки

source: front:rabbit
ar: أمامية:أربيت
ru: перед:кролик

source: show only cards where the front field is exactly **rabbit**
ar: إظهار بطاقات فقط حيث الحقل الأمامي هو بالضبط **الأرانب**
ja: 正確に **ウサギ** の場所をカードのみ表示する
ru: показывать только карты, где переднее поле ровно **rabbit**

source: flag:1
ar: العلم:1
ja: フラグ:1
ru: флаг: 1

source: show only cards marked with a red flag
ar: إظهار فقط البطاقات التي تحمل علامة حمراء
ja: 赤い旗の付いたカードのみを表示する
ru: показать только карты, отмеченные красным флагом

source: For a full list of the possibilities, please see the section in the [desktop manual](https://docs.ankiweb.net/searching.html).
ar: للحصول على قائمة كاملة بالإمكانيات، يرجى الاطلاع على القسم في [دليل سطح المكتب] (https://docs.ankiweb.net/searching.html).
ja: 可能性の完全なリストについては、format@@0(https://docs.ankiweb.net/searching.html)のセクションを参照してください。
ru: Полный список возможностей смотрите в разделе [руководства для рабочего стола](https://docs.ankiweb.net/searching.html).

source: Alternatively, some more commonly used filters (marked, suspended, and tagged cards) can be quickly applied without manually typing them by choosing them from the overflow menu. You can also save and recall common search queries from the menu.
ar: بدلاً من ذلك، بعض الفلاتر الشائعة الاستخدام (معلَّقة، معلقة، البطاقات الموسومة) يمكن تطبيقها بسرعة دون كتابتها يدوياً عن طريق اختيارها من القائمة الزائدة. يمكنك أيضا حفظ واستدعاء استفسارات البحث الشائعة من القائمة.
ja: あるいは、より一般的に使用されるいくつかのフィルター (マーク、マーク、サスペンド) そしてタグ付けされたカード)は、オーバーフローメニューから手動で入力しなくてもすぐに適用できます。 メニューから共通の検索クエリを保存して呼び出すこともできます。
ru: Кроме того, некоторые более часто используемые фильтры (помечены, приостановлены, и отмеченные карты) могут быть легко применены без вручную набрав их из меню переполнения. Вы также можете сохранить и отозвать общие поисковые запросы из меню.

source: Anki is designed to optimize the learning process, so that you study the minimum amount necessary to remember the majority of your cards. Once the congratulations screen is reached, further study becomes a case of diminishing returns: the amount of extra time spent going over the same cards again is generally not worth the moderate increase in retention you'll see.
ar: تم تصميم أنكي لتحسين عملية التعلم، بحيث يمكنك دراسة الحد الأدنى من المبلغ اللازم لتذكر أغلبية البطاقات الخاصة بك. بمجرد الوصول إلى شاشة التهنئة، ويصبح المزيد من الدراسة حالة تناقص العائدات: إن مقدار الوقت الإضافي الذي يُقضى في الذهاب إلى نفس البطاقات لا يستحق عادة الزيادة المعتدلة في الاحتفاظ بالبطاقات التي ستشاهدها.
ja: Ankiは学習プロセスを最適化するように設計されており、カードの大部分を覚えておくために必要な最小限の量を学習します。 お祝いの画面に達したら、 さらなる研究は、リターンを減少させる場合になります:再び同じカードを超えるのに費やされた余分な時間の量は、一般的にあなたが見る保持の中程度の増加には価値がありません。
ru: Анки предназначен для оптимизации процесса обучения, так что вы изучаете минимальную сумму, необходимую для запоминания большинства ваших карт. По достижении поздравлений, дальнейшее исследование становится случаем снижения отдачи: количество дополнительного времени, затрачиваемого на одних и тех же карт, обычно не стоит умеренного увеличения удержания, которое вы увидите.

source: That said, if you have a test looming, or simply want to pass some time, it's possible to keep reviewing even after you are shown the congratulations message.
ar: مع ذلك، إذا كان لديك اختبار يلوح في الأفق، أو ببساطة تريد اجتياز بعض الوقت، من الممكن الاستمرار في المراجعة حتى بعد أن تظهر لك رسالة التهانئ.
ja: あなたがテスト迫っている場合、または単にいくつかの時間を渡したいとは言えません。 お祝いのメッセージを伝えてからも確認できます。
ru: Тем не менее, если у вас есть циклы тестов, или просто хотите пройти некоторое время, это можно продолжить обзор даже после того, как вы показали вам поздравления сообщение.

source: A **filtered deck** is a temporary deck that contains cards based on various criteria, such as **forgotten today**, `is tagged 'hard'`, and so on. After studying cards in a filtered deck, or when the filtered deck is deleted, the cards are automatically returned to their original deck.
ar: **سطح السفينة المصفوفة** هو مجموعة مؤقتة تحتوي على بطاقات تستند إلى معايير مختلفة، مثل **منسية اليوم**، 'وسم بصعب`، وهلم جرا. بعد دراسة البطاقات في مجموعة فلاتر أو عند حذف مجموعة الفلاتر ، تعاد البطاقات تلقائياً إلى مجموعتها الأصلية.
ja: **フィルタリングされたデッキ**は、**今日忘れられた**、`'hard'`などのようにさまざまな基準に基づいてカードを含む一時的なデッキです。 フィルタリングされたデッキでカードを勉強した後、またはフィルタリングされたデッキが削除されると、カードは自動的に元のデッキに戻ります。
ru: **Отфильтрованная колода** — это временная колода, содержащая карты, основанные на различных критериях, таких как **забытые сегодня**, «отмеченные 'хард'» и так далее. После изучения карт в отфильтрованной колоде, или при удалении отфильтрованной колоды, карты автоматически возвращаются в исходную колоду.

source: The easiest way to create a filtered deck is by long clicking on a deck and choosing the **custom study** option.
ar: أسهل طريقة لإنشاء مجموعة مصفاة هي بالنقر مطولا على مجموعة واختيار خيار **الدراسة المخصصة**.
ja: フィルタリングされたデッキを作成する最も簡単な方法は、デッキを長押しして**カスタムスタディ**オプションを選択することです。
ru: Самый простой способ создать отфильтрованную колоду - это долгое нажатие на колоде и выбор параметра **индивидуальное исследование**.

source: Advanced users can create a filtered deck manually, by choosing **Create filtered deck** from the overflow menu in the deck list screen.
ar: يمكن للمستخدمين المتقدمين إنشاء مجموعة مصفاة يدوياً، عن طريق اختيار **إنشاء مجموعة مصفّرة** من القائمة الزائدة في شاشة قائمة المجموعة.
ja: 上級ユーザーは、デッキ一覧画面のオーバーフローメニューから**フィルターデッキを作成**を選択することで、手動でフィルターデッキを作成することができます。
ru: Дополнительные пользователи могут вручную создать отфильтрованную колоду, выбрав **Создать отфильтрованную колоду** в меню переполнения.

source: For further information on filtered decks, please see the [desktop documentation](https://docs.ankiweb.net/filtered-decks.html#filtered-decks--cramming).
ar: وللحصول على مزيد من المعلومات عن الأسطح المصفاة يرجى الرجوع إلى [وثائق سطح المكتب] (https://docs.ankiweb.net/filtered-decks.html#filtered-decks--cramming).
ja: フィルタリングされたデッキの詳細については、format@@0(https://docs.ankiweb.net/filtered-decks.html#filtered-decks---craming)を参照してください。
ru: Для получения дополнительной информации о отфильтрованных колодах, смотрите [документацию для рабочего стола](https://docs.ankiweb.net/filtered-decks.html#filtered-decks--cramming).

source: You can import Anki files (with .apkg file format) directly into AnkiDroid. Other file formats cannot be imported directly into AnkiDroid, however flashcards from most other applications can be imported into Anki Desktop on your computer, which can then be [added into AnkiDroid in the usual way](../anki-desktop.md). See the [importing section of the Anki Desktop manual](https://docs.ankiweb.net/importing/intro.html) for help on importing into Anki Desktop.
ar: يمكنك استيراد ملفات أنكي (مع تنسيق ملف .apkg) مباشرة إلى AnkiDroid. تنسيقات الملفات الأخرى لا يمكن استيرادها مباشرة إلى أنكيدرويد، ومع ذلك، يمكن استيراد بطاقات الفلاش من معظم التطبيقات الأخرى إلى سطح المكتب أنكي على جهاز الكمبيوتر، والذي يمكن بعد ذلك [إضافته إلى أنكيدرويد بالطريقة المعتادة] (. /anki-desktop.md). أنظر [قسم الاستيراد من دليل أنكي سطح المكتب] (https://docs.ankiweb.net/importing/intro.html) للحصول على المساعدة في الاستيراد إلى مكتب أنكي.
ja: AnkiDroidに直接(.apkgファイル形式の)Ankiファイルをインポートできます。 他のファイル形式はAnkiDroidに直接インポートできません。 ただし、他のほとんどのアプリケーションのフラッシュカードは、コンピュータ上のAnki Desktopにインポートすることができます。 format@@0(通常の方法でAnkiDroidに追加できます。 /anki-desktop.md). Anki Desktopへのインポートに関するヘルプは format@@0(https://docs.ankiweb.net/importing/intro.html) を参照してください。
ru: Вы можете импортировать Anki файлы (с форматом .apkg) прямо в AnkiDroid. Другие форматы файлов не могут быть импортированы непосредственно в AnkiDroid, Однако карточки из большинства других приложений могут быть импортированы в Anki Desktop на вашем компьютере, , которые могут быть [добавлены в AnkiDroid обычным способом](. Справка по импорту Anki Desktop смотрите в разделе [Импорт руководства Anki Desktop manual](https://docs.ankiweb.net/importing/intro.html).

source: As in Anki Desktop, AnkiDroid distinguishes between [the two types of .apkg files](https://docs.ankiweb.net/exporting.html) (**collection package** and **deck package**) based on the filename. Collection packages have the name **collection.colpkg**, and when imported will completely _replace all contents_ in AnkiDroid. Any apkg file which is **_not_** named something that ends in **.colpkg** will be treated as a deck package, which will be _merged with any existing content_ when imported into to AnkiDroid.
ar: كما هو الحال في مكتب أنكي، يميز أنكيدرويد بين [نوعين من ملفات .apkg] (https://docs.ankiweb.net/exporting. tml) (**حزمة المجموعة** و **حزمة المجموعة**) استنادًا إلى اسم الملف. حزم المجموعة تحمل الاسم **المجموعة. olpkg**، وعندما يتم استيرادها سيقوم بـ _استبدال جميع المحتويات_ في AnkiDroid. أي ملف apkg الذي هو **_not_** اسمه شيء ينتهي في **. سيتم التعامل مع olpkg** كحزمة على سطح السفينة، التي سيتم دمجها مع أي محتوى موجود_ عند استيرادها إلى AnkiDroid.
ja: Anki Desktopと同様、AnkiDroidはformat@@0(https://docs.ankiweb.net/exporting)を区別します。 tml) (**コレクションパッケージ** と **デッキパッケージ** ) ファイル名に基づいています。コレクションパッケージには、**コレクション名があります。 olpkg**とインポートされると、AnkiDroidのすべての内容を完全に_置き換えます。**_not_**という名前のapkgファイルは、**で終わるものです。 olpkg** はデッキパッケージとして扱われ、AnkiDroidにインポートされたときに、_既存のコンテンツ_とマージされます。
ru: Как и в Anki Desktop, AnkiDroid отличает [два типа файлов .apkg](https://docs.ankiweb.net/exporting. tml) (**collection package** и **deck package**) на основе имени файла. olpkg**, и когда импортируемый файл полностью _заменит все содержимое_ в AnkiDroid. Любой apkg файл, который является **_not_**, назвал то, что заканчивается **. olpkg** будет рассматриваться как пакет пачки, который будет _объединён с любым существующим содержимым_ при импорте в AnkiDroid.

source: You can import .apkg Anki collection files into AnkiDroid either by opening them using the standard Android system, or by manually importing them from within AnkiDroid:
ar: يمكنك الاستيراد. ملفات مجموعة pkg Anki إلى AnkiDroid إما عن طريق فتحها باستخدام نظام Android القياسي، أو عن طريق استيرادها يدوياً من داخل AnkiDroid:
ja: インポートできます。 pkg Ankiのコレクションファイルは、標準のAndroidシステムを使用してAnkiDroidに開くか、AnkiDroid内から手動でインポートします。
ru: Вы можете импортировать . файлы коллекции pkg Anki в AnkiDroid, открыв их либо с помощью стандартной системы Android, либо вручную импортируя их из AnkiDroid:

source: Open the file using Android
ar: فتح الملف باستخدام أندرويد
ja: Android を使用してファイルを開く
ru: Открыть файл с помощью Android

source: Apkg files are automatically associated with AnkiDroid, so for example if you open a .apkg email attachment which you sent to yourself, then AnkiDroid will automatically open the file and confirm if you want to import it. Simply click OK and the apkg file will be imported.
ar: ملفات Apkg مرتبطة تلقائياً بـ AnkiDroid، على سبيل المثال إذا قمت بفتح . مرفق البريد الإلكتروني pkg الذي أرسلته لنفسك، ثم AnkiDroid سيقوم تلقائياً بفتح الملف وتأكيد ما إذا كنت تريد استيراده. ببساطة انقر فوق موافق وسيتم استيراد ملف apkg.
ja: APKファイルは自動的にAnkiDroidに関連付けられるので、例えば、 を開くとします。 あなたがあなた自身に送信したpkgの電子メール添付ファイルは、AnkiDroidは自動的にファイルを開き、インポートするかどうかを確認します。 OKをクリックするだけでapkgファイルがインポートされます。
ru: Файлы Apkg автоматически ассоциируются с AnkiDroid, поэтому, например, если вы откроете . AnkiDroid автоматически откроет файл и подтвердит, что хотите его импортировать. Просто нажмите OK и apkg файл будет импортирован.

source: Import the file manually in AnkiDroid
ar: استيراد الملف يدوياً في AnkiDroid
ja: AnkiDroid で手動でファイルをインポート
ru: Импортировать файл вручную в AnkiDroid

source: You can also manually import .apkg files as follows:
ar: يمكنك أيضًا استيراد ملفات .apkg يدوياً على النحو التالي:
ja: .apkg ファイルを以下のように手動でインポートすることもできます。
ru: Вы также можете вручную импортировать файлы .apkg следующим образом:

source: Connect your device to your computer using USB
ar: قم بتوصيل جهازك بجهاز الكمبيوتر الخاص بك باستخدام USB
ja: USBを使用してデバイスをコンピュータに接続します
ru: Подключите ваше устройство к компьютеру с помощью USB

source: Copy the .apkg from your computer to the AnkiDroid folder on your device
ar: انسخ .apkg من جهاز الكمبيوتر الخاص بك إلى مجلد AnkiDroid على جهازك
ja: .apkg をコンピューターからデバイスの AnkiDroid フォルダーにコピーします
ru: Скопируйте .apkg с компьютера в папку AnkiDroid на вашем устройстве

source: Open AnkiDroid on your device
ar: افتح AnkiDroid على جهازك
ja: AnkiDroidをお使いの端末で開く
ru: Откройте AnkiDroid на вашем устройстве

source: From the main menu in the deck list, choose _Import_
ar: من القائمة الرئيسية في قائمة المجموعة، اختر _Import_
ja: デッキリストのメインメニューから _Import_ を選択します
ru: В главном меню колоды выберите _Import_

source: Choose the apkg file you just copied to your device when prompted
ar: اختر ملف apkg الذي قمت بنسخه للتو إلى جهازك عند مطالبتك
ja: デバイスにコピーしたばかりのapkgファイルを指定してください
ru: Выберите apkg файл, который вы просто скопировали на ваше устройство при появлении запроса

source: Tap OK
ar: انقر موافق
ja: OK をタップ
ru: Нажмите OK

source: AnkiDroid does not support directly importing Anki database (`.anki2`) files. A database import will replace your collection with the contents the provided file. If you want to perform a full replacement, you should import a `collection[.apkg/.colpkg]` created in the app with the export function.
ar: AnkiDroid لا يدعم استيراد ملفات قاعدة بيانات أنكي مباشرة (`.anki2`). سيتم استبدال ملف مجموعة البيانات الخاصة بك بالمحتويات التي تم توفيرها. إذا كنت ترغب في إجراء استبدال كامل، يجب عليك استيراد 'مجموعة[.apkg/.colpkg]' التي تم إنشاؤها في التطبيق مع وظيفة التصدير.
ja: AnkiDroidは、Ankiのデータベース (`.anki2`) ファイルを直接インポートすることはできません。データベースのインポートは、コレクションを指定されたファイルの内容に置き換えます。 完全な置き換えを行いたい場合は、エクスポート関数を使用してアプリに作成された `collection[.apkg/.colpkg]` をインポートする必要があります。
ru: AnkiDroid не поддерживает прямой импорт баз данных Anki (`.anki2`). Импорт базы данных заменит вашу коллекцию содержимым предоставленного файла. Если вы хотите полностью заменить, вы должны импортировать `collection[.apkg/.colpkg]`, созданный в приложении с функцией экспорта.

source: Importing anki2 files manually
ar: استيراد ملفات الكاكي2 يدوياً
ja: anki2 ファイルを手動でインポートする
ru: Импорт файлов anki2 вручную

source: This is not officially supported, but `.anki2` files can manually be imported if needed, in cases of troubleshooting for example:
ar: هذا غير مدعوم رسمياً، ولكن ملفات `.anki/2) يمكن استيرادها يدوياً عند الحاجة، في حالات استكشاف الأخطاء على سبيل المثال:
ja: これは公式にはサポートされていませんが、必要に応じて手動でインポートすることができます。例えばトラブルシューティングの場合:
ru: Это официально не поддерживается, но файлы `.anki2` при необходимости могут быть импортированы вручную, в случае устранения неполадок, например:

source: Create a new folder on your Android file system
ar: إنشاء مجلد جديد على نظام ملفات الأندرويد الخاص بك
ja: Android のファイルシステムに新しいフォルダを作成します
ru: Создайте новую папку в вашей файловой системе Android

source: Obtain the full path to the folder as provided by your file manager, this will typically appear as: `/storage/emulated/0/<FolderName>`
ar: احصل على المسار الكامل للمجلد كما هو مقدم من مدير الملفات الخاص بك، هذا سيظهر عادة كالتالي: `/storage/emulated/0/<FolderName>`
ja: ファイルマネージャーが提供するフォルダへのフルパスを取得します。通常は次のように表示されます: `/storage/emulated/0/<FolderName>`
ru: Получите полный путь к папке, предоставленной вашим файловым менеджером, это обычно появляется: `/storage/emulated/0/<FolderName>`

source: Place the `.anki2` file in the newly created folder
ar: ضع ملف `.ankiis/في المجلد الذي تم إنشاؤه حديثا
ja: 新しく作成したフォルダに`.anki2`ファイルを配置します
ru: Поместите файл `.anki2` в вновь созданную папку

source: Rename the file to `collection.anki2`
ar: إعادة تسمية الملف إلى `collection.anki1`
ja: ファイル名を `collection.anki2` に変更します。
ru: Переименовать файл в `collection.anki2`

source: (If applicable) Temporarily log out of your AnkiWeb account: `Settings - AnkiDroid - AnkiWeb account`
ar: (إذا كان ذلك منطبقاً) سجل خروجك مؤقتاً من حساب AnkiWeb الخاص بك: `إعدادات-AnkiDroid - AnkiWeb account`
ja: (該当する場合) AnkiWebアカウントから一時的にログアウトします: `Settings - AnkiDroid - AnkiWebアカウント`
ru: (Если это применимо) Временно выйдите из AnkiWeb аккаунта: `Settings - AnkiDroid - AnkiWeb account`

source: Open `Settings - Advanced - AnkiDroid Directory` and set the AnkiDroid Directory to the newly created folder.
ar: فتح `إعدادات - متقدمة - دليل أنكيدرويد' وتعيين دليل أنكيدرويد إلى المجلد المنشأ حديثا.
ja: `Settings - Advanced - AnkiDroidディレクトリを開き、AnkiDroidディレクトリを新しく作成したフォルダに設定します。
ru: Откройте `Settings - Advanced - AnkiDroid Directory` и установите директорию AnkiDroid в только что созданную папку.

source: AnkiDroid can export your flashcards in the .apkg Anki file format so that you can import them into Anki Desktop, or share them with other people. As in Anki Desktop, you can either export a [collection package or deck package](https://docs.ankiweb.net/exporting.html#packaged-decks), depending on what you are trying to achieve.
ar: يمكن أن تصدر AnkiDroid بطاقتك الفلاشية. صيغة ملف pkg Anki بحيث يمكنك استيرادها إلى سطح المكتب Anki أو مشاركتها مع أشخاص آخرين. كما هو الحال في Anki Desktop، يمكنك إما تصدير [مجموعة جمع أو مجموعة مجموعات] (https://docs.ankiweb.net/exporting.html#packaged-decks)، اعتماداً على ما تحاول تحقيقه.
ja: AnkiDroidはフラッシュカードをエクスポートできます。 pkgのAnkiファイル形式を使用すると、Ankiデスクトップにインポートしたり、他の人と共有したりできます。 Anki Desktopと同様に、format@@0(https://docs.ankiweb.net/exporting.html#packaged-decks)をエクスポートすることができます。
ru: AnkiDroid может экспортировать ваши карточки в формате . Формат файла pkg Anki таким образом, чтобы вы могли импортировать их в Anki Desktop, или поделиться ими с другими людьми. Как и в Anki Desktop, вы можете экспортировать [пакет коллекции или пакет с колодой](https://docs.ankiweb.net/exporting.html#packaged-decks), в зависимости от того, что вы пытаетесь достичь.

source: There are two export options available: **include scheduling information** and **include media**. Generally the default options are sufficient, if you choose not to include scheduling information, Anki will assume that you are sharing the deck with other people, and will remove marked and leech tags so that they will have a clean copy of it.
ar: هناك خياران للتصدير متاحان: **تشمل معلومات الجدولة الزمنية** و **تشمل الوسائط**. بشكل عام، الخيارات الافتراضية كافية، إذا اخترت عدم تضمين معلومات الجدولة الزمنية، سيفترض أنكي أنك تتقاسم مجموعة الأوراق مع أشخاص آخرين، وستقوم بإزالة العلامات المعلمة وعلامات الليش بحيث يكون لديهم نسخة نظيفة منها.
ja: **スケジューリング情報**と**メディアを含む**の2つのエクスポートオプションがあります。 通常、スケジューリング情報を含めないことを選択した場合は、デフォルトのオプションで十分です。 Ankiはデッキを他の人と共有していると仮定します。 印とリーチのタグを取り除ききれいなコピーができるようにします
ru: Доступны два варианта экспорта: **включайте информацию о планировании** и **включайте средства массовой информации**. Обычно параметры по умолчанию достаточны, если вы решили не включать информацию о планировании, Анки предполагает, что вы делитесь палубой с другими людьми, и будет удалять отмеченные и рычажные теги, чтобы у них была чистая копия.

source: Exporting collection package
ar: تصدير حزمة جمع
ja: コレクションパッケージのエクスポート
ru: Экспорт пакета коллекции

source: When exporting for use in Anki Desktop, you generally want to [export your entire collection](https://docs.ankiweb.net/exporting.html#collection-colpkg), including all your review history etc.
ar: عند التصدير لاستخدامك في مكتب أنكي، انت عموما تريد [تصدير مجموعتك بأكملها](https://docs.ankiweb.net/exporting.html#collection-colpkg)، بما في ذلك جميع سجلات المراجعة الخاصة بك، إلخ.
ja: Anki Desktopで使用するためにエクスポートする場合は、一般的にformat@@0(https://docs.ankiweb.net/exporting.html#collection-colpkg)とすべてのレビュー履歴などを含みます。
ru: При экспорте для использования в Anki Desktop, вы обычно хотите [экспортировать всю свою коллекцию](https://docs.ankiweb.net/exporting.html#collection-colpkg), включая всю историю отзывов и т.д.

source: From the main menu in the decks screen:
ar: من القائمة الرئيسية في الشاشة:
ja: デッキ画面のメインメニューから:
ru: Из главного меню на экране колод:

source: Tap the **Export** item in the menu.
ar: انقر فوق عنصر **تصدير** في القائمة.
ja: メニューの **エクスポート** をタップします。
ru: Нажмите на **Экспорт** в меню.

source: Tap **OK** using default options
ar: انقر فوق **موافق** باستخدام الخيارات الافتراضية
ja: デフォルトのオプションを使用して **OK** をタップ
ru: Нажмите **OK** используя параметры по умолчанию

source: Tap **OK** again to email the exported collection.apkg file to yourself, or alternatively you can manually copy to your computer using USB
ar: انقر فوق **موافق** مرة أخرى لإرسال ملف collection.apkg المصدّر إلى نفسك، أو بدلاً من ذلك يمكنك نسخ يدويًا إلى جهاز الكمبيوتر الخاص بك باستخدام USB
ja: エクスポートされたcollection.apkgファイルを自分にメールするには、もう一度**OK**をタップするか、USBを使用して手動でコンピュータにコピーすることができます。
ru: Коснитесь **ОК** для отправки экспортированного файла collection.apkg самому себе, или же вы можете вручную скопировать его на компьютер с помощью USB

source: To import the file on your computer:
ar: لاستيراد الملف على جهاز الكمبيوتر الخاص بك:
ja: コンピュータ上のファイルをインポートするには:
ru: Чтобы импортировать файл на ваш компьютер:

source: Save the file **collection.apkg** to your desktop
ar: حفظ الملف **collection.apkg** إلى سطح المكتب الخاص بك
ja: **collection.apkg** ファイルをデスクトップに保存します
ru: Сохраните файл **collection.apkg** на рабочем столе

source: Double-click on the file to start Anki.
ar: انقر نقرا مزدوجا على الملف لبدء أنكي.
ja: Ankiを起動するファイルをダブルクリックします。
ru: Дважды щелкните по файлу, чтобы запустить Anki.

source: Confirm you wish to replace, so that the deck from your mobile device overwrites the old data on your desktop.
ar: قم بتأكيد رغبتك في الاستبدال، حتى تقوم مجموعة الجوال الخاصة بك بكتابة البيانات القديمة على سطح المكتب الخاص بك.
ja: モバイルデバイスのデッキがデスクトップの古いデータを上書きするように、置き換えたいことを確認してください。
ru: Подтвердите замену колоды с мобильного устройства для перезаписи старых данных на рабочем столе.

source: After importing, you can delete the apkg file on your desktop if you wish.
ar: بعد الاستيراد، يمكنك حذف ملف apkg على سطح المكتب إذا رغبت في ذلك.
ja: インポート後、必要に応じてデスクトップ上のapkgファイルを削除できます。
ru: После импорта вы можете удалить apkg файл на рабочем столе, если хотите.

source: Exporting deck package
ar: تصدير حزمة المجموعة
ja: デッキパッケージのエクスポート
ru: Экспорт пакета пачки

source: If you want to share a deck in AnkiDroid with another user, you can export a deck package.
ar: إذا كنت ترغب في مشاركة مجموعة في AnkiDroid مع مستخدم آخر، يمكنك تصدير حزمة المجموعة.
ja: AnkiDroidのデッキを他のユーザーと共有したい場合は、デッキパッケージをエクスポートできます。
ru: Если вы хотите поделиться колодой в AnkiDroid с другим пользователем, вы можете экспортировать пакет колоды.

source: Long tap on the deck you wish to export
ar: انقر مطولاً على المجموعة التي ترغب في تصديرها
ja: エクスポートしたいデッキを長押しする
ru: Долгое нажатие на желаемую колоду для экспорта

source: Tap **Export**
ar: انقر فوق **تصدير**
ja: **エクスポート** をタップ
ru: Нажмите **Экспорт**

source: Tap **OK** using the default options
ar: انقر فوق **موافق** باستخدام الخيارات الافتراضية
ja: デフォルトのオプションを使用して **OK** をタップ
ru: Нажмите **OK**, используя параметры по умолчанию

source: Tap **OK** again to email the exported apkg to another user
ar: انقر فوق **موافق** مرة أخرى لإرسال البريد الإلكتروني إلى مستخدم آخر
ja: エクスポートされたAPKを別のユーザーにメールするには、もう一度**OK**をタップしてください
ru: Нажмите еще раз **OK** для отправки экспортированных apkg другому пользователю

source: AnkiDroid will automatically create backups of your collection for you. The backups include all your cards and statistics, but do not include sounds or images.
ar: سيقوم AnkiDroid تلقائياً بإنشاء نسخ إحتياطية من مجموعتك من أجلك. النسخ الإحتياطية تشمل جميع أوراقك وإحصائياتك، ولكن لا تتضمن الأصوات أو الصور.
ja: AnkiDroidはコレクションのバックアップを自動的に作成します。バックアップにはすべてのカードと統計情報が含まれますが、サウンドや画像は含まれません。
ru: AnkiDroid будет автоматически создавать резервные копии вашей коллекции для вас. Резервные копии включают все ваши карты и статистику, но не включают звуки или изображения.
