Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Add ability to map "reschedule" to a gesture
ar: إضافة القدرة على تعيين "إعادة الجدول" إلى إيماءة
ja: "スケジュール"をジェスチャーにマップする機能を追加
ru: Добавить возможность карты перенести на жест

source: Allow long preference titles to wrap
ar: السماح لعناوين التفضيلات الطويلة بالتسلسل
ja: 長い設定タイトルの折り返しを許可する
ru: Разрешить перенос длинных настроек

source: Allow 3rd party cookies in webview to match Anki behavior
ar: السماح لكعكات الطرف الثالث في عرض الويب بمطابقة سلوك أنكي
ja: ウェブビューでサードパーティのクッキーをAnkiの動作と一致させることを許可する
ru: Разрешить сторонним кукам в веб-просмотре в соответствии с Anki

source: Improve add shortcut icon
ar: تحسين إضافة أيقونة الاختصار
ja: ショートカットアイコンの追加
ru: Улучшить ярлык

source: Remove beolingus pronounce feature
ar: إزالة ميزة النطق بيولينغوس
ja: Beolingusの発音機能を削除
ru: Удалить функцию звукопоглощения

source: New community-provided translations from https://crowdin.com/project/ankidroid
ar: ترجمة جديدة مقدمة من مجتمع من https://crowdin.com/project/ankidroid
ja: https://crowdin.com/project/ankidroid からの新しいコミュニティ提供の翻訳
ru: Новый перевод сообщества с https://crowdin.com/project/ankidroid

source: Version 2.16.2 (20230726)
ar: الإصدار 2-16-2 (20230726)
ja: バージョン 2.16.2 (20230726)
ru: Версия 2.16.2 (20230726)

source: You waited patiently nearly 3 years for this release! ⌛ Thank you
ar: لقد انتظرت بصبر حوالي 3 سنوات لهذا الإفراج! ⌛ شكرا لك
ja: あなたはこのリリースのために3年近く辛抱強く待っていました! ⌛ ありがとうございました
ru: Вы терпеливо ждали около 3 лет для этого релиза! ⌛ Спасибо

source: What an effort! v2.16 contains 2,693 changes from 143 different authors 🤯
ar: يا له من جهد! v2.16 يحتوي على 2693 تغيير من 143 مؤلفاً مختلفاً 🤯
ja: なんて努力だ! v2.16には、143人の作者から2,693人の変更が含まれています:exploing_head:
ru: В v2.16 есть 2693 изменения от 143 разных авторов 🤯

source: AnkiDroid is a labor of ❤️ with a mission to help the whole world learn more
ar: AnkiDroid هو عمل من ❤️ مع مهمة لمساعدة العالم بأسره على تعلم المزيد
ja: AnkiDroidは❤️ の労力です。世界中の人々がより多くのことを学ぶために使命を持っています。
ru: AnkiDroid - это труд ❤️ миссией помочь всему миру узнать больше

source: [you can ❤️ us back so we have more time to work on it](https://opencollective.com/ankidroid)
ar: [يمكنك إعادة ❤️ لدينا المزيد من الوقت للعمل على ذلك] (https://opencollective.com/ankidroid)
ru: [вы можете ❤️ нам понадобится больше времени, чтобы работать над этим](https://opencollective.com/ankidroid)

source: “Why It Took So Long”: Scoped Storage replaces sdcard Storage
ar: "لماذا احتازت فترة طويلة جداً": يستبدل تخزين البطاقة Sdcard
ja: "Why It took so Long” : Scoped StorageはSDカードストレージを置き換えます
ru: “Why It Took So Long”: Scoped Storage rereplaced sdcard Storage

source: Faster syncing and importing
ar: سرعة المزامنة والاستيراد
ja: 迅速な同期とインポート
ru: Быстрая синхронизация и импорт

source: AnkiDroid no longer needs permission to access “All Files”!
ar: لم يعد أنكيدرويد بحاجة إلى إذن للوصول إلى "جميع الملفات"!
ja: AnkiDroidは「すべてのファイル」にアクセスするための権限が不要になりました！
ru: AnkiDroid больше не нужен доступ к «Все файлы»!

source: ...But you lose access to data on uninstall
ar: ...لكنك تفقد الوصول إلى البيانات عند إلغاء التثبيت
ja: ...しかし、アンインストール時にデータへのアクセスを失います
ru: ...но вы теряете доступ к данным при удалении

source: Sync, export/import, check media/database disabled during migration
ar: المزامنة، التصدير/الاستيراد، التحقق من الوسائط/قاعدة البيانات معطلة أثناء الترحيل
ja: 同期、エクスポート/インポート、移行中にメディア/データベースのチェックが無効です
ru: Синхронизация, экспорт/импорт, проверьте, что медиа/база данных отключена во время миграции

source: Manage Space Activity in System Settings
ar: إدارة نشاط الفضاء في إعدادات النظام
ja: システム設定でスペースアクティビティを管理
ru: Управление деятельностью в системе

source: Added “Backup Reminder” prompt
ar: إضافة "تذكير النسخ الاحتياطي"
ja: 「バックアップリマインダー」プロンプトを追加しました
ru: Добавлена подсказка «Напоминание о резервных копиях»

source: [More info in our FAQ](https://github.com/ankidroid/Anki-Android/wiki/Storage-Migration-FAQ)
ar: [مزيد من المعلومات في الأسئلة الشائعة](https://github.com/ankidroid/Anki-Android/wiki/Storage-Migration-FAQ)
ja: format@@0(https://github.com/anki-Android/wiki/Storage-Migration-FAQ)
ru: [Больше информации в нашем FAQ](https://github.com/ankidroid/Anki-Android/wiki/Storage-Migration-FAQ)

source: A huge number of crash fixes, too many to mention
ar: عدد كبير من الاصلاحات المتعطلة، كثيرًا جدا للذكر
ja: 膨大な数のクラッシュ修正、あまりにも多すぎます
ru: Большое количество исправления сбоев, слишком много для упоминания

source: “Auto” Day/Night theming to follow system, Android 13+ themed icon
ar: أيقونة "تلقائي" يوم/ليلة لمتابعة النظام، أندرويد 13+ الموضوع
ja: 「自動」デー/夜テーマでシステムをフォローし、Android 13以上のテーマアイコン
ru: День/ночная тема для перехода к системе Android 13+

source: Added Anki “New Anki Backend option in advanced settings" - will be default in 2.17
ar: إضافة Anki "خيار خلفية أنكي جديد في الإعدادات المتقدمة" - ستكون افتراضية في 2.17
ja: Anki "New Anki Backend option in advanced settings" - will be default in 2.17
ru: Добавлена функция Anki “New Anki Backend в расширенных настройках” - по умолчанию в 2.17

source: We include anki 2.1.61 now, we’re fully up to date!
ar: نحن ندرج الانكي 2.1.61 الآن، نحن الآن على وشك التحديث!
ja: anki 2.1.61 が追加されました。完全に最新の状態です！
ru: Мы включили anki 2.1.61 в актуальное состояние!

source: Stats Heatmap
ar: إحصائيات الخريطة الحرارية
ja: 統計ヒートマップ
ru: Статистика тепловой карты

source: Scheduler v3 support
ar: جدولة الدعم v3
ja: スケジューラv3のサポート
ru: Поддержка планировщика v3

source: CSV Import, Text import
ar: استيراد CSV ، استيراد النص
ja: CSV インポート、テキストインポート
ru: Импорт CSV, импорт текста

source: Card Browser Searches
ar: البحث عن متصفح البطاقة
ja: カードブラウザ検索
ru: Поиск в браузере

source: Card Info and Deck Options from upstream
ar: معلومات البطاقة وخيارات مجموعة من أعلى المجرى
ja: 上流のカード情報とデッキオプション
ru: Настройки карты и колоды от начала

source: New gesture manager, supports gamepad and bluetooth keyboard
ar: مدير إيماءات جديد، يدعم لوحة المفاتيح بلوتوث
ja: 新しいジェスチャーマネージャー、ゲームパッドとBluetoothキーボードをサポート
ru: Новый менеджер жестов, поддерживает геймпад и bluetooth клавиатуру

source: Translations, new languages, lots of fixes, [you can help!](https://crowdin.com/project/ankidroid/)
ar: الترجمة، لغات جديدة، الكثير من الإصلاحات، [يمكنك المساعدة!](https://crowdin.com/project/ankidroid/)
ja: 翻訳、新しい言語、多くの修正、format@@0(https://crowdin.com/project/ankidroid/)
ru: Переводы, новые языки, множество исправлений, [вы можете помочь!](https://crowdin.com/project/ankidroid/)

source: Add support for hierarchical tags
ar: إضافة دعم للعلامات الهرمية
ja: 階層タグのサポートを追加
ru: Добавить поддержку иерархических тегов

source: New Onboarding Screen
ar: شاشة أونبواردينج جديدة
ja: 新規オンボーディング画面
ru: Новый экран посадки

source: New Preferences
ar: تفضيلات جديدة
ja: 新しい設定
ru: Новые настройки

source: Icons & Better Categories
ar: فئات الأيقونات و أفضل
ja: アイコンと優れたカテゴリ
ru: Значки и лучшие категории

source: Increase max possible backups to 99
ar: زيادة الحد الأقصى للنسخ الاحتياطية المحتملة إلى 99
ja: 可能な最大バックアップ数を99まで増やします
ru: Увеличить максимальное количество резервных копий до 99

source: Full screen navigation drawer option
ar: خيار درج التنقل بملء الشاشة
ja: 全画面ナビゲーションドロワーのオプション
ru: Полноэкранная панель навигации

source: Add Preference for double-tap time interval
ar: إضافة تفضيل للفصل الزمني للنقر المزدوج
ja: ダブルタップ時間間隔の設定を追加
ru: Добавить настройки для интервала времени двойного нажатия

source: “Insert Field” in Card Template Editor option
ar: إدراج حقل في خيار تحرير قالب البطاقة
ja: カードテンプレートエディタオプションの「フィールドの挿入」
ru: Опция «Вставить поле» в шаблон карты

source: Add "Allow sync on metered connections" option
ar: إضافة خيار "السماح بالمزامنة على الاتصالات المقياسة"
ja: 「従量課金接続時に同期を許可」オプションを追加
ru: Добавить опцию "Разрешить синхронизацию при ограниченных соединениях"

source: New “About” section
ar: قسم "عن" جديد
ja: 新しい「About」セクション
ru: Новый раздел "О работе"

source: “Developer Options” is now available
ar: "خيارات المطور" متاحة الآن
ja: 「開発者向けオプション」が利用可能になりました
ru: «Настройки разработчиков» теперь доступны

source: Flags added: Pink, turquoise & purple flags as in Desktop
ar: العلامة المضافة: أعلام وردية وأرجوانية كما هو الحال في سطح المكتب
ja: 追加されたフラグ: デスクトップと同様にピンク、ターコイズ、パープルフラグ
ru: Добавлены флаги: Pink, turquoise и фиолетовые флаги как на рабочем столе

source: Drawing Activity
ar: نشاط الرسم
ja: ドローイングアクティビティ
ru: Активность чертежа

source: Custom Sync Server improvements
ar: تحسينات خادم المزامنة المخصصة
ja: カスタム同期サーバーの改善
ru: Пользовательские улучшения сервера синхронизации

source: Updated to match new Anki Desktop built-in sync server abilities
ar: تم التحديث لمطابقة قدرات خادم مزامنة أنكي الجديدة المدمجة في سطح المكتب
ja: 新しいAnki Desktop内蔵の同期サーバーアビリティに一致するように更新されました
ru: Обновлено в соответствии с новыми способностями Anki Desktop встроенного сервера синхронизации

source: Cleartext traffic permitted (it’s your server, use it how you like)
ar: السماح بحركة مرور النصوص (إنها الخادم الخاص بك، استخدمها كيف تريد)
ja: Cleartext traffic allowed (it is your server, use it how you like)
ru: Разрешенный трафик Cleartext (ваш сервер, используйте его как вам нравится)

source: Javascript AP changes:
ar: تغييرات APP في جافا سكريبت:
ja: Javascript AP の変更:
ru: Изменения в AP-коде:

source: New bury & suspend card or note API
ar: دفن جديد و تعليق بطاقة أو ملاحظة API
ja: 新しいベリー&カードまたはメモAPIを一時停止する
ru: Новая запись и приостановка карты или API заметок

source: New search API
ar: API بحث جديد
ja: 新しい検索API
ru: Новый API поиска

source: New text to speech API
ar: نص جديد لكلمة API
ja: 音声読み上げAPIの新規作成
ru: Новый текст в API речи

source: Enhanced reschedule API
ar: إعادة جدولة API المحسنة
ja: 拡張されたリスケジュールAPI
ru: Расширенный перепланированный API

source: New Reset progress API
ar: إعادة تعيين تقدم API جديد
ja: 新しいリセット進行API
ru: Новый API сброса прогресса

source: Enable DOM storage so localStorage works
ar: تمكين تخزين DOM حتى أعمال التخزين المحلية
ja: localStorageが動作するようにDOMストレージを有効にする
ru: Включение хранилища DOM для работы с локальным хранилищем

source: Use language defined in ‘Language Hint’ when typing the answer
ar: استخدام اللغة المعرَّفة في "تلميح اللغة" عند كتابة الإجابة
ja: 答えを入力するときに「言語ヒント」で定義されている言語を使用します
ru: Использовать язык, определенный в "Подсказке" при вводе ответа

source: Mathjax updated to current versions
ar: تحديث Mathjax إلى الإصدارات الحالية
ja: Mathjax を現在のバージョンに更新しました
ru: Mathjax обновляется до текущих версий

source: Double-tap floating ‘+’ Deck Picker button to add note
ar: انقر نقرًا مزدوجًا على زر اختيار مجموعة ’+’ لإضافة ملاحظة
ja: フローティング ‘+’ デッキ ピッカーのボタンをダブルタップしてメモを追加します
ru: Двойное нажатие на плавающую кнопку "+" Палубу для добавления заметки

source: Note Editor SVG, video, clipboard paste import support
ar: ملاحظة محرر SVG، الفيديو، وصق الحافظة دعم استيراد
ja: Note Editor SVG、ビデオ、クリップボード貼り付けのインポートのサポート
ru: Поддержка импорта заметок SVG, видео, буфера обмена

source: Card Previewer progress bar during preview
ar: شريط تقدم معاينة البطاقة أثناء المعاينة
ja: プレビュー中のカードプレビューアのプログレスバー
ru: Индикатор прогресса карты во время предварительного просмотра

source: Card Previewer: Show type-in answer in card previews
ar: مشاهدة البطاقة: إظهار نوع الإجابة في معاينات البطاقة
ja: カードプレビュー: タイプイン解答をカードプレビューで表示する
ru: Предпросмотр карты: Показать ввод ответа в предпросмотре карты

source: Card Browser Support for Indeterminate tags when adding/removing tags
ar: دعم متصفح البطاقة للوسوم غير المحددة عند إضافة/إزالة العلامات
ja: タグを追加/削除する際のカードブラウザの不確定なタグのサポート
ru: Поддержка карт-браузера для неопределяющих тегов при добавлении/удалении тегов

source: Sync Account Add “Forgot Email” Button
ar: مزامنة الحساب إضافة زر "نسيت البريد الإلكتروني"
ja: アカウントを同期する「メールを忘れた」ボタンを追加
ru: Кнопка «Забыли Email» аккаунта синхронизации

source: Add option to show all deck stats by default
ar: إضافة خيار لإظهار جميع إحصائيات المجموعة بشكل افتراضي
ja: デフォルトですべてのデッキ統計を表示するオプションを追加
ru: Добавить опцию для отображения всей статистики пачки по умолчанию

source: Add Note Gesture
ar: إضافة إيماءة ملاحظة
ja: メモのジェスチャーを追加
ru: Добавить Жест заметки

source: Ask to keep data when uninstalling (saves preferences too)
ar: اطلب الاحتفاظ بالبيانات عند إلغاء التثبيت (حفظ التفضيلات ايضا)
ja: アンインストール時にデータを保持するように依頼（設定も保存）
ru: Спрашивать данные при удалении (также сохраняет настройки)

source: Reviewer: Allow “TTS” to be moved to the Action Bar
ar: المراجع: السماح بنقل "TTS" إلى شريط العمل
ja: 査読者：「TTS」をアクションバーに移動させることを許可する
ru: Отзыв: Разрешить «TTS» для перемещения в панель действий

source: Note Editor: Allow the import of multiple files
ar: محرر الملاحظة: السماح باستيراد ملفات متعددة
ja: ノートエディタ: 複数のファイルのインポートを許可する
ru: Редактор заметок: Разрешить импорт нескольких файлов

source: Import/Export
ar: استيراد/تصدير
ja: インポート/エクスポート
ru: Импорт/Экспорт

source: Fixed many general problems with import/export
ar: حل العديد من المشاكل العامة في الاستيراد/التصدير
ja: インポート/エクスポートに関する多くの一般的な問題を修正しました
ru: Исправлено множество общих проблем с импортом/экспортом

source: Export just a deck
ar: تصدير مجموعة فقط
ja: 単にデッキをエクスポート
ru: Экспортировать только колоду

source: Export just a note
ar: تصدير ملاحظة فقط
ja: ノートだけをエクスポート
ru: Экспортировать только заметку

source: UI: Snackbars used where possible, and made much more pleasant
ar: UI: استخدام الحانات الناعمة كلما كان ذلك ممكناً، وجعل أكثر سعادة
ja: UI: スナックバーは可能な限り使用され、はるかに快適になりました
ru: UI: Снукбары, используемые там, где это возможно, и сделали гораздо более приятным

source: UI: Matched the color of status, action and nav bar to background
ar: واجهة المستخدم: تطابق لون الحالة و العمل و شريط التنقل مع الخلفية
ja: UI: ステータスの色とアクションとナビゲーションバーを背景に合わせました
ru: UI: Соответствует цвету статуса, действия и строки nav с фоном

source: Card Browser: “Note” mode
ar: مستعرض البطاقة: وضع "ملاحظة"
ja: カードブラウザ: 「メモ」モード
ru: Обозреватель карт: режим «Примечание»

source: Whiteboard - Stylus Only Mode
ar: لوحة البيض - وضع النمط فقط
ja: ホワイトボード - スタイルのみモード
ru: Белая доска - Только стиль

source: Version 2.16.1 (20230726)
ar: الإصدار 2.16.1 (20230726)
ja: バージョン 2.16.1 (20230726)
ru: Версия 2.16.1 (20230726)

source: Published internally, not generally released
ar: نشر داخليا، لا يصدر عموما
ja: 一般的には公開されていませんが、内部で公開されています
ru: Опубликовано внутри, как правило, не выпускается

source: Version 2.16.0 (20230726)
ar: الإصدار 2.16.0 (20230726)
ja: バージョン 2.16.0 (20230726)
ru: Версия 2.16.0 (20230726)

source: Unpublished
ar: غير منشورة
ja: 未公開
ru: Не опубликовано

source: Version 2.15.6 (20210714)
ar: الإصدار 2.15.6 (20210714)
ja: バージョン 2.15.6 (20210714)
ru: Версия 2.15.6 (20210714)

source: One more crash fix, no crashes shall be left unfixed! If we can help it.
ar: إصلاح آخر للأعطال ، لا يجب أن تترك أي أعطال بدون إصلاح! إذا استطعنا أن نساعدها.
ja: もう一度クラッシュを修正しました。クラッシュは未解決のままにしません！お手伝いできますか？
ru: Еще одно исправление аварий, никаких сбоев не останутся! Если мы сможем помочь.

source: Version 2.15.5 (20210713)
ar: الإصدار 2.15.5 (20210713)
ru: Версия 2.15.5 (20210713)

source: Full-screen navigation drawer drag is a preference, default off
ar: سحب درج التنقل بملء الشاشة هو تفضيل، إيقاف افتراضي
ja: 全画面ナビゲーションドロワーのドラッグは優先され、デフォルトはオフです
ru: Полноэкранное перетаскивание навигационной панели является предпочтительным по умолчанию

source: Floating Action Button ('+') labels are clickable again
ar: زر الإجراء العائم ('+') يمكن النقر عليه مرة أخرى
ja: フローティングアクションボタン ('+') ラベルが再びクリック可能になります
ru: Плавающая кнопка действий ('+') подписи кликаются снова

source: Fixed crash on first run post-install on tablets
ar: إصلاح الأعطال عند تشغيل أول تثبيت على أجهزة الكمبيوتر اللوحية
ja: タブレットへのインストール後の最初の実行時にクラッシュを修正しました
ru: Исправлен сбой при первом запуске post-install на планшетах

source: Fixed odd weekly breakdown stats chart behavior
ar: سلوك مخطط إحصائيات تحليل فردي ثابت أسبوعياً
ja: 週ごとの内訳統計チャートの動作を修正しました
ru: Исправлена нечетная статистика разбиения на диаграммы

source: Fixed crash creating new deck from deck chooser
ar: إصلاح تعطل إنشاء مجموعة جديدة من منتقي المجموعة
ja: デッキセレクターから新しいデッキを作成するクラッシュを修正しました
ru: Исправлена ошибка создания новой колоды из выбора колоды

source: [Updated translations](https://crowdin.com/project/ankidroid) (thank you translators!)
ar: [الترجمات المحدثة](https://crowdin.com/project/ankidroid) (شكراً لك المترجمين!)
ja: format@@0(https://crowdin.com/project/ankidroid) (翻訳ありがとうございます!)
ru: [Обновленные переводы](https://crowdin.com/project/ankidroid) (спасибо переводчикам!)

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/47?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/47?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/47?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/47?closed=1)

source: We are deep into development for v2.16 + Google Summer of Code, lots of new stuff coming
ar: نحن عميقون في التطوير لـ v2.16 + صيف غوغل للبرمجة، الكثير من الأشياء الجديدة القادمة
ja: 私たちは v2.16 + Google Summer of Code の開発に深く関わっています。たくさんの新しいものが登場します。
ru: Мы глубоко разрабатываем для v2.16 + Google Summer of Code, много новых вещей

source: Happy reviewing!
ar: استعراض سعيد!
ja: レビューをお楽しみください！
ru: Счастливого обзора!

source: Version 2.15.4 (20210602)
ar: الإصدار 2.15.4 (20210602)
ja: バージョン 2.15.4 (20210602)
ru: Версия 2.15.4 (20210602)

source: Saw one crash show up for 2.15.3: if you touched the 3 numbers instead of the deck name on the deck list on phones, it would crash
ar: ظهر حدث تحطم واحد 2.15. : إذا لمست 3 أرقام بدلاً من اسم المجموعة في قائمة المجموعة على الهواتف، فإنه سيتحطم
ja: 1つのクラッシュが2.15のために表示されます。 デッキ名の代わりに3つの数字に触れるとクラッシュします
ru: Напил один сбой появляется за 2.15. : если вы коснулись 3 числа вместо имени колоды в списке телефонов, то это приведет к сбою

source: Temporarily revert full screen navigation drawer option to fix
ar: إرجاع خيار درج التنقل الكامل للشاشة مؤقتاً لإصلاح
ja: 一時的に全画面ナビゲーションドロワーオプションを元に戻して修正します
ru: Временно откатить полный экран панели навигации для исправления

source: Version 2.15.3 (20210602)
ar: الإصدار 2.15.3 (20210602)
ja: バージョン 2.15.3 (20210602)
ru: Версия 2.15.3 (20210602)

source: [❤️ Thank you so much for the donations! We appreciate it ❤️](https://opencollective.com/ankidroid)
ar: [❤️ شكرا جزيلا على التبرعات! نحن نقدر ذلك ❤️](https://opencollective.com/ankidroid)
ja: [❤️ ご寄付ありがとうございます！❤️に感謝します。](https://opencollective.com/ankidroid)
ru: [❤️ Большое спасибо за пожертвование! Мы ценим его ❤️](https://opencollective.com/ankidroid)

source: Another batch of fixes stabilizing all the work done for AnkiDroid 2.15
ar: دفعة أخرى من الإصلاحات لتثبيت جميع الأعمال المنجزة لـ AnkiDroid 2.115
ja: AnkiDroid 2.15 で行われたすべての作業を安定化させる別のバッチの修正
ru: Другая партия исправлений, стабилизирующая все выполненные работы для AnkiDroid 2.15

source: Fix "Search All Decks" in Card Browser not searching
ar: إصلاح "البحث عن جميع العقر" في متصفح البطاقة لا يبحث
ja: カードブラウザで検索しない「すべてのデッキを検索」を修正
ru: Исправлена ошибка "Поиск всех колод" в браузере карт

source: Make new full screen navigation drawer open optional, default off
ar: اجعل قائمة التنقل الجديدة كاملة الشاشة مفتوحة اختيارية, إيقاف الافتراضي
ja: 新しい全画面ナビゲーションドロワーを任意の場所でデフォルトをオフにする
ru: Выключить новый полноэкранный навигационный ящик по умолчанию

source: Preserve edited search in card browser if navigation drawer opens
ar: الحفاظ على البحث المعدل في متصفح البطاقة إذا فتح درج التنقل
ja: ナビゲーションドロワーが開いた場合、カードブラウザで編集した検索を保持する
ru: Сохранять отредактированный поиск в браузере карты, если открывает панель навигации

source: Fix crash editing Tags dialog when switching back from another app
ar: إصلاح معطل تحرير علامات الحوار عند التبديل من تطبيق آخر
ja: 別のアプリから戻るときにクラッシュ編集タグダイアログを修正しました
ru: Исправлена ошибка редактирования тегов при переключении из другого приложения

source: Fix incorrect cloze help link
ar: إصلاح رابط مساعدة الملابس غير صحيح
ja: 正しくないクローズのヘルプリンクを修正
ru: Исправьте неправильную ссылку справки

source: Increase touchable area of undo icon
ar: زيادة مساحة اللمس من أيقونة التراجع
ja: 元に戻すアイコンのタッチ可能領域を増やします
ru: Увеличить касательную область иконки отмены

source: Fix legacy / handebar template parsing
ar: إصلاح تحليل قالب قديم / هاندل
ja: レガシー/ハンデバーテンプレートの解析を修正
ru: Исправить устаревшие / handebar шаблоны разбора

source: Fix icon sizes for notifications and search
ar: إصلاح أحجام الأيقونة للإشعارات والبحث
ja: 通知と検索のアイコンサイズを修正
ru: Исправить размеры значков для уведомлений и поиска

source: Fix audio files incorrectly importing when attached
ar: إصلاح ملفات الصوت بشكل غير صحيح عند إرفاقها
ja: 添付時にオーディオファイルを誤ってインポートする問題を修正
ru: Исправлено некорректное импортирование аудиофайлов при подключении

source: Fix deck options "steps" showing up with lots of decimal places
ar: إصلاح خيارات مجموعة "الخطوات" تظهر مع الكثير من الأماكن العشرية
ja: 小数点以下の多くの場所でデッキオプション「ステップ」が表示される問題を修正
ru: Исправлена настройка "шага" при отображении большого количества десятичных знаков

source: Update translations, add Kannada language
ar: تحديث الترجمة، إضافة لغة كانادا
ja: 翻訳を更新し、Kanada言語を追加します
ru: Обновить переводы, добавить Kannada язык

source: Fix F-Droid app store publishing
ar: إصلاح نشر متجر تطبيقات F-Droid
ja: F-Droidアプリストアの公開を修正
ru: Исправить публикацию в магазине F-Droid

source: Correct navigation away from and back to Changelog
ar: تصويب التنقل بعيداً وعودة إلى التغيير
ja: 変更履歴へのナビゲーションを修正する
ru: Исправлять навигацию вдали от и обратно в список изменений

source: Fix template parsing for "{{FrontSide}}"
ar: إصلاح تحليل قالب ل "{{FrontSide}}"
ja: "{{FrontSide}}" のテンプレート解析を修正
ru: Исправлен разбор шаблонов для "{{FrontSide}}"

source: Fix stats tab view layout in RTL context
ar: إصلاح مخطط عرض إحصائيات التبويب في سياق RTL
ja: RTLコンテキストで統計タブビューのレイアウトを修正
ru: Исправить макет вида табуляции в RTL контексте

source: Fix preview of cloze cards from note editor
ar: إصلاح المعاينة لبطاقات الملابس من محرر الملاحظات
ja: ノートエディターからカードを閉じるプレビューを修正
ru: Исправлен предварительный просмотр замыкающих карт из редактора заметок

source: [Full changelog here](https://github.com/ankidroid/Anki-Android/milestone/45?closed=1)
ar: [سجل التغييرات الكامل هنا](https://github.com/ankidroid/Anki-Android/milestone/45?closed=1)
ja: format@@0(https://github.com/anki-Android/milestone/45?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/45?closed=1)

source: Version 2.15.2 (20210526)
ar: الإصدار 2.15.2 (20210526)
ja: バージョン 2.15.2 (20210526)
ru: Версия 2.15.2 (20210526)

source: [❤️ Your donations here give us the time to work on the app, thank you! ❤️](https://opencollective.com/ankidroid)
ar: [❤️ تبرعاتك هنا تعطينا الوقت للعمل على التطبيق، شكرا! ❤️](https://opencollective.com/ankidroid)
ja: [❤️ あなたの寄付により、アプリで作業する時間が与えられます。ありがとうございます！❤️](https://opencollective.com/ankidroid)
ru: [❤️ Ваши пожертвования дают нам время работать в приложении, спасибо! ❤️](https://opencollective.com/ankidroid)

source: 🔥 Hot fixes for 2.15.0 issues (See below for 2.15.0 notes 👇 it was a huge release!)
ar: 🔥 إصلاحات ساخنة لـ 2.15.0 من المشاكل (انظر أدناه ل 2.15.0 ملاحظات 👇 كان إصدار كبير!)
ja: 🔥2.15.0の問題のホットフィックス(以下の2.15.0の注意👇は巨大なリリースでした!)
ru: 🔥 Исправления горячих клавиш 2.15.0 (см. примечания 2.15.0 👇 это был огромный релиз!)

source: 2.15 should have no regressions now we think 🤞
ar: 2.115 يجب ألا يكون هناك تراجعات الآن نعتقد 🤞
ja: 2.15 はリグレッションを今や:crossed_fingers と考えるべきではありません:
ru: 2.15 не должно быть регрессий теперь мы считаем, что 🤞

source: That means we'll slow down the releases and these popups now, sorry + thank you
ar: هذا يعني أننا سنبطئ الإصدارات وهذه النوافذ الآن ، آسف + شكرا لك
ja: それは我々が今リリースとこれらのポップアップを遅くすることを意味します, 申し訳ありません + ありがとうございます
ru: Это означает, что мы замедлим выпуск и эти всплывающие окна сейчас, извините + спасибо

source: Fix another API issue breaking card add from external apps
ar: إصلاح إضافة بطاقة تفكيك API أخرى من التطبيقات الخارجية
ja: 外部アプリからのカード追加が破損している別の API の問題を修正しました
ru: Исправлена другая ошибка при добавлении карты из внешних приложений
