Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: The backup is taken in the background when you first start the app. A backup will only happen if more than 5 hours has elapsed since the last time a backup was created. By default, AnkiDroid will store the last 8 backups; this number can be changed in the main settings.
ar: يتم أخذ النسخة الاحتياطية في الخلفية عند بدء التطبيق لأول مرة. لن يحدث النسخ الاحتياطي إلا إذا انقضت أكثر من 5 ساعات منذ آخر مرة تم فيها إنشاء نسخة احتياطية. بشكل افتراضي، سيقوم AnkiDroid بتخزين آخر 8 نسخ احتياطية؛ يمكن تغيير هذا الرقم في الإعدادات الرئيسية.
ja: アプリを最初に起動すると、バックグラウンドでバックアップが取られます。 バックアップは、前回バックアップが作成されてから5時間以上経過した場合にのみ発生します。 デフォルトでは、AnkiDroidは最後の8つのバックアップを保存します。この番号はメイン設定で変更できます。
ru: Резервная копия производится в фоновом режиме при первом запуске приложения. Резервное копирование произойдет только в том случае, если со времени последнего создания резервной копии прошло более 5 часов. По умолчанию, AnkiDroid будет хранить последние 8 резервных копий; это число можно изменить в главных настройках.

source: You can restore a backup by choosing the _restore from backup_ option from the main menu of the [decks screen](deck-picker.md).
ar: يمكنك استعادة نسخة احتياطية عن طريق اختيار خيار _restore من النسخة الاحتياطية_ من القائمة الرئيسية لـ [سطح الشاشة](deck-picker.md).
ja: format@@0(deck-picker.md)のメインメニューからformat@@1オプションを選択すると、バックアップを復元できます。
ru: Вы можете восстановить резервную копию, выбрав опцию _restore из backup_ из главного меню экрана [колоды](deck-picker.md).

source: [AnkiWeb account](#ankiweb-account)
ar: [حساب أنكيويب] (#ankiweb-account)
ja: format@@0(#ankiWeb-account)
ru: [аккаунт AnkiWeb](#ankiweb-аккаунт)

source: [Fetch media on sync](#fetch-media-on-sync)
ar: [جلب الوسائط على المزامنة](#fetch-media-on-sync)
ja: format@@0(#fetch-media-on-sync)
ru: [Получить медиа при синхронизации](#fetch-media-on-sync)

source: [Automatic synchronization](#automatic-synchronization)
ar: [المزامنة التلقائية](#Automatic Translation)
ja: format@@0(#automatic-synchronization)
ru: [Автосинхронизация](#automatic-synchronization)

source: [Deck for new cards](#deck-for-new-cards)
ar: [مجموعة البطاقات الجديدة](#deck-for-new-cards)
ja: format@@0(#deck-for-new-cards)
ru: [Колода для новых карт](#deck-for-new-cards)

source: [Language](#language)
ar: [Language](#اللغة)

source: [Error reporting mode](#error-reporting-mode)
ar: [وضع الإبلاغ عن الأخطاء](#error-reporting-mode)
ja: format@@0(#error-reporting-mode)
ru: [Ошибка сообщения о режиме](#error-reporting-mode)

source: [Notifications](#notifications)
ar: [Notifications](#الإشعارات)
ja: [Notifications](#通知)

source: [Notify when](#notify-when)
ar: [إخطار عندما] (#notify-when)
ja: format@@0(#notify-when)
ru: [Уведомлять когда](#notify-when)

source: [Blink light](#blink-light)
ar: [ضوء الوميض](#blink-light)
ja: format@@0(#blink-light)
ru: [Подлинный свет](#blink-light)

source: [Reviewing](#reviewing)
ar: [Reviewing](#مراجعة)
ja: [Reviewing](#レビュー)
ru: [Reviewing](#просмотр)

source: [New card position](#new-card-position)
ar: [وضع بطاقة جديدة](#new-card-position)
ja: format@@0(#new-card-position)
ru: [Новая позиция](#new-card-position)

source: [Start of next day](#start-of-next-day)
ar: [بدء في اليوم التالي] (#start-of-next-day)
ja: format@@0(#start-of-next)
ru: [Начало следующего дня](#start-of-next-day)

source: [Learn ahead limit](#learn-ahead-limit)
ar: [تعلم قبل الحدود](#learn-ahead-limit)
ja: format@@0(#learn-ahead-limit)
ru: [Узнать дальнее ограничение](#learn-ahead-limit)

source: [Timebox limit](#timebox-limit)
ar: [حد صندوق الوقت](#timebox-limit)
ja: format@@0(#timebox-limit)
ru: [Лимит времени](#timebox-limit)

source: [Keep screen on](#keep-screen-on)
ar: [حافظ على الشاشة على](#keep-screen-on)
ja: format@@0(#keep-screen-on)
ru: [Держать экран включенным](#keep-screen-on)

source: [Fullscreen mode](#fullscreen-mode)
ar: [وضع ملء الشاشة](#fullscreen-mode)
ja: format@@0(#fullscreen-mode)
ru: [Полноэкранный режим](#fullscreen-mode)

source: [Show button time](#show-button-time)
ar: [إظهار وقت الزر] (#show-button-time)
ja: format@@0(#show-button-time)
ru: [Показать время кнопки](#show-button-time)

source: [Card zoom](#card-zoom)
ar: [تصغير البطاقة] (#card-zoom)
ja: format@@0(#card-zoom)
ru: [Увеличить карты](#card-zoom)

source: [Answer button size](#answer-button-size)
ar: [حجم زر الإجابة](#answer-button-size)
ja: format@@0(#answer-button-size)
ru: [Размер кнопки ответа](#answer-button-size)

source: [Show remaining](#show-remaining)
ar: [إظهار المتبقي] (#show-تبقى)
ja: format@@0(#show-remaining)
ru: [Осталось](#show-remaining)

source: [Whiteboard](#whiteboard)
ar: [Whiteboard](#لوح البيضاء)
ja: [Whiteboard](#ホワイトボード)

source: [Stroke width](#stroke-width)
ar: [عرض جرة القلمة] (#stroke-width)
ja: format@@0(#stroke-width)
ru: [Ширина штриха](#stroke-width)

source: [Black strokes](#black-strokes)
ar: [السكتة السوداء](#black-strokes)
ja: format@@0(#black-strokes)
ru: [Черные штрихи](#black-strokes)

source: [Automatic display answer](#automatic-display-answer)
ar: [إجابة العرض التلقائي](#automatic-display-answer)
ja: format@@0(#automatic-display-answers)
ru: [Автоматический ответ](#automatic-display-answer)

source: [Time to show answer](#time-to-show-answer)
ar: [الوقت لإظهار الإجابة](#time-to-show-answer)
ja: format@@0(#time-to-show-answer)
ru: [Время показать ответ](#time-to-show-answer)

source: [Time to show next question](#time-to-show-next-question)
ar: [حان الوقت لإظهار السؤال التالي](#timeto-show-next-question)
ja: format@@0(#time-to-show-next-question)
ru: [Время показать следующий вопрос](#time-to-show-next-question)

source: [Fonts](#fonts)
ar: [Fonts](#خطوط)
ru: [Fonts](#шрифты)

source: [Default font applicability](#default-font-applicability)
ar: [تطبيق الخط الافتراضي](#default-font-applicability)
ja: format@@0(#default-font-applicability)
ru: [Приложение шрифта по умолчанию](#default-font-applicability)

source: [Browser and editor font](#browser-and-editor-font)
ar: [المتصفح ومحرر](#browser-and-editor-font)
ja: format@@0(#browser-and-editor-font)
ru: [Шрифт браузера и редактора](#browser-and-editor-font)

source: [Card browser font scaling](#card-browser-font-scaling)
ar: [قياس خط متصفح البطاقة](#card-browser-font-scalt)
ja: format@@0(#card-browser-font-scaling)
ru: [Масштабирование шрифта в браузере карты](#card-browser-font-scaling)

source: The preferences screen can be accessed by opening the navigation drawer, and choosing **Settings**. It allows you to customize various application settings and how AnkiDroid appears.
ar: يمكن الوصول إلى شاشة التفضيلات عن طريق فتح قائمة التنقل، واختيار **الإعدادات**. يسمح لك بتخصيص مختلف إعدادات التطبيق وكيف يظهر أنكيدرويد.
ja: 設定画面には、ナビゲーションドロワーを開き、**設定**を選択することでアクセスできます。 これにより、さまざまなアプリケーション設定とAnkiDroidの表示方法をカスタマイズできます。
ru: Для доступа к экрану настроек можно открыть панель навигации и выбрать **Настройки**. Он позволяет настроить различные настройки приложения и как появляется AnkiDroid.

source: The Preferences screen is divided up into different sections, which are covered below.
ar: يتم تقسيم شاشة التفضيلات إلى أقسام مختلفة يتم تغطيتها أدناه.
ja: format@@0画面は異なるセクションに分かれており、以下で説明します。
ru: Экран настроек поделен на различные разделы, которые описаны ниже.

source: AnkiDroid
ar: أنكيدرويد
ru: Анкидроид

source: These are the general settings which affect the whole app:
ar: هذه هي الإعدادات العامة التي تؤثر على التطبيق بأكمله:
ja: これらはアプリ全体に影響を与える一般的な設定です。
ru: Это общие настройки, которые влияют на все приложения:

source: AnkiWeb account
ar: حساب AnkiWeb
ja: AnkiWebアカウント
ru: AnkiWeb аккаунт

source: Change the account used for syncing with the cloud. For more information on syncing, please see [this section](anki-desktop.md).
ar: تغيير الحساب المستخدم للمزامنة مع السحابة. لمزيد من المعلومات عن المزامنة، يرجى الرجوع إلى [هذا القسم] (anki-desktop.md).
ja: クラウドとの同期に使用するアカウントを変更します。同期の詳細については、format@@0(anki-desktop.md) を参照してください。
ru: Измените учетную запись, используемую для синхронизации с облаком. Для получения дополнительной информации о синхронизации, смотрите [этот раздел](anki-desktop.md).

source: Fetch media on sync
ar: جلب الوسائط عند المزامنة
ja: 同期時にメディアを取得
ru: Получать медиа при синхронизации

source: By default, AnkiDroid will sync sounds and images as well as your cards and review history. If you disable this option, sounds and images will not be downloaded from or uploaded to the sync server by AnkiDroid.
ar: بشكل افتراضي، سيقوم AnkiDroid بمزامنة الأصوات والصور فضلا عن بطاقات ومراجعة التاريخ. إذا قمت بتعطيل هذا الخيار، لن يتم تحميل الأصوات والصور من أو تحميلها إلى خادم المزامنة بواسطة AnkiDroid.
ja: デフォルトでは、AnkiDroidはサウンドと画像とカードとレビュー履歴を同期します。 このオプションを無効にすると、AnkiDroidが音声や画像を同期サーバーにダウンロードしたりアップロードしたりすることはありません。
ru: По умолчанию AnkiDroid будет синхронизировать звуки и изображения, а также ваши карты и историю просмотра. Если вы отключите эту опцию, то звуки и изображения не будут загружены с сервера синхронизации AnkiDroid или загружены на сервер.

source: Automatic synchronization
ar: المزامنة التلقائية
ja: 自動同期
ru: Автоматическая синхронизация

source: Enable this option if you want AnkiDroid to sync every time you open and close the app. There is a limit of once every ten minutes for this behavior. Once a sync begins you can cancel it by pressing your device's back button, however it can take some time for the cancellation to take effect.
ar: تمكين هذا الخيار إذا كنت ترغب في مزامنة AnkiDroid في كل مرة تفتح فيها التطبيق وتغلقه. هناك حد أقصى لمرة واحدة كل عشر دقائق لهذا السلوك. بمجرد بدء المزامنة، يمكنك إلغائها بالضغط على زر الرجوع لجهازك، غير أنه قد يستغرق الأمر بعض الوقت لكي يصبح الإلغاء نافذا.
ja: アプリを開いたり閉じたりするたびにAnkiDroidを同期させたい場合は、このオプションを有効にしてください。 この行動には１０分に１度の制限があります。 同期が開始されると、デバイスのformat@@0ボタンを押してキャンセルできます。 しかしキャンセルには時間がかかります
ru: Включите эту опцию, если хотите, чтобы AnkiDroid синхронизировался каждый раз при открытии и закрытии приложения. Это поведение ограничивается один раз в десять минут. Как только начнется синхронизация, вы сможете отменить ее нажатием кнопки "Назад", Однако для отмены может потребоваться некоторое время.

source: Users that want more fine-grained control over when sync occurred might like to use a 3rd party app like Tasker to automate synchronization. See the
ar: قد يرغب المستخدمون الذين يريدون المزيد من التحكم الدقيق في وقت حدوث المزامنة في استخدام تطبيق طرف ثالث مثل Tasker لأتمتة المزامنة. انظر
ja: 同期が発生したときにより細かく制御したいユーザーは、Taskerのようなサードパーティのアプリを使用して同期を自動化したいと思うかもしれません。次を参照してください:
ru: Пользователи, которым нужен более тонкий контроль при синхронизации, могут захотеть использовать сторонние приложения, такие как Tasker для автоматизации синхронизации. Смотрите

source: API documentation
ar: وثائق API
ja: API ドキュメント
ru: Документация по API

source: for more information on this.
ar: للحصول على مزيد من المعلومات عن هذا.
ja: もっと詳しく知りたいと思います
ru: для получения дополнительной информации об этом.

source: Deck for new cards
ar: مجموعة بطاقات جديدة
ja: 新しいカードのデッキ
ru: Колода для новых карт

source: The default of **Use current deck** means that Anki saves the last-used note type for each deck and selects it again then next time you choose the deck (and, in addition, will start with the current deck selected when choosing Add from anywhere). The other option, **Decide by note type,** saves the last-used deck for each note type (and opens the add window to the last-used note type when you choose Add). This may be more convenient if you always use a single note type for each deck.
ar: الافتراضي لـ **استخدام المجموعة الحالية** يعني أن أنكي تحفظ آخر نوع من الملاحظات المستخدمة لكل مجموعة وتحددها مرة أخرى في المرة القادمة التي تختار فيها المجموعة (و بالإضافة إلى ذلك، سيبدأ مع المجموعة الحالية المحددة عند اختيار الإضافة من أي مكان). الخيار الآخر، **تقرير نوع الملاحظة، * يحفظ آخر مجموعة مستخدمة لكل نوع من أنواع الملاحظات (ويفتح نافذة إضافة إلى آخر نوع من الملاحظات المستخدمة عند اختيار إضافة). قد يكون هذا أكثر ملاءمة إذا كنت دائماً تستخدم نوع ملاحظة واحد لكل مجموعة.
ja: デフォルトの**現在のデッキを使用**は、Ankiが各デッキに最後に使用したノートタイプを保存し、次にデッキを選択したときに再度選択することを意味します。 さらに、「どこからでも追加」を選択すると、現在のデッキが選択されます。 もう1つのオプションは、**ノートタイプによって決定する * ノートタイプごとに最後に使用したデッキを保存します(「追加」を選択すると、最後に使用したノートタイプに追加ウィンドウが開きます)。 各デッキに1つのノートタイプを常に使用する場合は、この方が便利です。
ru: По умолчанию **Использовать текущую колоду** означает, что Анки сохранит для каждой колоды последний использованный тип заметок и снова выбирает его при следующем выборе колоды (и, , также будет начинаться с текущей колоды, выбранной при выборе Добавить из любого места). Другой вариант, **Решить по типу заметок, * сохраняет последнюю используемую колоду для каждого типа заметок (и открывает окно добавления в последний использованный тип заметки при выборе Add). Это может быть более удобно, если вы всегда используете один тип заметок для каждой палубы.

source: Language
ar: اللغة
ja: 言語
ru: Язык

source: Change the language. Note: AnkiDroid translations are contributed by volunteers. If you find missing or incorrect translations, feel free to contribute to the translation project. More details can be found on the
ar: تغيير اللغة. ملاحظة: يتم المساهمة بترجمات أنكيدرويد من قبل المتطوعين. إذا وجدت ترجمات مفقودة أو غير صحيحة، لا تتردد في المساهمة في مشروع الترجمة. يمكن العثور على مزيد من التفاصيل على
ja: 言語を変更します。注意: AnkiDroidの翻訳はボランティアによって提供されています。 翻訳が見つからない、または間違っている場合は、翻訳プロジェクトに貢献してください。詳細については、
ru: Измените язык. Примечание: переводы AnkiDroid выполняются добровольцами. Если вы обнаружили недостающие или неправильные переводы, не стесняйтесь внести свой вклад в проект перевода. Более подробную информацию можно найти на

source: AnkiDroid Wiki
ar: ويكي أنكيدرويد
ru: AnkiDroid Вики

source: Error reporting mode
ar: وضع الإبلاغ عن الأخطاء
ja: エラー報告モード
ru: Отчеты об ошибках

source: Control whether or not AnkiDroid asks your permission before sending error reports to our error reporting system when AnkiDroid crashes. You can also disable the reporting feature entirely if you wish.
ar: التحكم في ما إذا كان أنكيدرويد يطلب إذنك قبل إرسال تقارير الأخطاء إلى نظام الإبلاغ عن الأخطاء لدينا عندما تتعطل أنكيدرويد. يمكنك أيضًا تعطيل ميزة الإبلاغ بالكامل إذا رغبت في ذلك.
ja: AnkiDroidがクラッシュしたときにエラー報告システムにエラー報告を送信する前に、AnkiDroidがあなたの許可を求めるかどうかを制御します。 必要に応じてレポート機能を完全に無効にすることもできます。
ru: Проверьте, запрашивает ли AnkiDroid разрешение перед отправкой отчетов об ошибках в нашу систему отчетов об ошибках. Вы также можете полностью отключить функцию отчетности, если хотите.

source: Notifications
ar: الإشعارات
ja: 通知
ru: Уведомления

source: This subsection allows you configure when and how AnkiDroid shows alerts in the Android notification bar.
ar: هذا القسم الفرعي يسمح لك بتكوين متى وكيف يظهر AnkiDroid التنبيهات في شريط التنبيهات للأندرويد.
ja: このセクションでは、Androidの通知バーにいつ、どのようにAnkiDroidがアラートを表示するかを設定できます。
ru: Этот подраздел позволяет настраивать, когда и как AnkiDroid показывает оповещения в панели уведомлений Android.

source: Notify when
ar: إعلام عندما
ja: いつ通知するか
ru: Уведомлять при

source: **Never notify** will disable all notifications from AnkiDroid. **Pending messages available** will only show important status updates like when a sync completed. **More than n cards due** will show a notification when you have more than n cards due (requires the widget to be enabled).
ar: **لا تنبه** أبداً سيعطل جميع الإشعارات من AnkiDroid. ستظهر **الرسائل المعلقة المتاحة** تحديثات الحالة المهمة فقط عند اكتمال المزامنة. **أكثر من n بطاقات مستحقة** سوف تظهر إشعارًا عندما يكون لديك أكثر من n بطاقات مستحقة (يتطلب أن يتم تمكين القطعة).
ja: **通知しない**はAnkiDroidからのすべての通知を無効にします。**保留中のメッセージ**は、同期が完了したときなどの重要なステータス更新のみを表示します。 n枚以上のカードが期限切れになった場合、**n枚以上のカードが表示されます（ウィジェットを有効にする必要があります）。
ru: **Никогда не уведомляйте** отключит все уведомления от AnkiDroid. **В ожидании доступных сообщений** будут отображаться только важные обновления статуса при завершении синхронизации. **Более чем n карт** покажет уведомление, когда у вас больше чем N карт (необходимо включить виджет).

source: Vibrate
ar: اهتزاز
ja: 振動
ru: Вибрация

source: Checking this will make your device vibrate when showing a notification
ar: التحقق من هذا سيجعل جهازك يهتز عند عرض إشعار
ja: これをチェックすると、通知を表示したときにデバイスが振動します
ru: Включение этого параметра сделает вибрацию вашего устройства при отображении уведомления

source: Blink light
ar: وميض الضوء
ja: ライトを点滅させる
ru: Мягкий свет

source: Checking this will make your device light blink when an unread notification exists (if your device has a notification LED)
ar: التحقق من هذا سيجعل جهازك مربع الضوء عند وجود إشعار غير مقروء (إذا كان جهازك لديه ضوء إشعارات)
ja: これをチェックすると未読の通知が存在するとデバイスのライトが点滅します(お使いのデバイスに通知LEDがある場合)
ru: Включение этого параметра сделает индикатор вашего устройства мигающим при наличии непрочитанных уведомлений (если ваше устройство имеет светодиод уведомления)

source: Reviewing
ar: استعراض
ja: レビュー中
ru: Обзор

source: The reviewing screen allows you to customize how AnkiDroid behaves when you're reviewing cards. Note that only the reviewing settings which are applied to **all decks** are shown here. There are more settings related to reviewing which are **deck specific**. These deck specific settings are located in **Deck options**.
ar: تتيح لك شاشة المراجعة تخصيص كيفية تصرف أنكيدرويد عند مراجعة البطاقات. لاحظ أن إعدادات المراجعة التي يتم تطبيقها على **جميع المجموعات** هي فقط التي تظهر هنا. هناك المزيد من الإعدادات ذات الصلة بالمراجعة والتي هي **خاصة بالمجموعة**. هذه الإعدادات الخاصة بالمجموعة موجودة في **خيارات المجموعة**.
ja: レビュー画面では、カードのレビュー時にAnkiDroidの動作をカスタマイズできます。 **すべてのデッキ** に適用されるレビュー設定のみがここに表示されます。 レビューに関連する設定は、**デッキ固有**です。これらのデッキ固有の設定は、**デッキオプション**にあります。
ru: Экран обзора позволяет настроить поведение AnkiDroid при просмотре карт. Обратите внимание, что здесь показаны только параметры проверки, которые применяются к **всем колодам**. Есть больше настроек, связанных с рассмотрением, которые являются **специфичными для колоды**. Эти настройки расположены в **настройках колоды**.

source: New card position
ar: موضع بطاقة جديد
ja: 新しいカードの位置
ru: Позиция новой карты

source: Controls when new cards are shown: either mixed with, after, or before all reviews.
ar: الضوابط عند عرض بطاقات جديدة: إما مختلطة أو بعد أو قبل جميع المراجعات.
ja: 新しいカードが表示されるタイミングを制御します:すべてのレビューとミックスした後、またはその前に表示されます。
ru: Контролирует при отображении новых карт: либо смешанные, либо после них, либо перед всеми обзорами.

source: Start of next day
ar: ابدأ في اليوم التالي
ja: 翌日の始まり
ru: Начало следующего дня

source: Controls when AnkiDroid should start showing the next day's cards. The default setting of 4AM ensures that if you're studying around midnight, you won't have two days worth of cards shown to you in one session. If you stay up very late or wake up very early, you may want to adjust this to a time you're usually sleeping.
ar: التحكم عندما يبدأ AnkiDroid بعرض بطاقات اليوم التالي. الإعداد الافتراضي لـ 4AM يضمن أنه إذا كنت تدرس حوالي منتصف الليل، لن يكون لديك بطاقات بقيمة يومين معروضة لك في جلسة واحدة. إذا بقيت متأخرة جداً أو تستيقظ مبكراً جداً، قد ترغب في ضبط هذا إلى وقت تنام عادةً.
ja: AnkiDroidが翌日のカードの表示を開始するタイミングを制御します。 午前4時のデフォルト設定は、真夜中頃に勉強している場合に保証します。 一度のセッションで2日分のカードを見せることはできません 非常に遅くまで起きているか、非常に早く起きている場合は、通常寝ている時間に調整することができます。
ru: Контролирует когда AnkiDroid должен начать показывать карты на следующий день. Настройки по умолчанию 4AM гарантируют, что если вы учитесь в середине ночи, у вас не будет карт стоимостью два дня за один сеанс. Если вы остановитесь очень поздно или рано просыпаться, вы можете настроить это с учетом времени, которое обычно вы спите.

source: Learn ahead limit
ar: تعلم قبل الحد الأقصى
ja: 先行学習の制限
ru: Узнать предел вперед

source: The Learn ahead limit tells AnkiDroid how to behave when there is nothing left to study in the current deck but cards in learning. The default setting of 20 minutes tells AnkiDroid that cards should be shown early if they are due to be shown in less than 20 minutes and there's nothing else to do. If you set this to 0, Anki will always wait the full period, showing the congratulations screen until the remaining cards are ready to be reviewed.
ar: يخبر تقرير التعلم المتقدم أنكيدرويد كيفية التصرف عندما لا يبقى شيء للدراسة في المجموعة الحالية ولكن البطاقات في التعلم. الإعداد الافتراضي لـ 20 دقيقة يخبر أنكيدرويد بأنه يجب عرض البطاقات في وقت مبكر إذا كان من المقرر عرضها في أقل من 20 دقيقة ولا يوجد شيء آخر للقيام به. إذا قمت بتعيين هذا إلى 0، سوف تنتظر أنكي دائماً كامل الفترة. إظهار شاشة التهاني حتى تصبح البطاقات المتبقية جاهزة للمراجعة.
ja: Learnの先行制限では、現在のデッキで学習するカード以外の学習が残っていない場合の動作方法をAnkiDroidに伝えます。 20分以内のデフォルト設定では、AnkiDroidは、20分未満で表示されるため、他に何もない場合は、カードを早めに表示するように指示します。 これを0に設定すると、Ankiは常にフルピリオドを待機します。 残りのカードが確認できるまでお祝いの画面を表示します。
ru: Лимит «Изучите вперед» говорит AnkiDroid о том, как вести себя, когда нет ничего общего для изучения на текущей колоде, кроме карт в обучении. Значение по умолчанию 20 минут говорит AnkiDroid, что карты должны быть показаны раньше, если они должны быть показаны менее чем за 20 минут, и ничего другого не делать. Если вы установите 0, Anki всегда будет ждать весь период, показывают поздравления на экране до тех пор, пока оставшиеся карты готовы к рассмотрению.

source: Timebox limit
ar: حد صندوق الوقت
ja: タイムボックスの上限
ru: Лимит таймера

source: Timeboxing is a technique to help you focus by dividing a longer activity (such as a 30 minute study session) into smaller blocks. If you set the timebox time limit to a non-zero number of minutes, AnkiDroid will periodically show a message saying you how many cards you've managed to study during the prescribed time limit.
ar: الإعداد الزمني هو تقنية تساعدك على التركيز من خلال تقسيم نشاط أطول (مثل جلسة دراسة لمدة 30 دقيقة) إلى كتل أصغر. إذا قمت بتعيين الحد الزمني لصندوق الوقت إلى عدد غير صفر من الدقائق، سوف تظهر أنكيدرويد بشكل دوري رسالة تقول كم عدد البطاقات التي تمكنت من دراستها خلال المهلة المحددة.
ja: タイムボクシングは、より長いアクティビティ(30分の学習セッションなど)を小さなブロックに分割することで集中するのに役立ちます。 タイムボックスの時間制限をゼロ以外の分数に設定した場合。 AnkiDroidは定期的に、所定の制限時間内に何枚のカードを勉強したかというメッセージを表示します。
ru: Временной ящик — это техника, которая поможет вам сосредоточиться, разделив длинную активность (например, 30-минутный учебный сеанс) на меньшие блоки. Если вы установите лимит времени на ненулевое количество минут, AnkiDroid периодически покажет сообщение, в котором говорится, сколько карточек вам удалось учиться в установленные сроки.

source: Display
ar: عرض
ja: 表示
ru: Отображение

source: This subsection relates to the way cards are displayed during reviewing
ar: هذا القسم الفرعي يتعلق بالطريقة التي يتم بها عرض البطاقات أثناء المراجعة
ja: このサブセクションは、レビュー中のカードの表示方法に関連しています
ru: Этот подраздел относится к тому, как отображаются карты при просмотре

source: Keep screen on
ar: إبقاء الشاشة قيد التشغيل
ja: 画面をオンにする
ru: Не выключать экран

source: Ignore the automatic screen timeout setting in Android to always keep the screen on.
ar: تجاهل إعداد مهلة الشاشة التلقائية في أندرويد للحفاظ على تشغيل الشاشة دائما.
ja: 画面を常にオンにするには、Android の自動スクリーンタイムアウト設定を無視してください。
ru: Игнорировать автоматический тайм-аут экрана в Android, чтобы всегда держать экран включенным.

source: Fullscreen mode
ar: وضع ملء الشاشة
ja: 全画面モード
ru: Полноэкранный режим
