Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Introduction
ar: مقدمة
ja: はじめに
ru: Введение

source: Getting started
ar: بدء التشغيل
ja: はじめに
ru: Приступая к работе

source: The Deck List
ar: قائمة المجموعات
ja: デッキリスト
ru: Список колод

source: Navigation Drawer
ar: درج التنقل
ja: ナビゲーション ドロワー
ru: Панель навигации

source: Deck Overview Screen
ar: شاشة نظرة على المجموعة
ja: デッキ概要画面
ru: Экран обзора колоды

source: Study Screen
ar: شاشة الدراسة
ja: 学習画面
ru: Экран обучения

source: Add Note Screen
ar: إضافة شاشة ملاحظة
ja: メモ画面を追加
ru: Добавить Заметку

source: Edit Note Screen
ar: تحرير شاشة الملاحظة
ja: メモ画面の編集
ru: Изменить Экран заметки

source: Finding/Searching/Browsing
ar: العثور / البحث/التنقيب
ja: 検索/検索/閲覧
ru: Найти/поиск/просмотр

source: Filtered Decks
ar: فلاتر الأوراق
ja: フィルタされたデッキ
ru: Отфильтрованные колоды

source: Importing Anki Files
ar: استيراد ملفات أنكي
ja: Ankiファイルのインポート
ru: Импорт файлов Anki

source: Importing Anki Databases (.anki2)
ar: استيراد قواعد بيانات أنكي (.anki2)
ja: Anki データベースのインポート (.anki2)
ru: Импорт баз данных Anki (.anki2)

source: Exporting Anki Files
ar: تصدير ملفات أنكي
ja: Ankiファイルのエクスポート
ru: Экспорт файлов Anki

source: Automatic Backups
ar: النسخ الاحتياطي التلقائي
ja: 自動バックアップ
ru: Автоматическое резервное копирование

source: Preferences
ar: التفضيلات
ja: 設定
ru: Настройки

source: Gestures
ar: إيماءات
ja: ジェスチャー
ru: Жесты

source: Note Formatting Toolbar
ar: شريط أدوات تنسيق الملاحظة
ja: ノートの書式設定ツールバー
ru: Панель инструментов форматирования заметок

source: Keyboard Shortcuts
ar: اختصارات لوحة المفاتيح
ja: キーボードショートカット
ru: Горячие клавиши

source: Using Right-To-Left Languages with AnkiDroid
ar: استخدام اللغات اليمنى لليسار مع AnkiDroid
ja: AnkiDroid で右から左への言語を使用する
ru: Использование языков справа налево с AnkiDroid

source: Using Anki Desktop with AnkiDroid
ar: استخدام سطح المكتب أنكي مع أنكيدرويد
ja: AnkiDroidでAnkiデスクトップを使用する
ru: Использование Anki Desktop с AnkiDroid

source: Dealing with merge conflicts on AnkiWeb
ar: التعامل مع تضارب الدمج على AnkiWeb
ja: AnkiWeb上でのマージ競合の処理
ru: Разрешение с конфликтами слияний на AnkiWeb

source: Advanced Features
ar: الميزات المتقدمة
ja: 高度な機能
ru: Дополнительные возможности

source: MathJax Support
ar: دعم MathJax
ja: MathJax サポート
ru: Поддержка MathJax

source: Reverse Cards
ar: البطاقات العكسية
ja: カードを反転
ru: Обратные карточки

source: Custom Fonts
ar: خطوط مخصصة
ja: カスタムフォント
ru: Пользовательские шрифты

source: Custom Card Layout
ar: تخطيط بطاقة مخصصة
ja: カスタムカードレイアウト
ru: Пользовательский макет карты

source: Type in the answer feature
ar: اكتب في ميزة الإجابة
ja: 回答機能を入力してください
ru: Наберите функцию ответа

source: Advanced Statistics
ar: إحصائيات متقدمة
ja: 高度な統計情報
ru: Расширенная статистика

source: Reminders
ar: تذكيرات
ja: リマインダー
ru: Напоминания

source: Automatic Language Selection
ar: اختيار اللغة التلقائي
ja: 言語の自動選択
ru: Автоматический выбор языка

source: Removed Features
ar: تم إزالة الميزات
ja: 削除された機能
ru: Удаленные функции

source: Storage Migration Error
ar: خطأ في نقل التخزين
ja: ストレージ移行エラー
ru: Ошибка миграции памяти

source: Help & Supports
ar: المساعدة والدعم
ja: ヘルプ & サポート
ru: Помощь и поддержка

source: Alpha testing
ar: اختبار ألفا
ja: アルファテスト
ru: Альфа-тест

source: Beta testing
ar: اختبار بيتا
ja: ベータテスト
ru: Бета-тестирование

source: Contributing to AnkiDroid
ar: المساهمة في أنكيدرويد
ja: AnkiDroidへの貢献
ru: Вклад в AnkiDroid

source: Changelog
ar: تغيير
ja: 更新履歴
ru: Список изменений

source: Version 2.16
ar: الإصدار 2-16
ja: バージョン 2.16
ru: Версия 2.16

source: Version 2.15
ar: الإصدار 2.15
ja: バージョン 2.15
ru: Версия 2.15

source: Version 2.14
ar: الإصدار 2.14
ja: バージョン 2.14
ru: Версия 2.14

source: Version 2.13
ar: الإصدار 2-13
ja: バージョン 2.13
ru: Версия 2.13

source: Version 2.12
ar: الإصدار 2-12
ja: バージョン 2.12
ru: Версия 2.12

source: Version 2.11
ar: الإصدار 2.11
ja: バージョン 2.11
ru: Версия 2.11

source: Version 2.10
ar: الإصدار 2.10
ja: バージョン 2.10
ru: Версия 2.10

source: Version 2.9
ar: الإصدار 2.9
ja: バージョン 2.9
ru: Версия 2.9

source: Version 2.8
ar: الصيغة 2-8
ja: バージョン 2.8
ru: Версия 2.8

source: Version 2.7
ar: الإصدار 2-7
ja: バージョン 2.7
ru: Версия 2.7

source: Version 2.6
ar: الإصدار 2-6
ja: バージョン 2.6
ru: Версия 2.6

source: Version 2.5
ar: النسخة 2-5
ja: バージョン 2.5
ru: Версия 2.5

source: Version 2.4
ar: الإصدار 2.4
ja: バージョン 2.4
ru: Версия 2.4

source: Version 2.3
ar: الإصدار 2-3
ja: バージョン 2.3
ru: Версия 2.3

source: Version 2.2
ar: الإصدار 2-2
ja: バージョン 2.2
ru: Версия 2.2

source: Version 2.1
ar: الإصدار 2-1
ja: バージョン 2.1
ru: Версия 2.1

source: Version 2.0
ar: الإصدار 2.0
ja: バージョン 2.0
ru: Версия 2.0

source: Version 0.1 to 1.1.3
ar: الإصدار 0.1 إلى 1-1-3
ja: バージョン 0.1 から 1.1.3
ru: Версия 0.1-1.1.3

source: Thank you for using AnkiDroid, the Android client for the popular [Anki](http://ankisrs.net) spaced repetition system.
ar: نشكرك على استخدام AnkiDroid، عميل أندرويد لنظام [Anki]الموسع (http://ankisrs.net) تباعد بين نظام التكرار.
ru: Благодарим вас за использование AnkiDroid, Android клиента для популярной [Anki](http://ankisrs.net) интервальной системы повтора.

source: Anki is spaced repetition technique which is simple but highly effective. It helps you memorize things by automatically repeating them across increasing intervals based on your responses with no need for you to keep track of what to study or when to study it. You create notes (or download shared decks) with content you need to memorize, and the scheduler will make sure you see the content when you need to.
ar: أما أنكي فهي تقنية تكرار متفاوتة بسيطة ولكنها فعالة للغاية. إنها تساعدك على حفظ الأشياء من خلال تكرارها تلقائياً عبر فترات متزايدة بناءً على ردودك بدون حاجة لتتبع ما يجب دراسته أو متى يتم دراسته. يمكنك إنشاء ملاحظات (أو تحميل المجموعات المشتركة) مع المحتوى الذي تحتاج إلى حفظه، والجدول سيتأكد من رؤية المحتوى عندما تحتاج إليه.
ja: アンキは単純ながらも効果的な間隔の繰り返し方法である。 何を勉強すべきか、または勉強すべきかを追跡する必要はありませんので、反応に基づいて頻繁に繰り返し繰り返すことで、物事を記憶するのに役立ちます。 メモする必要があるコンテンツを含むメモ（または共有デッキをダウンロード）を作成します スケジューラは必要な時に内容を確認します
ru: Анки – это пространственная техника повторения, которая проста, но высокоэффективна. Это поможет вам запомнить вещи, автоматически повторяя их через увеличивающиеся интервалы, основанные на ваших ответах, без необходимости отслеживать, что учиться или когда учиться. Вы создаете заметки (или загрузку общих колод) с контентом, который необходимо запомнить, и планировщик позаботится о том, чтобы вы видели содержимое, когда это необходимо.

source: AnkiDroid is intended to be used in conjunction with Anki on your computer. While it is possible to function without it, some tasks are either only possible with, or a lot more efficient with Anki Desktop. Furthermore, it is **strongly recommended** to at least read [`Key Concepts`](https://docs.ankiweb.net/getting-started.html#key-concepts) section of the main Anki manual to understand the terminology used here.
ar: من المعتزم استخدام AnkiDroid بالاقتران مع Anki على جهاز الكمبيوتر الخاص بك. وفي حين أنه من الممكن العمل بدونها، فإن بعض المهام إما أن تكون ممكنة فقط مع مكتب أنكي أو تكون أكثر كفاءة بكثير. وعلاوة على ذلك، من **الموصى به بشدة** أن يقرأ على الأقل [`Key Concepts`](https://docs.ankiweb.net/getting-started.html#key-concepts) من دليل أنكي الرئيسي لفهم المصطلحات المستخدمة هنا.
ja: AnkiDroidは、コンピュータ上でAnkiと組み合わせて使用することを意図しています。 それなしで機能することは可能ですが、一部のタスクはAnki Desktopでのみ可能であるか、より効率的です。 さらに、メインのAnkiマニュアルの[`Key Concepts`](https://docs.ankiweb.net/getting-started.html#key-concepts) セクションを読むことを強く推奨します。
ru: AnkiDroid предназначен для использования вместе с Anki на вашем компьютере. Хотя функционировать без этого, некоторые задачи можно только с помощью Anki Desktop, или гораздо эффективнее. Более того, **настоятельно рекомендуется** по крайней мере прочитать раздел [`Ключевые понятия`](https://docs.ankiweb.net/getting-started.html#key-concepts) главного руководства для Анки для понимания терминологии, используемой здесь.

source: If this manual doesn't contain what you are looking for, please check the [AnkiDroid Wiki](https://github.com/ankidroid/Anki-Android/wiki) for a list of changes, instructions for submitting bug reports and feature requests, a list of frequently asked questions, and much more.
ar: إذا كان هذا الدليل لا يحتوي على ما تبحث عنه، يرجى التحقق من [AnkiDroid Wiki](https://github. om/ankidroid/Anki-Android/wiki) لقائمة التغييرات، والتعليمات لتقديم تقارير الأخطاء وطلبات الميزات، وقائمة الأسئلة المتكررة، وأكثر من ذلك بكثير.
ja: このマニュアルに探しているものが含まれていない場合は、[AnkiDroid Wiki](https://github) を確認してください。 om/ankidroid/Anki-Android/wiki) 変更のリスト、バグレポートや機能追加リクエストの送信手順、よくある質問のリストなど。
ru: Если это руководство не содержит того, что вы ищете, пожалуйста, проверьте [AnkiDroid Wiki](https://github. om/ankidroid/Anki-Android/wiki) для просмотра списка изменений, инструкций по отправке сообщений об ошибках и запросов о функциях, списка часто задаваемых вопросов и многое другое.

source: To start using AnkiDroid, we need to add some cards to study. From the main screen, tapping the big blue plus button will allow you to either add a new **note** (i.e. create new flashcards), download shared decks (decks that other people have created and shared online), or create new empty decks.
ar: للبدء في استخدام AnkiDroid، نحتاج إلى إضافة بعض البطاقات للدراسة. من الشاشة الرئيسية، النقر على الزر الأزرق الكبير زائد سيسمح لك إما بإضافة **ملاحظة** جديدة (ط). . إنشاء بطاقات فلاش جديدة)، أو تحميل طوابق مشتركة (طوابق قام آخرون بإنشائها وتقاسمها على الإنترنت)، أو إنشاء طواقم جديدة فارغة.
ja: AnkiDroidを使い始めるには、いくつかのカードを追加する必要があります。 メイン画面から、大きな青いプラスボタンをタップすると、新しい**メモ**を追加することができます。 をクリックします。新しいフラッシュカードを作成)、共有デッキ(他の人がオンラインで作成、共有したデッキ)をダウンロード、または新しい空のデッキを作成します。
ru: Чтобы начать использовать AnkiDroid, нам нужно добавить несколько карт для изучения. На главном экране нажатие кнопки big blue plus позволит вам либо добавить новую **заметку** (i. . создавать новые флешкарты), загружать общие колоды (колоды, которые другие люди создали и поделились онлайн), или создавать новые пустые колоды.

source: Please watch this 5 minute [tutorial video](https://www.youtube.com/watch?v=F2K1gOSdIZA), which gives an introduction to adding, downloading, and studying cards in AnkiDroid. More detailed information can be found in the sections below.
ar: يرجى مشاهدة 5 دقائق [فيديو الدرس التعليمي](https://www.youtube. om/watch?v=F2K1gOSDIZA)، الذي يعطي مقدمة لإضافة بطاقات وتحميلها ودراستها في AnkiDroid. يمكن العثور على معلومات أكثر تفصيلا في الأقسام أدناه.
ja: 5分間format@@0(https://www.youtube) をご覧ください。 om/watch?v=F2K1gOSDIZA) AnkiDroidのカードの追加、ダウンロード、学習について紹介します。詳細は以下のセクションをご覧ください。
ru: Пожалуйста, посмотрите это 5 минут [учебное видео](https://www.youtube. /watch?v=F2K1gOSdIZA, которая дает введение в добавление, загрузку и изучение карт в AnkiDroid. Более подробную информацию можно найти в разделах ниже.

source: If you are an existing user of Anki Desktop wishing to import your decks from the computer, you might like to skip straight to the [using AnkiDroid with Anki Desktop](anki-desktop.md#using-anki-desktop-with-ankidroid) section.
ar: إذا كنت مستخدمًا حاليًا لسطح المكتب أنكي الذي يرغب في استيراد فرقاتك من الكمبيوتر، قد ترغب بالتخطي مباشرة إلى [باستخدام AnkiDroid مع Anki Desktop] (anki-officktop). d#using-anki-desktop-with-ankidroid).
ja: Anki Desktopの既存のユーザーの場合は、コンピュータからデッキをインポートしてください。 format@@0(anki-desktop)に直接スキップしてください。 d#using-anki-desktop-with-ankidroid) section.
ru: Если вы уже являетесь пользователем Anki Desktop, желающим импортировать свои колоды с компьютера, вы можете пропустить прямо к [используя AnkiDroid с Anki Desktop](anki-desktop. d#using-anki-desktop-with-ankidroid) секции.

source: [Add button](#add-button)
ar: [زر إضافة](#add-button)
ja: format@@0(#add-button)
ru: [Добавить кнопку](#addbutton)

source: [Add](#add)
ar: [Add](#إضافة)

source: [Get shared decks](#get-shared-decks)
ar: [احصل على مجموعات مشاركة](#get-shared-decks)
ja: format@@0(#get-shared-decks)
ru: [Получить общие колоды](#get-shared-decks)

source: [Create deck](#create-deck)
ar: [إنشاء مجموعة](#create-deck)
ja: format@@0(#create-deck)
ru: [Создать колоду](#create-deck)

source: [App Bar](#app-bar)
ar: [شريط التطبيق](#app-bar)
ja: format@@0(#app-bar)
ru: [Панель приложений](#app-bar)

source: [Navigation menu button](#navigation-menu-button)
ar: [زر قائمة التنقل](#avigation-menu-button)
ja: format@@0(#navigation-menu-button)
ru: [Кнопка меню навигации](#navigation-menu-button)

source: [Sync button](#sync-button)
ar: [زر المزامنة](#sync-button)
ja: format@@0(#sync-button)
ru: [Кнопка синхронизации](#sync-button)

source: [Studying a Deck](#studying-a-deck)
ar: [دراسة العقر](#studying-a-deck)
ja: format@@0(#studying-a-deck)
ru: [Изучение колоды](#studying-a-deck)

source: [Other Deck Actions](#other-deck-actions)
ar: [إجراءات مجموعة أخرى] (#other-deck-actions)
ja: format@@0(#other-deck-actions)
ru: [Другие действия колод](#other-deck-actions)

source: [Rename deck](#rename-deck)
ar: [إعادة تسمية المجموعة](#renname-deck)
ja: format@@0(#rename-deck)
ru: [Переименовать колоду](#rename-deck)

source: [Deck options](#deck-options)
ar: [خيارات المجموعة](#deck-Options)
ja: format@@0(#deck-options)
ru: [Опции колоды](#deck-options)

source: [Custom study](#custom-study)
ar: [دراسة مخصصة](#custom-study)
ja: format@@0(#custom-study)
ru: [Пользовательское исследование](#custom-study)

source: [Delete deck](#delete-deck)
ar: [حذف المجموعة](#delete-deck)
ja: format@@0(#delete-deck)
ru: [Удалить колоду](#delete-deck)

source: [Export deck](#export-deck)
ar: [تصدير المجموعة](#export-deck)
ja: format@@0(#export-deck)
ru: [Экспорт колоды](#export-deck)

source: [Rebuild / Empty](#rebuild--empty)
ar: [إعادة بناء / فارغ](#rebuild--empty)
ja: format@@0(#rebuild---empty)
ru: [Перестроить / Пусто](#rebuild--empty)

source: [Clickable areas on the decks](#clickable-areas-on-the-decks)
ar: [المناطق القابلة للنقر على الأسطور] (#clickable-areas-on-the-decks)
ja: format@@0(#clickable-areas-on-the-decks)
ru: [Нажатые области на колодах](#clickable-areas-on-the-decks)

source: [Deck expander](#deck-expander)
ar: [توسيع المجموعة](#deck-Exer)
ja: format@@0(#deck-expander)
ru: [Расширитель колоды](#deck-expander)

source: [Deck name](#deck-name)
ar: [اسم المجموعة](#deck-name)
ja: format@@0(#deck-name)
ru: [Название колоды](#deck-name)

source: [Count buttons](#count-buttons)
ar: [أزرار العد] (#count-buttons)
ja: format@@0(#count-buttons)
ru: [Кол-во кнопок](#count-buttons)

source: [Advanced Actions](#advanced-actions)
ar: [الإجراءات المتقدمة](#Advced-actions)
ja: format@@0(#advanced-actions)
ru: [Расширенные действия](#advanced-actions)

source: [Undo](#undo)
ar: [Undo](#التراجع)

source: [Check database](#check-database)
ar: [التحقق من قاعدة البيانات](#check-database)
ja: format@@0(#check-database)
ru: [Проверьте базу данных](#check-database)

source: [Check media](#check-media)
ar: [تحقق من الوسائط](#check-media)
ja: format@@0(#check-media)
ru: [Проверьте медиа](#check-media)

source: [Empty cards](#empty-cards)
ar: [بطاقات فارغة](#empty-cards)
ja: format@@0(#empty-cards)
ru: [Пустые карты](#empty-cards)

source: [Restore from backup](#restore-from-backup)
ar: [الاستعادة من النسخ الاحتياطي](#restore-from-backup)
ja: format@@0(#restore-from-backup)
ru: [Восстановить из резервной копии](#restore-from-backup)

source: [Manage note types](#manage-note-types)
ar: [إدارة أنواع الملاحظة](#manage-note-types)
ja: format@@0(#manage-note-types)
ru: [Управление типами заметок](#manage-note-types)

source: [Import](#import)
ar: [Import](#الاستيراد)

source: [Export collection](#export-collection)
ar: [تصدير المجموعة] (#export-collection)
ja: format@@0(#export-collection)
ru: [Экспорт коллекции](#export-collection)

source: [Deck Counts](#deck-counts)
ar: [عدد المجموعات](#deck-counts)
ja: format@@0(#deck-counts)
ru: [Кол-во колод](#deck-counts)

source: **Note:** _This section onwards assumes you understand what [decks and cards](https://docs.ankiweb.net/getting-started.html#key-concepts) are_
ar: **ملاحظة:** _هذا القسم تفترض أنك تفهم ما هي [سطح السفينة والبطاقات](https://docs.ankiweb.net/getting-started.html#key-concepts)
ja: **注意:** _このセクションでは、format@@0(https://docs.ankiweb.net/getting-started.html#key-concepts) が何であるか理解していることを前提としています_
ru: **Примечание:** _Этот раздел в дальнейшем предполагает, что вы понимаете, что [колоды и карты](https://docs.ankiweb.net/getting-started.html#key-concepts) are_

source: The deck list is the screen you see when you start AnkiDroid. It displays a list of the decks which contain all of your flashcards, and allows you to perform various actions:
ar: قائمة المجموعة هي الشاشة التي تراها عندما تبدأ AnkiDroid. يعرض قائمة بالمجموعات التي تحتوي على جميع بطاقاتك، ويسمح لك بتنفيذ مختلف الإجراءات:
ja: デッキリストは、AnkiDroidを起動するときに表示される画面です。 すべてのフラッシュカードを含むデッキのリストが表示され、さまざまなアクションを実行できます。
ru: Список палуб - это экран, который вы видите при запуске AnkiDroid. Он отображает список колод, которые содержат все ваши карточки и позволяет выполнять различные действия:

source: Add button
ar: إضافة زر
ja: ボタンを追加
ru: Кнопка Добавить

source: The big blue + button in the bottom right corner is used to add new material to AnkiDroid. Pressing it expands to give the following three options, which are also described in the [tutorial video](https://www.youtube.com/watch?v=F2K1gOSdIZA).
ar: الزر الأزرق الكبير + في الزاوية اليمنى السفلى يستخدم لإضافة مواد جديدة إلى أنكيدرويد. الضغط عليه يتوسع لإعطاء الخيارات الثلاثة التالية، والتي يرد وصفها أيضا في [الفيديو التعليمي](https://www.youtube.com/watch?v=F2K1gOSDIZA).
ja: 右下の大きな青+ボタンを使って、AnkiDroidに新しい素材を追加します。 これを押すと、format@@0(https://www.youtube.com/watch?v=F2K1gOSdIZA)にも記載されている以下の3つのオプションが追加されます。
ru: Большая синяя кнопка + в правом нижнем углу используется для добавления нового материала в AnkiDroid. Нажатие на него расширяет возможности трех вариантов, которые также описаны в [обучающем видео](https://www.youtube.com/watch?v=F2K1gOSdIZA).

source: Add
ar: إضافة
ja: 追加
ru: Добавить

source: Choose this option if you want to create your own flashcards (notes) with AnkiDroid. "Notes" and "cards" have specific meanings in Anki, which are [explained in the main Anki manual](https://docs.ankiweb.net/getting-started.html#key-concepts). Please see the tutorial video for a quick introduction to adding notes, or refer to the [adding notes](adding-notes.md#add-note-screen) section below for more detailed information.
ar: اختر هذا الخيار إذا كنت ترغب في إنشاء بطاقات الفلاش الخاصة بك (ملاحظات) مع AnkiDroid. "ملاحظات" و "بطاقات" لها معاني محددة في أنكي، والتي [موضحة في دليل أنكي الرئيسي] (https://docs.ankiweb. et/getting-started.html#key-concepts). الرجاء الاطلاع على الفيديو التعليمي لمقدمة سريعة لإضافة الملاحظات، أو الرجوع إلى قسم [إضافة الملاحظات] (adding-notes.md#add-note-screen) أدناه للحصول على معلومات أكثر تفصيلا.
ja: AnkiDroidで独自のフラッシュカード(ノート)を作成する場合は、このオプションを選択します。 "Notes" と "cards" は、Ankiで特定の意味を持っています。format@@0(https://docs.ankiweb) et/getting-started.html#key-concepts). メモを追加するための簡単な入門についてはチュートリアルビデオを参照するか、format@@0(adding-notes.md#add-note-screen) セクションを参照してください。
ru: Выберите эту опцию, если вы хотите создать свои собственные флешкарточки (заметки) с AnkiDroid. "Примечания" и "карты" имеют специфические значения в Анки, которые [описаны в основном руководстве для Анки](https://docs.ankiweb. et/getting-started.html#key-concepts). Для получения более подробной информации обратитесь к видео с инструкцией по добавлению заметок или обратитесь к разделу [add notes](adding-notes.md#add-note-screen).

source: Get shared decks
ar: احصل على مجموعات مشتركة
ja: 共有デッキを取得
ru: Получить общие колоды

source: To download a deck of cards from the internet that another user has contributed:
ar: لتحميل مجموعة من البطاقات من الإنترنت ساهم فيها مستخدم آخر:
ja: 他のユーザーが投稿したカードをインターネットからダウンロードするには:
ru: Для загрузки колоды карт из интернета, которую внес другой пользователь:

source: Ensure you're connected to the internet.
ar: تأكد من أنك متصل بالإنترنت.
ja: インターネットに接続していることを確認してください。
ru: Убедитесь, что вы подключены к Интернету.

source: Tap + and then **Get shared decks**. AnkiWeb will open.
ar: اضغط + ثم **احصل على مجموعات مشاركة**. سوف تفتح.
ja: + をタップして **共有デッキを取得** します。AnkiWeb が開きます。
ru: Нажмите + и затем **Получить общие колоды**. AnkiWeb откроется.

source: Select a category, or type in a search.
ar: حدد فئة، أو اكتب في البحث.
ja: カテゴリを選択するか、検索に入力します。
ru: Выберите категорию или введите поиск.

source: Tap **Info** on a deck you'd like to study.
ar: انقر فوق **معلومات** على مجموعة تريد دراستها.
ja: 勉強したいデッキの**情報**をタップします。
ru: Нажмите **Информация** на колоде, которую вы хотели бы изучить.

source: Scroll down and tap **Download**.
ar: مرر للأسفل وانقر فوق **تنزيل**.
ja: 下にスクロールして**ダウンロード**をタップします。
ru: Прокрутите вниз и нажмите **Загрузить**.

source: You browser will download the file and display a `download complete` notification. Tap this button.
ar: سوف يقوم المتصفح بتنزيل الملف وعرض إشعار "اكتمل التنزيل". انقر فوق هذا الزر.
ja: ブラウザはファイルをダウンロードし、「ダウンロード完了」の通知を表示します。このボタンをタップしてください。
ru: Браузер загрузит файл и отобразит уведомление `Download complete`. Нажмите эту кнопку.

source: AnkiDroid will appear, and show a confirmation dialog. Tap the **Add** button.
ar: سيظهر أنكيدرويد، وسيظهر مربع حوار التأكيد. اضغط على زر **إضافة**.
ja: AnkiDroidが表示され、確認ダイアログが表示されます。**追加**ボタンをタップしてください。
ru: AnkiDroid появится и появится диалоговое окно подтверждения. Нажмите **Добавить**.

source: When the import completes, your deck should be ready to study.
ar: عند اكتمال الاستيراد، يجب أن تكون مجموعتك جاهزة للدراسة.
ja: インポートが完了すると、デッキは勉強の準備が整います。
ru: Когда импорт завершится, ваша палуба должна быть готова к изучению.

source: Create deck
ar: إنشاء مجموعة
ja: デッキを作成
ru: Создать колоду

source: To create a new empty deck:
ar: لإنشاء مجموعة جديدة فارغة:
ja: 新しい空のデッキを作成するには:
ru: Создавать новую пустую колоду:

source: Tap the **+** button and choose `Create deck`
ar: اضغط على زر **+** واختر `إنشاء مجموعة`
ja: **+** ボタンをタップして `Create deck` を選択します
ru: Нажмите на кнопку **+** и выберите `Создать колоду`

source: Choose a name for the deck, for example `New Japanese`
ar: اختر اسما لمجموعة العناصر، على سبيل المثال 'اليابانية الجديدة`
ja: `New Japanese`のようにデッキ名を選択してください
ru: Выберите имя колоды, например «Новый японский»

source: Add cards to it following the `Add` instructions above
ar: إضافة بطاقات إليها باتباع تعليمات `إضافة` أعلاه
ja: 上記の「追加」の指示に従ってカードを追加する
ru: Добавить карточки в него в соответствии с инструкциями `Добавить` выше

source: App Bar
ar: شريط التطبيقات
ja: アプリバー
ru: Панель приложений

source: At the top of each screen in AnkiDroid is the App Bar, with buttons for performing various actions. The following actions are available from the app bar in the deck list:
ar: في الجزء العلوي من كل شاشة في AnkiDroid هو شريط التطبيقات مع أزرار لأداء مختلف الإجراءات. الإجراءات التالية متاحة من شريط التطبيقات في قائمة المجموعة:
ja: AnkiDroidの各画面の上部には、様々なアクションを実行するためのボタンが付いているアプリバーがあります。 デッキ一覧のアプリバーから次の操作を実行できます。
ru: В верхней части каждого экрана в AnkiDroid находится панель приложений, с кнопками для выполнения различных действий. Из панели приложений в списке колод доступны следующие действия:

source: Navigation menu button
ar: زر قائمة التنقل
ja: ナビゲーションメニューボタン
ru: Кнопка меню навигации

source: Tapping the icon on the far left will show the [left navigation menu](drawer.md#navigation-drawer) for quickly navigating between the main parts of the app.
ar: النقر على أيقونة على أقصى اليسار سيظهر [قائمة التنقل اليسرى](drawer.md#navigation-drawer) للتنقل بسرعة بين الأجزاء الرئيسية من التطبيق.
ja: 一番左側のアイコンをタップすると、format@@0(drawer.md#navigation-drawer)が表示され、アプリのメイン部分を素早く移動できます。
ru: Нажав на значок слева, вы увидите [левое меню навигации](drawer.md#navigation-drawer) для быстрого перехода между основными частями приложения.

source: Sync button
ar: زر المزامنة
ja: 同期ボタン
ru: Кнопка синхронизации
