Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: Fix conditional template issue that caused blank cards for some
ar: إصلاح مشكلة القالب المشروط التي سببت بطاقات فارغة لبعض
ja: いくつかのカードの空白を引き起こした条件付きテンプレートの問題を修正
ru: Исправлена проблема с условным шаблоном, вызывающая пустые карты для некоторых

source: Fix auto-advance ignoring "no advance" setting if card had audio
ar: إصلاح التقدم التلقائي تجاهل إعداد "لا تقدم" إذا كانت البطاقة تحتوي على صوت
ja: カードに音声が含まれている場合、「進んでいない」設定を無視して自動進める問題を修正
ru: Исправлена ошибка игнорирования настроек «без аванса», если на карте есть звук

source: Gracefully handle corrupt collections with invalid current decks selected
ar: التعامل مع المجموعات الفاسدة بطريقة غير صحيحة مع المجموعات الحالية المحددة
ja: 不正な現在のデッキが選択されている破損したコレクションを優雅に処理します
ru: Плавно обрабатывает поврежденные коллекции с некорректными выбранными колодами

source: Publish to Amazon App Store again (go get AnkiDroid on your Fire devices!)
ar: نشر إلى متجر التطبيقات في أمازون مرة أخرى (اذهب للحصول على AnkiDroid على أجهزة الإطفاء الخاصة بك!)
ja: AmazonのApp Storeに再度公開する（火災機器でAnkiDroidを入手してください！）
ru: Опубликовать на Amazon App Store снова (скачайте AnkiDroid на ваши огненные устройства!)

source: [Issue tracker milestone here](https://github.com/ankidroid/Anki-Android/milestone/44?closed=1)
ar: [تعقب المشكلة معلم هنا](https://github.com/ankidroid/Anki-Android/milestone/44?closed=1)
ja: format@@0(https://github.com/anki-Android/milestone/44?closed=1)
ru: [Этап трекера проблем](https://github.com/ankidroid/Anki-Android/milestone/44?closed=1)

source: Version 2.15.1 (20210525)
ar: الإصدار 2.15-1 (20210525)
ja: バージョン 2.15.1 (20210525)
ru: Версия 2.15.1 (20210525)

source: [❤️ Your donations funded this rapid set of fixes, enjoy! ❤️](https://opencollective.com/ankidroid)
ar: [❤️ تبرعاتك مولت هذه المجموعة السريعة من الإصلاحات، استمتع! ❤️](https://opencollective.com/ankidroid)
ja: [❤️ あなたの寄付がこの迅速な修正に資金を提供しました。❤️](https://opencollective.com/ankidroid)
ru: [❤️ Ваши пожертвования финансировали этот быстрый набор исправлений, наслаждайтесь! ❤️](https://opencollective.com/ankidroid)

source: Do not auto-update users to scheduler v2. Yet.
ar: لا تقم بالتحديث التلقائي للمستخدمين إلى المجدولة v2.
ja: スケジューラにユーザーを自動更新しないでください v2. まだ.
ru: Не обновлять автоматически пользователей планировщика v2.

source: Fix crash on undo after deck delete
ar: إصلاح الأعطال عند التراجع بعد حذف المجموعة
ja: デッキ削除後に元に戻すとクラッシュする問題を修正
ru: Исправление сбоя при отмене после удаления колоды

source: Try harder to successfully paste images
ar: حاول بجهد أكبر لصق الصور بنجاح
ja: 画像の貼り付けに成功するように頑張ってください
ru: Попробуйте труднее вставить изображения

source: Reviewer performance fix - only load mathjax if needed
ar: إصلاح أداء المراجعة - تحميل mathjax فقط إذا لزم الأمر
ja: レビューアパフォーマンス修正 - 必要に応じてのみmathjaxを読み込みます
ru: Исправлена производительность рецензента - только загружать mathjax при необходимости

source: Fixed compatibility issue for 2.15 collections on 2.14
ar: مشكلة التوافق الثابتة للمجموعات 2.15 في 2.14
ja: 2.14の2.15コレクションの互換性の問題を修正しました
ru: Исправлена проблема совместимости для 2.15 коллекций на 2.14

source: Fixed API issue breaking card add from external apps
ar: إصلاح مشكلة بطاقة تفكيك API من التطبيقات الخارجية
ja: APIの問題を修正し、外部アプリからカードの追加を中断しました
ru: Исправлена ошибка при добавлении карты из внешних приложений

source: Fresh language translations. See a bad translation? [You can fix it easily!](https://crowdin.com/project/ankidroid)
ar: ترجمات جديدة للغة. راجع ترجمة سيئة؟ [يمكنك إصلاحها بسهولة!](https://crowdin.com/project/ankidroid)
ja: 新鮮な言語翻訳。間違った翻訳を見ますか？format@@0(https://crowdin.com/project/ankidroid)
ru: Свежие переводы языков. Увидимся плохим переводом? [Вы можете это легко исправить!](https://crowdin.com/project/ankidroid)

source: [Detailed issue log](https://github.com/ankidroid/Anki-Android/milestone/43?closed=1)
ar: [سجل المشاكل التفصيلي](https://github.com/ankidroid/Anki-Android/milestone/43?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/43?closed=1)
ru: [Журнал детальных замечаний](https://github.com/ankidroid/Anki-Android/milestone/43?closed=1)

source: Version 2.15.0 (20210524)
ar: الإصدار 2.15.0 (20210524)
ja: バージョン 2.15.0 (20210524)
ru: Версия 2.15.0 (20210524)

source: [❤️ Your donations funded these features, enjoy! ❤️](https://opencollective.com/ankidroid)
ar: [❤️ تبرعاتك مولت هذه الميزات، استمتع! ❤️](https://opencollective.com/ankidroid)
ja: [❤️ あなたの寄付がこれらの機能に資金を提供してくれました！❤️](https://opencollective.com/ankidroid)
ru: [❤️ Ваши пожертвования финансировали эти функции, наслаждайтесь! ❤️](https://opencollective.com/ankidroid)

source: Thanks to [Google Summer of Code](https://github.com/ankidroid/Anki-Android/wiki/Google-Summer-of-Code-2021) students for a HUGE effort!
ar: شكرا لـ [جوجل صيف البرمجة](https://github.com/ankidroid/Anki-Android/wiki/Google-Summer-of-Code-2021) طلاب لجهد HUGE!
ja: [Google Summer of Code](https://github.com/ankidroid/Anki-Android/wiki/Google-Summer-of-Code-2021) の生徒さんに感謝します！
ru: Спасибо [Google Summer of Code](https://github.com/ankidroid/Anki-Android/wiki/Google-Summer-of-Code-2021) студентам за усилия HUGE!

source: Way too many changes to describe, but here are the highlights:
ar: وسُبُل العديد من التغييرات التي يمكن وصفها، ولكن فيما يلي النقاط الرئيسية:
ja: 記述するにはあまりにも多くの変更が、ここでハイライトされています:
ru: Как слишком много изменений, чтобы описать, но вот основные моменты:

source: New timezone code supported for sync with AnkiDesktop!
ar: رمز المنطقة الزمنية الجديدة مدعوم للمزامنة مع AnkiDesktop!
ja: 新しいタイムゾーンコードはAnkiDesktopとの同期に対応しています！
ru: Новый код часового пояса поддерживается для синхронизации с AnkiDesktop!

source: Performance, stability improvements everywhere
ar: تحسين الأداء والاستقرار في كل مكان
ja: どこでもパフォーマンス、安定性の向上
ru: Производительность, улучшение стабильности везде

source: General UI improvements (accessibility, dark mode, design, more)
ar: تحسينات واجهة المستخدم العامة (الوصول، الوضع المظلم، التصميم، المزيد)
ja: 一般的なUIの改善 (アクセシビリティ、ダークモード、デザイン、詳細)
ru: Общие улучшения интерфейса (доступность, темный режим, дизайн, больше)

source: Many new keyboard shortcuts and gesture actions
ar: العديد من اختصارات لوحة المفاتيح وإجراءات الإيماءات الجديدة
ja: 多くの新しいキーボードショートカットとジェスチャーアクション
ru: Множество новых действий на клавиатуре и жестом

source: Languages: Added Odia, Malayalam; big RTL support improvements!
ar: اللغات: أضيفت أوديا، ماليالا؛ دعم كبير في RTL التحسينات!
ja: 言語: Odia, Malayalam; 大きなRTLサポートの改善!
ru: Языки: Добавлена Odia, Malaysialam; Большое RTL поддержку улучшений!

source: Reviewer: Javascript API: many new methods
ar: المراجعة: جافا سكريبت API: العديد من الأساليب الجديدة
ja: レビューア: Javascript API: 多くの新しいメソッド
ru: Рецензент: Javascript API: много новых методов

source: Improved account login, sync conflict, card template UI
ar: تحسين تسجيل الدخول للحساب، تعارض المزامنة، واجهة استخدام قالب البطاقة
ja: 改善されたアカウントログイン、同期競合、カードテンプレートUI
ru: Улучшен вход в аккаунт, конфликт с шаблоном карточки

source: Tags and Decks dialogs have search!
ar: العلامات و الحوارات تحتوي على بحث!
ja: タグとデッキのダイアログが検索されました！
ru: В диалогах тегов и колод есть поиск!

source: Whiteboard: erase, pen colors, stroke width
ar: اللوحة البيضاء: محة، ألوان القلم، عرض سكتة الدماغ
ja: ホワイトボード：消去、ペン色、ストローク幅
ru: Белая доска: удаляется, цвет руки, ширина штриха

source: NoteEditor: Mathjax 3, capitalize sentences setting
ar: محرر الملحوظات: Mathjax 3، تكوين جمل رأسمالية
ja: NoteEditor: Mathjax 3 文章の設定を大文字にする
ru: Редактор заметков: Mathjax 3, заглавные предложения

source: Huge quality improvements all over codebase, helps future developers
ar: تحسينات كبيرة في الجودة عبر الكود البرمجي ، تساعد المطورين في المستقبل
ja: コードベース全体にわたる大幅な品質向上は、将来の開発者に役立ちます
ru: Значительные улучшения качества по всей базе кода, помогают будущим разработчикам

source: [🚧 Full 638 item changelog here! 🚧](https://github.com/ankidroid/Anki-Android/milestone/37?closed=1)
ar: [🚧 كامل 638 عنصر التغيير هنا! :Construction :](https://github.com/ankidroid/Anki-Android/milestone/37?closed=1)
ru: [🚧 Полный список изменений 638 здесь! 🚧](https://github.com/ankidroid/Anki-Android/milestone/37?closed=1)

source: Version 2.14.6 (20210309)
ar: الإصدار 2.14.6 (20210309)
ja: バージョン 2.14.6 (20210309)
ru: Версия 2.14.6 (20210309)

source: Reviewer: fix "my card is blank now with 2.14.5! help!" 😱
ar: مراجع: إصلاح "بطاقتي فارغة الآن مع 2.14.5! مساعدة!" 😱
ja: 査読者: "私のカードは2.14.5で空白になりました! 助けて!" 😱
ru: Reviewer: Исправьте "Моя карта пуста с 2.14.5! help!" 😱

source: Reviewer: fix Android 8/8.1 review buttons disappear (finally?)
ar: المراجعة: إصلاح أزرار مراجعة Android 8/8.1 تختفي (نهائيًا؟)
ja: レビューア:Android 8/8.1のレビューボタンが消える問題を修正(最終的に?)
ru: Рецензент: Исправлены кнопки Android 8/8.1 исчезают (наконец?)

source: Version 2.14.5 (20210307)
ar: الإصدار 2.14.5 (20210307)
ja: バージョン 2.14.5 (20210307)
ru: Версия 2.14.5 (20210307)

source: We really appreciate the [donations](https://opencollective.com/ankidroid), they paid for these fixes 🤝
ar: نحن حقا نقدر [donations](https://opencollective.com/ankidroid)، لقد دفعوا ثمن هذه الإصلاحات 🤝
ja: [donations](https://opencollective.com/ankidroid) に本当に感謝します。これらの修正の支払いは🤝

source: NoteEditor: Android 11 users can crop!
ar: محرر الملاحظة: يمكن لمستخدمي أندرويد 11 الحصار!
ja: メモ:Android 11ユーザーはクロップすることができます!
ru: Редактор заметок: пользователи Android 11 могут обрезать!

source: NoteEditor: Canceling crop twice won't delete your image
ar: محرر الملاحظة: إلغاء المحصول مرتين لن يحذف صورتك
ja: メモ:トリミングを2回キャンセルしても画像は削除されません
ru: Редактор заметки: Отмена кадрирования дважды не удалит ваше изображение

source: DeckList: parent limits altered to match Desktop
ar: القائمة المعلقة: تم تغيير حدود الأصل لتطابق سطح المكتب
ja: デッキリスト: デスクトップに一致するように変更された親制限
ru: Список колод: родительские ограничения изменены для соответствия настольному компьютеру

source: DeckList: current deck saved as correct type
ar: قائمة الإزعاج: المجموعة الحالية المحفوظة كنوع صحيح
ja: デッキリスト: 現在のデッキを正しいタイプとして保存しました
ru: Список декетов: текущая колода сохранена как правильный тип

source: SchedulerV2: allow very small delays
ar: الجدول الزمني 2: السماح بتأخيرات صغيرة جداً
ja: スケジューラV2: ごくわずかな遅延を許可
ru: Планировщик V2: позволяет очень мелкие задержки

source: KNOWN ISSUE: [Android 8/8.1 answer buttons disappear](https://github.com/ankidroid/Anki-Android/issues/7369). Use gestures as workaround.
ar: اعرف القضية: [أزرار الإجابة أندرويد 8/8.1 اختفت](https://github.com/ankidroid/Anki-Android/issues/7369). استخدم الإيماءات كعمل.
ja: KNOWN ISSUE: [Android 8/8.1の解答ボタンが消えます](https://github.com/ankidroid/Anki-Android/issues/7369) 回避策としてジェスチャーを使用してください。
ru: KNOWN ISSUE: [исчезает кнопки ответа Android 8/8.1](https://github.com/ankidroid/Anki-Android/issues/7369). Используйте жесты как обход.

source: Anyone with Android 8/8.1 that reproduces this and knows how to develop Android layouts? We'd love the help!
ar: أي شخص لديه أندرويد 8/8.1 الذي يكرر هذا ويعرف كيفية تطوير مخططات الأندرويد؟ نود أن نحب المساعدة!
ja: これを再現し、Androidのレイアウトを開発する方法を知っているAndroid 8/8.1を持っている誰ですか?
ru: Любой с Android 8/8.1, который воспроизводит это и знает, как разрабатывать макеты Android? Мы будем рады помочь!

source: Version 2.14.4 (20210307)
ar: الإصدار 2.14.4 (20210307)
ja: バージョン 2.14.4 (20210307)
ru: Версия 2.14.4 (20210307)

source: Re-released immediately as 2.14.5 after release script issue 🤷😅
ar: إعادة إصدارها مباشرة كـ 2.14.5 بعد إصدار نص المشكلة 🤷😅
ja: リリーススクリプトの問題が発生した直後に2.14.5として再リリースされました 🤷😅
ru: Сразу же после выпуска версии 2.14.5 был выпущен новый релиз 🤷😅

source: Version 2.14.3 (20210109)
ar: الإصدار 2.14.3 (202109)
ja: バージョン 2.14.3 (20210109)
ru: Версия 2.14.3 (20210109)

source: [The AnKing](https://www.youtube.com/c/TheAnKing) has graced us with a [new intro video](https://youtu.be/iuBU_OM9oAM)! 🤓
ar: [AnKing](https://www.youtube.com/c/TheAnKing) قد سمحنا بـ [فيديو] (https://youtu.be/iuBU_OM9oAM)! 🤓
ja: format@@0(https://www.youtube.com/c/TheAnKing)がformat@@1(https://youtu.be/iuBU_OM9oAM)!:nerd_face:
ru: [Анкинг](https://www.youtube.com/c/TheAnKing) превзошел нас [новым видео] (https://youtu.be/iuBU_OM9oAM)! 🤓

source: Still happily overwhelmed by the [donations](https://opencollective.com/ankidroid) 💪
ar: لا يزال سعيد بالضغط على [donations](https://opencollective.com/ankidroid) 💪
ja: [donations](https://opencollective.com/ankidroid) 💪

source: Reviewer: Fix mark note keyboard shortcut
ar: مراجع: إصلاح اختصار لوحة مفاتيح علامة
ja: 査読者: マークノートキーボードのショートカットを修正
ru: Исправить ярлык на заметку

source: NoteEditor: Fix to remove padding if removing formatting toolbar
ar: محرر الملاحظة: إصلاح لإزالة الحشوة في حالة إزالة شريط أدوات التنسيق
ja: メモエディタ: フォーマットツールバーを削除する場合、パディングを削除する問題を修正
ru: Редактор заметки: Исправьте удаление отступы при удалении панели инструментов форматирования

source: Previewer: Fix to show same card after edit
ar: المعاين: إصلاح لإظهار نفس البطاقة بعد التعديل
ja: プレビュー: 編集後に同じカードを表示するように修正
ru: Предварительный просмотр: Исправьте отображение той же карты после редактирования

source: Scheduler: Fix v1 scheduler completes deck when only learn cards due
ar: جدولة الجدول: إصلاح v1 يكمل مجموعة عند تعلم البطاقات المستحقة فقط
ja: スケジューラ: v1スケジューラがカードを習得するだけでデッキを完成させるのを修正しました
ru: Планировщик: Планировщик v1 завершает работу пачки, когда только изучать карты

source: Version 2.14.2 (20201202)
ar: الإصدار 2.14.2 (20201202)
ja: バージョン 2.14.2 (20201202)
ru: Версия 2.14.2 (20201202)

source: Wow! We are humbled by the [donations](https://opencollective.com/ankidroid) 🤯
ar: رائع! نحن مرتاحون من قبل [donations](https://opencollective.com/ankidroid) 🤯
ja: Wow! We are humbled by the [donations](https://opencollective.com/ankidroid) :eventing_head:

source: The resources are already going to contributors to improve the app! Thank you ❤️
ar: الموارد ستذهب بالفعل إلى المساهمين لتحسين التطبيق! شكرا لك ❤️
ja: リソースはすでにアプリを改善するために貢献しています! ❤️ ありがとうございます。
ru: Ресурсы уже собираются помочь приложению! Спасибо ❤️

source: Note Editor: Fix image crop not working first time
ar: محرر الملاحظة: إصلاح محصول الصور الذي لا يعمل لأول مرة
ja: 注エディタ: 初めて動作しない画像のトリミングを修正
ru: Редактор заметки: Исправить кадрирование изображения не работает первый раз

source: Note Editor: Paste image at cursor not end
ar: محرر الملاحظة: لصق الصورة في المؤشر لا تنتهي
ja: ノートエディタ: カーソル位置に画像を貼り付け 終わりではありません
ru: Редактор заметки: Вставить изображение в курсор не заканчивается

source: Note Editor: Fix Ctrl+C opens preview
ar: محرر الملاحظة: إصلاح Ctrl+C يفتح المعاينة
ja: ノートエディタ: Fix Ctrl+C open preview
ru: Редактор заметки: Исправить Ctrl+C открывает просмотр

source: Note Editor: Add menubar toggle to disable editing toolbar
ar: محرر الملاحظة: أضف مفتاح تبديل القائمة لتعطيل شريط أدوات التحرير
ja: ノートエディタ: 編集ツールバーを無効にするにはメニューバーの切り替えを追加します
ru: Редактор заметки: Добавить переключатель меню для отключения редактирования панели инструментов

source: Home Screen: Fix Vivo device shortcut creation (again)
ar: الشاشة الرئيسية: إصلاح إنشاء اختصار الجهاز Vivo (مرة أخرى)
ja: ホーム画面: Vivo デバイスのショートカット作成を修正(再度)
ru: Домашний экран: Исправить создание ярлыков на устройстве Vivo (повторно)

source: Reviewer: Fix numeric keypad not working
ar: مراجع: إصلاح لوحة المفاتيح الرقمية التي لا تعمل
ja: 査読者: テンキーが動作しない問題を修正
ru: Рецензент: Исправьте числовую клавиатуру не работает

source: Note Editor: Fix cloze cards going to wrong deck
ar: محرر الملاحظة: إصلاح بطاقات غمس التي ستظهر على مجموعة غير صحيحة
ja: メモエディタ:間違ったデッキに行くカードを修正する
ru: Редактор заметки: Исправьте замыкающие карты, идущие неверно в колоде

source: Navigation Menu: Fix safe display app hang
ar: قائمة التنقل: إصلاح شاشة العرض الآمنة
ja: ナビゲーションメニュー：安全な表示アプリのハングを修正
ru: Меню навигации: Исправьте завис приложений для безопасного отображения

source: Preferences: Fix gestures menu translation / ordering issue
ar: التفضيلات: إصلاح ترجمة قائمة الإيماءات / ترتيب المشكلة
ja: 環境設定: ジェスチャーメニューの翻訳/注文の問題を修正
ru: Предпочтения: Исправить перевод меню жестов / упорядочение задач

source: Translations: thanks [translators!](https://crowdin.com/project/ankidroid/activity_stream) - you can help too!
ar: الترجمات: شكراً [المترجمين!](https://crowdin.com/project/ankidroid/activity_stream) - يمكنك المساعدة أيضًا!
ja: 翻訳: ありがとう format@@0(https://crowdin.com/project/ankidroid/activity_stream) - あなたも助けることができます！
ru: Переводы: спасибо [переводчикам!](https://crowdin.com/project/ankidroid/activity_stream) - вы также можете помочь!

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/39?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/39?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/39?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/39?closed=1)

source: Version 2.14.1 (2020-11-23)
ar: الإصدار 2.14.1 (2020-11-23)
ja: バージョン 2.14.1 (2020-11-23)
ru: Версия 2.14.1 (2020-11-23)

source: Always free, always open source, but you may [donate if you like 😊](https://opencollective.com/ankidroid)
ar: مجانية دائمًا، المصدر مفتوح دائمًا، ولكن قد [تتبرع إذا أعجبك 😊](https://opencollective.com/ankidroid)
ja: 常に無料で、常にオープンソースですが、[😊](https://opencollective.com/ankidroid)
ru: Всегда бесплатно, всегда с открытым исходным кодом, но вы можете [пожертвовать, если вам нравится 😊](https://opencollective.com/ankidroid)

source: Move sync button to right of action bar (vs search)
ar: نقل زر المزامنة إلى يمين شريط العمل (مقابل البحث)
ja: 同期ボタンをアクションバーの右に移動 (対検索)
ru: Переместить кнопку синхронизации справа от панели действий (vs search)

source: Fix duplicate note detection
ar: إصلاح الكشف عن الملاحظات المكررة
ja: 重複したノートの検出を修正
ru: Исправить дублирование заметок

source: Fix add deck shortcut on Vivo devices
ar: إصلاح اختصار إضافة مجموعة على أجهزة Vivo
ja: Vivoデバイスでデッキの追加ショートカットを修正
ru: Исправить ярлык колоды на устройствах Vivo

source: Fix non-translatable 'Card Info' strings
ar: إصلاح السلاسل غير القابلة للترجمة 'معلومات البطاقة '
ja: 翻訳できない「カード情報」文字列を修正
ru: Исправлена непереводимая строка "Информация о карте"

source: Fix suspended card handling in filtered decks
ar: إصلاح معالجة البطاقة المعلقة في الأسطح المصفاة
ja: フィルタリングされたデッキでの一時停止されたカードの処理を修正
ru: Исправлена обработка приостановленных карт в отфильтрованных колодах

source: Sync translations from volunteers on our crowdin.com site (thank you!)
ar: مزامنة الترجمات من المتطوعين على موقع crowdin.com الخاص بنا (شكراً!)
ja: crowdin.comサイトでボランティアの翻訳を同期します（ありがとうございます！）
ru: Синхронизация переводов с волонтеров на нашем сайте crowdin.com (спасибо!)

source: Fix crash on mismatched WebView ABIs
ar: إصلاح الأعطال في WebView ABIs غير متطابقة
ja: 一致しないWebView ABIのクラッシュを修正
ru: Исправлен сбой при несовпадении ABI WebView

source: Fix crash invalid filename handling while pasting image
ar: إصلاح معالجة اسم الملف غير صالح أثناء لصق الصورة
ja: 画像の貼り付け中にクラッシュ無効なファイル名処理を修正
ru: Исправлена ошибка обработки имени файла при вставке изображения

source: Fix crash selecting cards in card browser
ar: إصلاح تحديد البطاقات في متصفح البطاقة
ja: カードブラウザでカードを選択してクラッシュする問題を修正
ru: Исправлена ошибка выбора карт в браузере карты

source: Fix crash Android 8 in card browser
ar: إصلاح اندرويد 8 في متصفح البطاقة
ja: Android 8クラッシュをカードブラウザで修正
ru: Исправлен сбой Android 8 в браузере карты

source: Fix crash in undo labeling
ar: إصلاح الأعطال في وضع العلامات التراجعية
ja: 元に戻すラベル付けでクラッシュを修正
ru: Исправлена ошибка в отмене меток

source: Fix crash reset password when system browser not exported
ar: إصلاح تعطيل إعادة تعيين كلمة المرور عندما لا يتم تصدير متصفح النظام
ja: システムブラウザがエクスポートされないときにクラッシュリセットパスワードを修正しました。
ru: Исправлен сброс пароля, когда системный браузер не экспортирован

source: [Full Changelog here](https://github.com/ankidroid/Anki-Android/milestone/38?closed=1)
ar: [تغيير كامل هنا](https://github.com/ankidroid/Anki-Android/milestone/38?closed=1)
ja: format@@0(https://github.com/ankidroid/Anki-Android/milestone/38?closed=1)
ru: [Полный список изменений](https://github.com/ankidroid/Anki-Android/milestone/38?closed=1)

source: Version 2.14.0 (2020-11-18)
ar: الإصدار 2.14.0 (2020-11-18)
ja: バージョン 2.14.0 (2020-11-18)
ru: Версия 2.14.0 (2020-11-18)

source: Enabled Donations - we ❤️ you, [now you can ❤️ us 😊](https://opencollective.com/ankidroid)
ar: تمكين التبرعات - نحن ❤️ أنت [الآن يمكنك ❤️ نحن 😊](https://opencollective.com/ankidroid)
ru: Включен вклад - мы ❤️ вы, [теперь вы можете ❤️ нас 😊](https://opencollective.com/ankidroid)

source: New Screen: Card Info (from Card Browser or as a Reviewer App Bar Button)
ar: شاشة جديدة: معلومات البطاقة (من متصفح البطاقة أو كزر شريط التطبيقات للمراجعة)
ja: 新しい画面:カード情報(カードブラウザまたはレビューアアプリバーボタンから)
ru: Новый экран: информация о карте (из карт-браузера или в качестве кнопки панели обзора)

source: New Screen: Help - easy access to manual, many community pages/manuals, donation page, translations
ar: شاشة جديدة: مساعدة- سهولة الوصول إلى اليدوي, العديد من صفحات المجتمع/الأدوات, صفحة التبرع, الترجمات
ja: 新しい画面: ヘルプ - マニュアル、多くのコミュニティページ/マニュアル、寄付ページ、翻訳
ru: Новый экран: Помощь - простой доступ к руководству, много страниц сообщества/руководств, страница пожертвования, перевод

source: Home screen: Add deck shortcut
ar: الشاشة الرئيسية: إضافة اختصار لمجموعة
ja: ホーム画面: デッキのショートカットを追加
ru: Домашний экран: Добавить ярлык колоды

source: Deck Options: SchedV2: Support setting "Hard Factor"
ar: خيارات المجموعة: SchedV2: إعداد الدعم "عامل صلب"
ja: Deck Options: SchedV2: 「Hard Factor」の設定に対応
ru: Опции колоды: SchedV2: Поддержка установки "Фактор на труднодоступных условиях"

source: Card Browser: Add deck filtering
ar: متصفح البطاقة: إضافة تصفية مجموعة
ja: カードブラウザ: デッキのフィルタリングを追加
ru: Обозреватель карт: Добавить фильтрацию колоды

source: Card Browser: Filter By Flag
ar: متصفح البطاقة: تصفية حسب العلم
ja: カードブラウザ: フラグでフィルター
ru: Браузер карт: Фильтр по флагу

source: Card Browser: Adding cards defaults to selected deck
ar: متصفح البطاقة: إضافة بطاقات افتراضية إلى مجموعة مختارة
ja: カードブラウザ: 選択したデッキにカードを追加する
ru: Браузер карт: Добавление карт по умолчанию в выбранную колоду

source: Card Browser: Many more keyboard shortcuts
ar: متصفح البطاقة: العديد من اختصارات لوحة المفاتيح
ja: カードブラウザー: キーボードショートカット
ru: Карточный браузер: гораздо больше горячих клавиш

source: Card Browser: Display the number of cards deleted when deleting a note
ar: مستعرض البطاقة: عرض عدد البطاقات المحذوفة عند حذف ملاحظة
ja: カードブラウザ: ノート削除時に削除されたカードの数を表示します。
ru: Обозреватель карт: Показывать количество карт, удаляемых при удалении заметки

source: Card Browser: Better handling of deck searches containing wildcards
ar: متصفح البطاقة: مناولة أفضل لعمليات البحث على سطح السفينة التي تحتوي على بطاقات برية
ja: カードブラウザ：ワイルドカードを含むデッキ検索の処理を改善
ru: Обозреватель карт: лучше обрабатывать поиски колоды, содержащие шаблоны

source: Reviewer: Basic Android TV Support
ar: المراجعة: دعم تلفاز الأندرويد الأساسي
ja: 査読者: Basic Android TV Support
ru: Рецензент: Базовая поддержка Android TV

source: Reviewer: New Gesture: Abort Learning & Sync
ar: المراجعة: نظرة جديدة: إلغاء التعلم والمزامنة
ja: 査読者: 新しいジェスチャー: 学習と同期を中止する
ru: Рецензент: Новое Жест: Прервать Обучение и Синхронизировать

source: Reviewer: Support AnkiMobile 9-area gesture touch layout
ar: المراجع: دعم تصميم لفتة أنكيموبايل 9 مناطق
ja: レビュー: AnkiMobile 9エリアジェスチャーのレイアウトをサポート
ru: Рецензент: Поддержка жестов области AnkiMobile 9

source: Reviewer: Improve "Empty Card" UX
ar: المراجعة: تحسين "بطاقة فارغة" UX
ja: 査読者: "空のカード" UX の改善
ru: Рецензент: Улучшение UX карты

source: Reviewer: Keyboard shortcuts for flags (Ctrl+1...4)
ar: مراجعة: اختصارات لوحة المفاتيح للأعلام (Ctrl+1...4)
ja: レビュー: フラグのキーボードショートカット (Ctrl+1...4)
ru: Обозреватель: клавиатурные сочетания для флагов (Ctrl+1...4)

source: Note Editor: Editor Toolbar (& keyboard shortcuts) - hugely requested feature!
ar: محرر الملاحظة: شريط أدوات المحرر (واختصارات لوحة المفاتيح) - خاصية مطلوبة بشكل كبير!
ja: メモエディタ:エディタツールバー(&キーボードショートカット) - 非常に要求された機能!
ru: Примечание. Редактор: Панель инструментов редактора (и сочетания клавиш) - огромно запрошенная возможность!
