Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: The USB method works by importing or exporting all your decks at once. This means that unlike syncing via AnkiWeb, you can't make changes from two locations at once and then merge them. Instead, if you wish to add cards on the desktop, you need to make sure you export the latest version of your collection from your mobile device first, or you'll end up losing any reviews done on the mobile device.
ar: تعمل طريقة USB عن طريق استيراد أو تصدير جميع طوابقك في وقت واحد. وهذا يعني أنه خلافا للمزامنة عبر AnkiWeb، لا يمكنك إجراء تغييرات من موقعين في وقت واحد ثم دمجهما. بدلاً من ذلك، إذا كنت ترغب في إضافة بطاقات على سطح المكتب، تحتاج إلى التأكد من تصدير أحدث إصدار من مجموعتك من جهازك المحمول أولا، أو ستفقد في نهاية المطاف أي مراجعات أجريت على الجهاز المحمول.
ja: USBメソッドは、一度にすべてのデッキをインポートまたはエクスポートすることによって動作します。 これは、AnkiWeb経由の同期とは異なり、2つの場所から一度に変更を加えてマージすることはできないことを意味します。 代わりに、デスクトップにカードを追加したい場合。 コレクションの最新バージョンをモバイルデバイスから最初にエクスポートする必要があります あるいはモバイルデバイスで行われたレビューを失うことになります
ru: Метод USB работает при импорте или экспорте всех палуб одновременно. Это означает, что в отличие от синхронизации через AnkiWeb, вы не можете вносить изменения из двух точек одновременно, а затем объединять их. Вместо этого, если вы хотите добавить карты на рабочий стол, сначала убедитесь, что вы экспортировали последнюю версию вашей коллекции с вашего мобильного устройства или вы потеряете все рецензии, сделанные на мобильном устройстве.

source: Thus the workflow you would typically use is to export your collection from your mobile device and import it into the desktop, make modifications on the desktop, and then export your collection and import it back into your mobile device.
ar: وبالتالي فإن سير العمل الذي تستخدمه عادة هو تصدير مجموعتك من جهازك المحمول واستيرادها إلى سطح المكتب، قم بإدخال تعديلات على سطح المكتب، ثم قم بتصدير مجموعتك واستيرادها مرة أخرى إلى جهازك المحمول.
ja: したがって、通常使用するワークフローは、モバイルデバイスからコレクションをエクスポートし、デスクトップにインポートすることです。 デスクトップを変更し、コレクションをエクスポートしてモバイルデバイスにインポートします。
ru: Таким образом, вы обычно используете рабочий процесс - это экспорт вашей коллекции с вашего мобильного устройства и импорт ее в рабочий стол, сделайте изменения на рабочем столе, а затем экспортируйте свою коллекцию и импортируйте ее обратно в мобильное устройство.

source: AnkiDroid can't directly import text files. If you wish to do that, you'll need to do that with the desktop program, and then import your collection into AnkiDroid.
ar: لا يستطيع AnkiDroid استيراد الملفات النصية مباشرة. إذا كنت ترغب في القيام بذلك، ستحتاج إلى القيام بذلك مع برنامج الكمبيوتر المكتبي، ثم قم باستيراد مجموعتك إلى أنكيدرويد.
ja: AnkiDroidはテキストファイルを直接インポートできません。 それを行いたい場合は、デスクトッププログラムで行い、コレクションをAnkiDroidにインポートする必要があります。
ru: AnkiDroid не может импортировать текстовые файлы напрямую. Если вы хотите сделать это, вам нужно сделать это с помощью программы рабочего стола, а затем импортировать вашу коллекцию в AnkiDroid.

source: Copy all decks from Anki Desktop to AnkiDroid via USB
ar: نسخ جميع الطواقم من سطح المكتب أنكي إلى أنكيدرويد عبر USB
ja: USB経由でAnkiDesktopからAnkiDroidにすべてのデッキをコピー
ru: Скопировать все колоды с Anki Desktop на AnkiDroid через USB

source: On your computer:
ar: على الكمبيوتر الخاص بك:
ja: お使いのコンピューター上:
ru: На вашем компьютере:

source: Open the desktop program.
ar: افتح برنامج سطح المكتب.
ja: デスクトッププログラムを開きます。
ru: Откройте программу для рабочего стола.

source: Choose File>Export from the menu.
ar: اختر ملف/تصدير من القائمة.
ja: メニューからファイル>エクスポートを選択します。
ru: В меню выберем Файл>Экспорт.

source: Click the **Export...** button. Make sure to leave **all decks** selected, as it's not possible to import individual decks into AnkiDroid. **Include scheduling information** must also remain checked.
ar: انقر فوق الزر **تصدير...**. تأكد من ترك **جميع المجموعات** المحددة، حيث أنه من غير الممكن استيراد فرقات فردية إلى أنكيدرويد. **تضمين معلومات الجدولة** يجب أن يظل التحقق أيضا.
ja: **エクスポート...**ボタンをクリックします。個々のデッキをAnkiDroidにインポートすることはできませんので、**すべてのデッキ**を選択したままにしてください。 **スケジュール情報を含める**もチェックしておく必要があります。
ru: Нажмите на **Экспорт...**. Не забудьте оставить **все колоды** выбранной, так как невозможно импортировать отдельные колоды в AnkiDroid. **Включите информацию о планировании** также необходимо проверить.

source: Anki will automatically create a collection.apkg on your desktop. If the file is named something else, please see the previous step again.
ar: سيقوم أنكي تلقائيًا بإنشاء collection.apkg على سطح المكتب الخاص بك. إذا تم تسمية الملف بشيء آخر، يرجى مشاهدة الخطوة السابقة مرة أخرى.
ja: Ankiはデスクトップ上に自動的にcollection.apkgを作成します。ファイル名が他のものの場合は、前の手順をもう一度確認してください。
ru: Anki автоматически создаст collection.apkg на вашем рабочем столе. Если файл назван еще что-то, пожалуйста, посмотрите на предыдущий шаг снова.

source: Connect your Android device to your computer via the USB cable.
ar: قم بتوصيل جهاز الأندرويد الخاص بك بجهاز الكمبيوتر الخاص بك عن طريق كابل USB.
ja: USBケーブルを介してAndroidデバイスをコンピュータに接続します。
ru: Подключите Android-устройство к компьютеру через кабель USB.

source: Open the file explorer on your computer and view the contents of your Android device.
ar: افتح مستكشف الملفات على جهاز الكمبيوتر الخاص بك وعرض محتويات جهاز الأندرويد الخاص بك.
ja: コンピュータ上のファイルエクスプローラを開き、Androidデバイスの内容を表示します。
ru: Откройте обозреватель файлов на вашем компьютере и просмотрите содержимое вашего Android-устройства.

source: Locate the AnkiDroid folder.
ar: حدد موقع مجلد AnkiDroid.
ja: AnkiDroidフォルダを探します。
ru: Найдите папку AnkiDroid.

source: Drag the collection.apkg file from your desktop into this AnkiDroid folder.
ar: اسحب ملف collection.apkg من سطح المكتب الخاص بك إلى مجلد AnkiDroid.
ja: このAnkiDroidフォルダにデスクトップからcollection.apkgファイルをドラッグします。
ru: Перетащите файл collection.apkg с рабочего стола в эту папку AnkiDroid.

source: Then in AnkiDroid:
ar: ثم في أنكيدرويد:
ja: AnkiDroidで次のようにします。
ru: Затем в AnkiDroid:

source: From the main decks screen, tap **Import file** from the menu
ar: من شاشة المجموعات الرئيسية، انقر فوق **استيراد الملف** من القائمة
ja: メインのデッキ画面で、メニューから**ファイルをインポート**をタップします
ru: На главном экране колод нажмите **Импорт файла** из меню

source: Tap on **Collection** and then confirm
ar: اضغط على **المجموعة** ثم أكّد
ja: **コレクション**をタップして確認してください
ru: Нажмите на **Коллекцию** и подтвердите

source: Once complete, the decks on your device will have been replaced with the decks from your desktop. See the section on [importing apkg files](importing/importing-anki-files.md) for more help with importing.
ar: بمجرد اكتماله، سيتم استبدال طواقم الجهاز على جهازك بمجموعات من سطح المكتب. انظر الجزء الخاص بـ [استيراد ملفات apkg](Importing/importing-anki-files.md) لمزيد من المساعدة في الاستيراد.
ja: 完了すると、デバイス上のデッキはデスクトップからデッキに置き換えられます。 インポートについては、format@@0(importing-anki-files.md) のセクションを参照してください。
ru: После завершения колоды на вашем устройстве будут заменены колодами с вашего рабочего стола. Смотрите раздел [импорта apkg файлов](importing/importing-anki-files.md) для получения дополнительной помощи с импортом.

source: Copy all decks from AnkiDroid to Anki Desktop via USB
ar: نسخ جميع الطواقم من AnkiDroid إلى سطح المكتب أنكي عبر USB
ja: USB経由でAnkiDroidからAnkiデスクトップにすべてのデッキをコピー
ru: Скопировать все колоды с AnkiDroid на Anki Desktop через USB

source: The process to copy your decks from AnkiDroid to Anki Desktop is essentially the same as above, but in reverse.
ar: عملية نسخ أسقفك من أنكيدرويد إلى أنكي سطح المكتب هي في الأساس نفس ما ورد أعلاه، ولكن العكس.
ja: AnkiDroidからAnkiデスクトップにデッキをコピーするプロセスは、基本的に上記と同じですが、逆です。
ru: Процесс копирования колод из AnkiDroid в Anki Desktop по сути такой же, как и выше, но наоборот.

source: Start with your device disconnected from USB
ar: ابدأ باستخدام جهازك غير متصل من USB
ja: USBに接続されていない端末で開始
ru: Начать с отключения устройства от USB

source: Choose **Export collection** from the main menu in the Deck Screen
ar: اختر **تصدير المجموعة** من القائمة الرئيسية في شاشة المجموعة
ja: デッキ画面のメインメニューから**コレクションをエクスポート**を選択してください
ru: Выберите **Экспорт коллекции** в главном меню на экране колоды

source: Ensure **Include scheduling information** remains checked and press **OK**
ar: تأكد من أن **تضمين معلومات الجدولة** لا يزال متأكدا واضغط على **موافق**
ja: **スケジューリング情報を含める**がチェックされたまま**OK**を押してください。
ru: Убедитесь, что **Включение информации о планировании** остается отмеченным и нажмите **OK**

source: Connect device to computer using USB
ar: توصيل الجهاز بالكمبيوتر باستخدام USB
ja: USBを使用してデバイスをコンピュータに接続します
ru: Подключите устройство к компьютеру с помощью USB

source: Copy the **collection.apkg** from the path specified in the message to the desktop on your computer
ar: نسخ **collection.apkg** من المسار المحدد في الرسالة إلى سطح المكتب على الكمبيوتر الخاص بك
ja: メッセージで指定されたパスから **collection.apkg** をコンピュータのデスクトップにコピーします
ru: Скопируйте **collection.apkg** из указанного пути на рабочий стол на вашем компьютере

source: Double click on the file to import into Anki Desktop
ar: انقر نقراً مزدوجاً على الملف لاستيراده إلى سطح المكتب أنكي
ja: Anki Desktopにインポートするファイルをダブルクリックします。
ru: Дважды нажмите на файл, чтобы импортировать его в Anki Desktop

source: See the [exporting section](exporting.md) below for more detailed information on exporting from AnkiDroid.
ar: انظر [قسم التصدير] (exporting.md) أدناه للحصول على معلومات أكثر تفصيلا عن التصدير من أنكيدرويد.
ja: AnkiDroidからのエクスポートの詳細については、以下のformat@@0(exporting.md)を参照してください。
ru: Смотрите [секцию экспорта](exporting.md) ниже для получения более подробной информации об экспорте из AnkiDroid.

source: [MathJax Support](mathjax.md)
ar: [دعم MathJax] (mathjax.md)
ja: format@@0(mathjax.md)
ru: [Поддержка MathJax ](mathjax.md)

source: [Reverse Cards](reverse-cards.md)
ar: [البطاقات العكسية](reverse-cards.md)
ja: format@@0(逆カード.md)
ru: [Обратные карты](reverse-cards.md)

source: [Custom Fonts](custom-fonts.md)
ar: [خطوط مخصصة](custom-fonts.md)
ja: format@@0(custom-fonts.md)
ru: [Пользовательские шрифты](custom-fonts.md)

source: [Custom Card Layout](customizing-card-layout.md)
ar: [تخطيط بطاقة مخصصة](تخصيص بطاقة - layout.md)
ja: format@@0(customizing-card-layout.md)
ru: [Пользовательский макет карты](customizing-card-layout.md)

source: [Type in the answer feature](type-in-answer.md)
ar: [اكتب في ميزة الإجابة] (type-in-answer.md)
ja: format@@0(type-in-answer.md)
ru: [Введите функцию ответа](type-in-answer.md)

source: [Advanced Statistics](advanced-statistics.md)
ar: [إحصاءات متقدمة] (المتقدمة-statistics.md)
ja: format@@0(advanced-statistics.md)
ru: [Расширенная статистика](advanced-statistics.md)

source: [Reminders](reminders.md)
ar: [Reminders](التذكير.md)
ja: [Reminders](リマインダー.md)
ru: [Reminders](напоминания)

source: [Automatic Language Selection](set-language-hint.md)
ar: [اختيار اللغة التلقائية](set-language-hint.md)
ja: format@@0(set-language-hint.md)
ru: [Автоматическое выделение языка](set-language-hint.md)

source: Mathjax is a modern typesetting library for math and chemistry. AnkiDroid supports Mathjax cards out of the box. Mathjax is configured to expect TeX formatting, with `\(` and `\)` delimiting inline equations and `\[` and `\]` for display equations.
ar: Mathjax هي مكتبة حديثة لضبط الطباعة للرياضيات والكيمياء. AnkiDroid يدعم بطاقات Mathjax خارج الصندوق. تم تكوين Mathjax لتوقع تنسيق تيكس، مع '\(' و '\)' تعيين المعادلات الواردة و '\[' و '\]' لعرض المعادلات.
ja: Mathjaxは数学と化学のためのモダンな組版ライブラリです。AnkiDroidはMathjaxカードをすぐにサポートしています。 Mathjaxは、インライン方程式を区切る`\(`と`\)`と表示方程式を表示する`\[`と`\]`でTeXのフォーマットを期待するように設定されています。
ru: Mathjax - это современная типографическая библиотека для математики и химии. AnkiDroid поддерживает Mathjax карты из коробки. Mathjax настроен на ожидание форматирования TeX с разделителем `\(` и `\)` и `\)` уравнений inline и `\[` и `\]` для отображения уравнений.

source: To try it out, enter the following into a field:
ar: لتجربتها ، أدخل ما يلي في الحقل:
ja: 試してみるには、以下のフィールドを入力します。
ru: Чтобы попробовать, введите в поле следующее:

source: and preview the card.
ar: و معاينة البطاقة.
ja: をクリックし、カードをプレビューします。
ru: и просмотреть карту.

source: For more details, see [Mathjax Support](https://docs.ankiweb.net/math.html#mathjax) in the Anki Manual.
ar: لمزيد من التفاصيل، انظر [Mathjax Support](https://docs.ankiweb.net/math.html#mathjax) في Anki Manual.
ja: 詳細については、Anki Manualの[Mathjax Support](https://docs.ankiweb.net/math.html#mathjax)を参照してください。
ru: Подробнее см. в [Mathjax Support](https://docs.ankiweb.net/math.html#mathjax) в Анки Manual.

source: [Previous workarounds](https://www.reddit.com/r/Anki/comments/ar7lxd/how_to_load_mathjax_color_extension_on_anki/egm6u5j) are no longer necessary as of AnkiDroid 2.9.
ar: [الأعمال السابقة](https://www.reddit.com/r/Anki/comments/ar7lxd/how_to_load_mathjax_color_extension_on_anki/egm6u5j) لم تعد ضرورية اعتبارا من AnkiDroid 2.9.
ja: format@@0(https://www.reddit.com/r/Anki/comments/ar7lxd/how_load_mathjax_color_extension_on_anki/egm6u5j)はAnkiDroid2.9以降は不要になりました。
ru: [Предыдущие работы](https://www.reddit.com/r/Anki/comments/ar7lxd/how_to_load_mathjax_color_extension_on_anki/egm6u5j) больше не требуется для AnkiDroid 2.9.

source: The Anki system has [built-in note types which allow you to review cards in both directions](https://docs.ankiweb.net/getting-started.html#note-types). When [creating new material](../adding-notes.md) in AnkiDroid, you should choose one of these note types, such as **Basic (and reversed card)**, which will automatically generate a reverse card for you.
ar: نظام أنكي يحتوي على [أنواع الملاحظات المدمجة التي تسمح لك بمراجعة البطاقات في كلا الاتجاهين] (https://docs.ankiweb.net/getting-started.html#note-types). عند [إنشاء مواد جديدة] (. /إضافة ملاحظات. (د) في AnkiDroid، يجب عليك اختيار أحد أنواع المذكرات هذه، مثل **البطاقة الأساسية (والبطاقة المعكوسة)**، والذي سيقوم تلقائياً بإنشاء بطاقة عكسية لك.
ja: Anki システムには、format@@0(https://docs.ankiweb.net/getting-started.html#note-types) があります。format@@1(https://docs.ankiweb.net/getting-started.html#note-types) 。 /adding-notes d) AnkiDroidでは、**Basic (と逆カード)**のようなノートタイプを選択してください。 自動的にリバースカードが生成されます
ru: Система Anki имеет [встроенные типы заметок, которые позволяют вам просматривать карты в обоих направлениях](https://docs.ankiweb.net/getting-started.html#note-types). При [создании нового материала](. /adding-notes. d) в AnkiDroid, вы должны выбрать один из этих типов записей, таких как **Basic (и обратная карта)**, которая автоматически создаст обратную карту для Вас.

source: If you used the wrong note type when adding your material, you can change the note type via the [edit note screen](../editing-notes.md), or you can change the note type for multiple cards at once using the browser in Anki Desktop. To do this, follow the instructions in the [syncing with Anki Desktop section](../anki-desktop.md), then in Anki Desktop open the browser, select the cards you want to change, then choose **Change note type** from the menu.
ar: إذا كنت تستخدم نوع الملاحظة الخطأ عند إضافة المواد الخاصة بك، يمكنك تغيير نوع الملاحظة عن طريق [تحرير شاشة الملاحظة](. /editing-notes.md)، أو يمكنك تغيير نوع الملاحظة لبطاقات متعددة مرة واحدة باستخدام المتصفح في سطح المكتب في أنكي. للقيام بذلك، اتبع التعليمات في [المزامنة مع قسم سطح المكتب أنكي] (../anki-officktop). d)، ثم في أنكي سطح المكتب فتح المتصفح، حدد البطاقات التي تريد تغييرها، ثم اختر **تغيير نوع الملاحظة** من القائمة.
ja: 素材を追加する際に間違ったノートタイプを使用した場合は、format@@0()でノートタイプを変更できます。 /editing-notes.md)、またはAnki Desktopのブラウザを使用して、複数のカードのノートタイプを一度に変更できます。 これを行うには、format@@0(../anki-desktop)の指示に従ってください。 d)、Anki Desktopでブラウザを開き、変更したいカードを選択し、メニューから**ノートタイプを変更**を選択します。
ru: Если вы использовали неправильный тип заметки при добавлении материала, вы можете изменить тип заметки через окно [редактировать заметку](. /editing-notes.md), или вы можете изменить тип заметки для нескольких карт сразу с помощью браузера в Anki Desktop. Для этого следуйте инструкциям в [синхронизации с секцией Anki Desktop](../anki-desktop. d), затем в Anki Desktop откройте браузер, выберите карты, которые вы хотите изменить, а затем выберите **Изменить тип записи** в меню.

source: Alternatively, if your cards are using a custom card layout which doesn't include a reverse card, you can edit the note type to include a reverse card by following the instructions in the [reverse cards section](https://docs.ankiweb.net/templates/generation.html#reverse-cards) of the Anki Desktop user manual. While less convenient than using Anki Desktop, it is possible to edit the note type from directly within AnkiDroid as well; see the [custom card layout section](../advanced-features/customizing-card-layout.md) for more on this.
ar: بدلاً من ذلك، إذا كانت بطاقاتك تستخدم تخطيط بطاقة مخصصة لا تتضمن بطاقة عكسية، يمكنك تعديل نوع الملاحظة لتضمين بطاقة عكسية باتباع التعليمات في [قسم البطاقات العكسية](https://docs. nkiweb.net/templates/generation. tml#reverse se-cards) من دليل مستخدم سطح المكتب في أنكي. مع أن استخدام سطح المكتب أنكي أقل ملاءمة، فإنه من الممكن تعديل نوع الملاحظة من داخل AnkiDroid أيضا؛ انظر [قسم تخطيط بطاقة مخصصة](. /Advced-features/customizing-card-layout.md) للمزيد حول هذا.
ja: または、カードにリバースカードが含まれないカスタムカードレイアウトを使用している場合。 format@@0(https://docs) の説明に従って、ノートタイプを編集してリバースカードを含めることができます。 nkiweb.net/templates/generation. Anki Desktopユーザーマニュアルのtml#reverse-cards)。 Anki Desktopよりも便利ではありませんが、AnkiDroid内から直接ノートタイプを編集することもできます。 format@@0をご覧ください。 詳細は/advanced-features/customizing-card-layout.md)
ru: Кроме того, если ваши карты используют пользовательскую карту, которая не включает обратную карту, вы можете отредактировать тип записи, чтобы включить обратную карту, следуя инструкциям в разделе [обратные карты](https://docs. nkiweb.net/templates/generation. tml#обратные карты) руководства пользователя Anki Desktop. Хотя Anki Desktop, менее удобен, чем использование Anki Desktop, можно редактировать и тип заметок прямо из AnkiDroid; смотрите [секцию макета пользовательской карты](. /advanced-features/customizing-card-layout.md) для более подробной информации.

source: AnkiDroid allows you to use non-system fonts on your cards. To set them up properly, it is strongly recommended to use the official method that is used by Anki Desktop. Please see [the corresponding section in the desktop manual](https://docs.ankiweb.net/templates/styling.html#installing-fonts) for more information.
ar: يسمح لك AnkiDroid باستخدام الخطوط غير النظامية على بطاقاتك. ولكي يتم إعدادها على نحو سليم، يوصى بشدة باستخدام الطريقة الرسمية التي تستخدمها حاسوب أنكي المكتبي. يرجى الاطلاع على [القسم المقابل في دليل سطح المكتب] (https://docs.ankiweb.net/templates/styling.html#installing-fonts) للمزيد من المعلومات.
ja: AnkiDroidでは、システム以外のフォントをカードに使用できます。 それらを適切に設定するには、Anki Desktopで使用される公式の方法を使用することを強くお勧めします。 詳細については、format@@0(https://docs.ankiweb.net/templates/styling.html#installing-fonts)を参照してください。
ru: AnkiDroid позволяет использовать несистемные шрифты на картах. Для их правильной настройки настоятельно рекомендуется использовать официальный метод, используемый Anki Desktop. [соответствующий раздел в инструкции для рабочего стола](https://docs.ankiweb.net/templates/styling.html#installing-fonts) для получения дополнительной информации.

source: Alternatively, you can create a new subfolder **fonts** in the main AnkiDroid directory (i.e. the folder which contains the **backups** subfolder, specified under `Settings > Advanced > AnkiDroid directory)`, copy a compatible font file (i.e. .ttf) there, and then set this as the default font under `Settings > Fonts > Default font`.
ar: بدلاً من ذلك، يمكنك إنشاء مجلد فرعي جديد **خطوط** في دليل أنكيدرويد الرئيسي (أي المجلد الذي يحتوي على مجلد فرعي **النسخ الاحتياطية**، المحدد تحت `الإعدادات > المتقدمة > دليل AnkiDroid)`، انسخ ملف خط متوافق (i. .ttf) هناك، ثم عيّن هذا كخط افتراضي تحت `الإعدادات> الخطوط > الخط الافتراضي`.
ja: または、AnkiDroidのメインディレクトリに新しいサブフォルダ**フォント**を作成することもできます。 `Settings > Advanced > AnkiDroid ディレクトリで指定された **backups** サブフォルダを含むフォルダです。互換性のあるフォントファイルをコピーします (i. をクリックします。 .ttf) をクリックし、`Settings > Fonts > Default font` の下にあるデフォルトのフォントとして設定します。
ru: Кроме того, вы можете создать новую подпапку **fonts** в главной директории AnkiDroid (т.е. папка, в которой содержится **бэкап** подпапка, указанная в папке `Settings > Advanced > AnkiDroid)`, копирует совместимый шрифт файл (i). . .ttf) там, а затем установить шрифт по умолчанию в папке `Settings > Fonts > Default font`.

source: **Note:** this method will change the default font for **all** of your cards, whereas the official method can be more specific. Also, if you sync with AnkiWeb, using this method will lead to cards being displayed differently on different devices.
ar: **ملاحظة:** ستغير هذه الطريقة الخط الافتراضي لـ **جميع** بطاقاتك، بينما يمكن أن تكون الطريقة الرسمية أكثر تحديدا. أيضًا إذا قمت بالمزامنة مع AnkiWeb، سيؤدي استخدام هذه الطريقة إلى عرض بطاقات بشكل مختلف على أجهزة مختلفة.
ja: **注意:** このメソッドはあなたのカードの **すべて** の既定のフォントを変更しますが、公式のメソッドはより具体的になります。 また、AnkiWebと同期した場合、この方法を使用すると、異なるデバイスで異なるカードが表示されます。
ru: **Обратите внимание:** этот метод изменит шрифт по умолчанию **все** ваших карт, а официальный метод может быть более конкретным. Также, при синхронизации с AnkiWeb, этот метод приведет к тому, что карты будут отображаться по-разному на разных устройствах.

source: Only fonts in the ttf format are officially supported in Anki/AnkiDroid; the [Google Noto](https://fonts.google.com/noto) font set is highly recommended for all languages, and some other free fonts can be found [here](https://github.com/ankidroid/Anki-Android/wiki/Freely-distributable-fonts).
ar: فقط الخطوط في تنسيق ttf مدعومة رسميا في Anki/AnkiDroid; [Google Noto](https://fonts.google. om/noto) الخط موصى به بشدة لجميع اللغات، ويمكن العثور على بعض الخطوط المجانية الأخرى [here](https://github.com/ankidroid/Anki-Android/wiki/Freely-distributable-fonts).
ja: format@@0(https://fonts.google) では、TTF 形式のフォントのみが公式にサポートされています。 om/notoのフォントセットはすべての言語で強く推奨されており、その他いくつかの無料フォントは [here](https://github.com/ankidroid/Anki-Android/wiki/Freely-distributable-fonts)で見つけることができます。
ru: Только шрифты в формате ttf официально поддерживаются в Anki/AnkiDroid; [Google Noto](https://fonts.google. om/noto) набор шрифтов настоятельно рекомендуется для всех языков, а некоторые другие бесплатные шрифты могут быть найдены [here](https://github.com/ankidroid/Anki-Android/wiki/Freely-distributable-fonts).

source: Please note that AnkiDroid has to load the entire font into memory in order to use it, and fonts for Asian languages can be quite large. If you have an older device and notice AnkiDroid crashing frequently after installing a font, you may have exceeded your device's memory limits. For Google Noto, it's not recommended to use the combined CJK font, rather get the individual languages [separately from here](https://github.com/googlei18n/noto-cjk).
ar: يرجى ملاحظة أنه يجب على أنكيدرويد تحميل الخط بأكمله في الذاكرة من أجل استخدامه، والخطوط للغات الآسيوية يمكن أن تكون كبيرة جداً. إذا كان لديك جهاز قديم وتلاحظ تحطم أنكيدرويد بشكل متكرر بعد تثبيت خط، ربما تكون قد تجاوزت حدود ذاكرة جهازك. بالنسبة لـ Google Noto، ليس من المستحسن استخدام خط CJK الموحد، بدلاً من الحصول على اللغات الفردية [منفصلة عنها](https://github.com/googlei18n/noto-cjk).
ja: AnkiDroidはフォント全体をメモリに読み込んで使用する必要があります。 アジア諸言語用のフォントはかなり大きくなります。 フォントをインストールした後にAnkiDroidが頻繁にクラッシュすることに気づいた場合は、デバイスのメモリ制限を超えている可能性があります。 Google Notoでは、CJKフォントを組み合わせて使用することは推奨されません。format@@0(https://github.com/googlei18n/noto-cjk)で個々の言語を取得してください。
ru: Пожалуйста, обратите внимание, что AnkiDroid должен загрузить весь шрифт в память для его использования, и шрифты для азиатских языков могут быть довольно большими. Если у вас есть старая консоль и вы замечаете, что AnkiDroid часто облекает после установки шрифта, возможно, вы превысили лимит памяти вашего устройства. Для Google Noto, не рекомендуется использовать комбинированный шрифт CJK, а вместо этого получать индивидуальные языки [отдельно отсюда](https://github.com/googlei18n/noto-cjk).
