Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: The circular button with arrows on the right is for synchronizing your cards with the cloud, as described in the [adding decks from cloud](anki-desktop.md#using-anki-desktop-with-ankidroid) section.
ar: الزر الدائري مع الأسهم على اليمين هو لمزامنة بطاقتك مع السحابة، كما هو مبين في قسم [إضافة أسطح من السحابة] (anki-desktop.md#using-anki-desktop-with-ankidroid).
ja: 右側の矢印が付いた円形のボタンは、format@@0(anki-desktop.md#using-anki-desktop-with-ankidroid) セクションで説明されているように、クラウドとカードを同期させるためのものです。
ru: Круговая кнопка со стрелками справа предназначена для синхронизации ваших карт с облаком, как описано в разделе [добавления колод из облака](anki-desktop.md#using-anki-desktop-with-ankidroid).

source: Overflow menu button
ar: زر قائمة تجاوز التدفق
ja: オーバーフローメニューボタン
ru: Кнопка меню переполнения

source: On the far right is the overflow menu which contains less commonly used actions. These actions are described further below.
ar: وعلى اليمين المتطرف توجد قائمة احتياطية تحتوي على إجراءات أقل شيوعا.
ja: 右端には、あまり一般的に使用されていないアクションを含むオーバーフローメニューがあります. これらのアクションは、さらに下に説明されています.
ru: В крайнем правом углу находится меню переполнения, которое содержит менее часто используемые действия. Эти действия описаны ниже.

source: **Hint:** long tapping on a button in the app bar anywhere in the app will display a textual hint describing what the button does!
ar: **تلميح:** الضغط لفترة طويلة على زر في شريط التطبيق في أي مكان في التطبيق سيعرض تلميحا نصيا يصف ما يفعله الزر!
ja: **ヒント：** アプリバー内のボタンを長押しすると、ボタンの動きを説明するテキストヒントが表示されます！
ru: **Подсказка:** Долгое нажатие на кнопку в панели приложений в любом месте будет показывать текстовую подсказку, описывающую что делает кнопка!

source: Studying a Deck
ar: دراسة مجموعة
ja: デッキの勉強中
ru: Изучение колоды

source: To study the cards in a deck, simply tap on the deck name (or the "STUDY" button on a 10" tablet), and AnkiDroid will switch to study mode.
ar: لدراسة البطاقات في المجموعة، ببساطة انقر على اسم المجموعة (أو زر "STUDY" على جهاز لوحي 10)، وسوف يتحول أنكيدرويد إلى وضع الدراسة.
ja: デッキ内のカードを学習するには、単にデッキ名をタップしてください (または「10」テーブルの「スタディ」ボタン) そして、AnkiDroidが学習モードに切り替わります。
ru: Чтобы изучить карточки в колоде, просто нажмите на имя колоды (или кнопку "STUDY" на таблетке 10"), и AnkiDroid переключится в учебный режим.

source: Note that the currently selected deck is highlighted with a grey background, and if you have any [filtered decks](filtered-deck.md#filtered-decks) they will be highlighted using a blue font. Filtered decks are discussed elsewhere in the manual.
ar: لاحظ أن المجموعة المختارة حاليا يتم تسليط الضوء عليها مع خلفية رمادية، وإذا كان لديك أي [سطح مصفى عنها](تصفية - سطح السفينة. d#filtered-decks) سيتم تسليط الضوء عليها باستخدام الخط الأزرق. يتم مناقشة الأسطح المصفاة في مكان آخر من الدليل.
ja: 現在選択されているデッキは灰色の背景でハイライトされ、format@@0(filtered-decks)がある場合はハイライトされます。 d#filtered-decks) 青いフォントを使用してハイライトされます。フィルタされたデッキはマニュアルの他の場所で説明されています。
ru: Обратите внимание, что выделенная колода подсвечивается серым фоном, и если у вас [отфильтрованные колоды](filtered-deck. d#filtered-decks) они будут подсвечены синим шрифтом. Отфильтрованные колоды обсуждаются в других разделах руководства.

source: Other Deck Actions
ar: إجراءات مجموعة أخرى
ja: 他のデッキのアクション
ru: Другие действия колоды

source: Long tapping on a deck will show a list of other actions available to perform on that deck:
ar: الضغط المطول على مجموعة سيعرض قائمة من الإجراءات الأخرى المتاحة للتنفيذ على تلك المجموعة:
ja: デッキを長押しすると、そのデッキで実行できる他のアクションのリストが表示されます:
ru: Долгое нажатие на колоде покажет список других действий, доступных для выполнения на этой колоде:

source: Rename deck
ar: إعادة تسمية المجموعة
ja: デッキ名を変更
ru: Переименовать колоду

source: Use this option to rename a deck
ar: استخدم هذا الخيار لإعادة تسمية مجموعة
ja: デッキの名前を変更するには、このオプションを使用します
ru: Используйте эту опцию, чтобы переименовать колоду

source: Deck options
ar: خيارات المجموعة
ja: デッキオプション
ru: Настройки колоды

source: Tapping on deck options allows you to configure various deck specific study options. Please see the [desktop documentation](https://docs.ankiweb.net/deck-options.html) for more information about these study options.
ar: النقر على خيارات المجموعة يسمح لك بتكوين مختلف خيارات الدراسة الخاصة بالمجموعة. يرجى الاطلاع على [وثائق سطح المكتب] (https://docs.ankiweb.net/deck-options.html) لمزيد من المعلومات حول خيارات الدراسة هذه.
ja: デッキオプションをタップすると、デッキ固有の学習オプションを設定できます。これらの学習オプションの詳細については、format@@0(https://docs.ankiweb.net/deck-options.html)を参照してください。
ru: Нажатие на колоду позволяет настроить различные параметры изучения в каждой колоде. Подробнее об этих возможностях обучения смотрите в [документации для рабочего стола](https://docs.ankiweb.net/deck-options.html).

source: Custom study
ar: دراسة مخصصة
ja: カスタム研究
ru: Пользовательская студия

source: Allows you to choose from some convenient presets for studying outside of your normal schedule, for example increasing the study limit for the day. See the section on [filtered decks](filtered-deck.md#filtered-decks) for more detailed information.
ar: يسمح لك بأن تختار من بعض الإعدادات المسبقة المناسبة للدراسة خارج الجدول الزمني العادي الخاص بك، على سبيل المثال زيادة حد الدراسة لهذا اليوم. للاطلاع على مزيد من المعلومات المفصلة، انظر القسم على [التصفية](filtered-deck.md#filtered-decks).
ja: 通常のスケジュール外で学習するための便利なプリセットから選択できます。例えば、その日の学習制限を増やすなどです。 詳細については、format@@0(filtered-deck.md#filtered-decks) のセクションを参照してください。
ru: Позволяет выбрать из некоторых удобных пресетов для изучения вне вашего обычного расписания, например, увеличение лимита обучения на день. Смотрите раздел [отфильтрованные колоды](filtered-deck.md#filtered-decks) для получения более подробной информации.

source: Delete deck
ar: حذف مجموعة
ja: デッキを削除
ru: Удалить колоду

source: Use this option to delete a deck (note: this action is not reversible, although you can [restore from a backup](backups.md#automatic-backups)
ar: استخدم هذا الخيار لحذف مجموعة (ملاحظة: لا يمكن عكس هذا الإجراء، على الرغم من أنه يمكنك [الاستعادة من نسخة احتياطية](Backups.md#automatic-backups)
ja: このオプションを使用してデッキを削除します（注意：この操作は元に戻せませんが、format@@0(backups.md#automatic-backups)
ru: Используйте эту опцию для удаления колоды (примечание: это действие не обратимо, но вы можете [восстановить из резервной копии](backups.md#automatic-backups)

source: Export deck
ar: تصدير مجموعة
ja: デッキをエクスポート
ru: Экспорт колоды

source: This option can be used to share a deck with other users. See the [exporting decks](exporting.md#exporting-anki-files) section for more information.
ar: يمكن استخدام هذا الخيار لمشاركة مجموعة مع مستخدمين آخرين. راجع قسم [تصدير سطح العمل] (exporting.md#exporting-anki-files) للحصول على مزيد من المعلومات.
ja: このオプションは、デッキを他のユーザーと共有するために使用できます。詳細については、format@@0(exporting.md#exporting-anki-files) セクションを参照してください。
ru: Эта опция может быть использована для обмена колодой с другими пользователями. Для получения дополнительной информации смотрите раздел [Экспорт колод](exporting.md#exporting-anki-files).

source: Unbury
ar: تفريغ
ru: Спрятать

source: This option is only visible when the selected deck has cards that have been manually or automatically buried.
ar: هذا الخيار مرئي فقط عندما تكون المجموعة المختارة لديها بطاقات تم دفنها يدوياً أو تلقائياً.
ja: このオプションは、選択したデッキに手動または自動的に埋められたカードがある場合にのみ表示されます。
ru: Эта опция видна только тогда, когда у выбранной колоды есть карты, которые были вручную или автоматически захоронены.

source: Rebuild / Empty
ar: إعادة البناء / فارغة
ja: 再構築/空です
ru: Перестройка / пустая

source: If the selected deck is a [filtered decks](filtered-deck.md#filtered-decks) then you also have the option to rebuild or empty the cards in it.
ar: إذا كانت المجموعة المختارة [مفترضة](filtered-deck.md#filtered-decks) فسيكون لديك أيضًا خيار إعادة بناء أو إفراغ البطاقات فيها.
ja: 選択したデッキがformat@@0(filtered-deck.md#filtered-decks)の場合は、カードを再構築するか空にすることもできます。
ru: Если выбранная колода — это [отфильтрованные колоды](filtered-deck.md#filtered-decks), то у вас также есть возможность пересобрать или очистить карты.

source: Clickable areas on the decks
ar: المناطق القابلة للنقر على سطح السفينة
ja: デッキのクリッカブルエリア
ru: Нажатые участки на палубах

source: Each deck in the list has three clickable areas:
ar: ولكل مجموعة في القائمة ثلاثة مجالات يمكن النقر عليها:
ja: リスト内の各デッキには、3つのクリック可能な領域があります:
ru: Каждая колода из списка имеет три кликабельных области:

source: Deck expander
ar: توسعة مجموعة
ja: デッキエキスパンダー
ru: Расширитель колоды

source: If you are using [subdecks](https://docs.ankiweb.net/getting-started.html#decks), then a deck expander button may appear on the far left of the deck, which can be used to show / hide the subdecks. A ▶ icon means the deck has hidden subdecks which can be shown, a ▼ icon means the deck has visible subdecks that can be hidden, and no icon means that the deck has no subdecks.
ar: إذا كنت تستخدم [subdecks](https://docs.ankiweb.net/getting-starated). tml#decks)، ثم يمكن أن يظهر زر توسيع المجموعة على أقصى اليسار من المجموعة، والذي يمكن استخدامه لإظهار / إخفاء الطوابق الفرعية. أيقونة ▶️ تعني أن المجموعة لديها طواقم فرعية مخفية يمكن عرضها، أيقونة أيقونة تعني أن المجموعة لديها طواقم فرعية مرئية يمكن إخفاؤها، ولا أيقونة تعني أن المجموعة ليس لديها طواقم فرعية.
ja: [subdecks](https://docs.ankiweb.net/getting-start) を使用している場合。 そして、デッキの左端にデッキエキスパンダボタンが表示され、サブデッキの表示/非表示に使用することができます。 ▶️アイコンはデッキに表示できるサブデッキがあることを意味します。 <unk> アイコンは、デッキに隠すことができる見えるサブデッキがあることを意味します。アイコンは、デッキにサブデッキがないことを意味します。
ru: Если вы используете [subdecks](https://docs.ankiweb.net/getting-started. tml#decks), затем на дальней левой части колоды может появиться кнопка разворачивания колоды, которая может быть использована для показа / скрытия подколод. ▶️ иконка означает, что колода имеет скрытые подколоды, которые могут быть показаны, иконка "named@@0" означает, что колода имеет видимые подколоды, которые могут быть скрыты, и иконка не означает, что пачка не имеет подколод.

source: **Note:** subdecks can be created by using the naming convention `PARENT::CHILD`.
ar: **ملاحظة:** يمكن إنشاء طواقم فرعية باستخدام اتفاقية التسمية `PARENT::CHILD`.
ja: **注意:** サブデッキは命名規則`PARENT::CHILD`を使用して作成できます。
ru: **Примечание:** подколоды могут быть созданы, используя конвенцию именования `PARENT::CHILD`.

source: Deck name
ar: اسم المجموعة
ja: デッキ名
ru: Название колоды

source: This is the main clickable area, which will take you to the study screen if there are cards available to review.
ar: هذه هي المنطقة الرئيسية التي يمكن النقر عليها، والتي ستأخذك إلى شاشة الدراسة إذا كانت هناك بطاقات متاحة للمراجعة.
ja: これは、レビューするために利用可能なカードがある場合は、学習画面に移動しますメインクリック可能な領域です。
ru: Это основная область для клика, которая перенесет вас на экран обучения, если есть карты для просмотра.

source: Count buttons
ar: أزرار العد
ja: カウントボタン
ru: Кнопки подсчета

source: The count buttons on the far right of each deck act as a separate clickable area that takes you to the deck overview instead of the study screen. This can be useful if you want to quickly view the number of cards available in the deck.
ar: أزرار العد على أقصى يمين لكل مجموعة تعمل كمنطقة منفصلة يمكن النقر عليها والتي تأخذك إلى نظرة عامة على المجموعة بدلاً من شاشة الدراسة. يمكن أن يكون هذا مفيداً إذا كنت ترغب في عرض عدد البطاقات المتاحة في مجموعة البطاقات بسرعة.
ja: 各デッキの右端にあるカウントボタンは、学習画面の代わりにデッキの概要に移動する別のクリック可能な領域として機能します。 これは、デッキで利用可能なカードの数をすばやく表示したい場合に便利です。
ru: Количество кнопок справа от каждой колоды действует как отдельная кликабельная область, которая ведет вас на обзор колоды вместо экрана обучения. Это может быть полезно, если вы хотите быстро просмотреть количество карточек в колоде.

source: Advanced Actions
ar: إجراءات متقدمة
ja: 高度な操作
ru: Дополнительные действия

source: Some additional actions are located in the overflow menu for less common tasks, which are summarized below:
ar: وتوجد بعض الإجراءات الإضافية في القائمة الاحتياطية للمهام الأقل شيوعا، ويرد أدناه موجز لهذه الإجراءات:
ja: いくつかの追加のアクションは、あまり一般的でないタスクのオーバーフローメニューにあります。これは以下の要約です。
ru: Некоторые дополнительные действия находятся в меню переполнения для менее распространенных задач, которые кратко излагаются ниже:

source: Undo
ar: التراجع
ja: 元に戻す
ru: Отменить

source: After reviewing the last card in a study session, you can undo it from here.
ar: بعد مراجعة آخر بطاقة في جلسة دراسية، يمكنك التراجع عنها من هنا.
ja: 学習セッションで最後のカードを確認した後、ここから元に戻すことができます。
ru: После просмотра последней карточки в учебной сессии, вы можете отменить ее здесь.

source: Check database
ar: تحقق من قاعدة البيانات
ja: データベースをチェック
ru: Проверка базы данных

source: This can automatically fix a lot of problems with your database, and will also purge any unused tags. If you experience any problems with your collection, this is the first action you should try.
ar: هذا يمكن أن يصلح تلقائياً الكثير من المشاكل مع قاعدة البيانات الخاصة بك، وسوف يزيل أيضًا أي علامات غير مستخدمة. إذا واجهت أي مشاكل في مجموعتك، فهذا هو الإجراء الأول الذي يجب أن تجربه.
ja: これにより、データベースに多くの問題が自動的に解決され、未使用のタグも削除されます。 コレクションに問題が発生した場合は、これは最初のアクションです。
ru: Это может автоматически исправить множество проблем с вашей базой данных, а также удалит все неиспользуемые теги. Если вы испытываете проблемы с вашей коллекцией, это первое действие, которое вам нужно попробовать.

source: **NOTE:** Under some circumstances, check database will move cards to a deck named _!Recovered Cards_. If this occurs, please move the cards to an appropriate deck via the [card browser](browser.md#findingsearchingbrowsing), and delete _!Recovered Cards_ when it is empty.
ar: **ملاحظة:** في بعض الظروف، سيقوم التحقق من قاعدة البيانات بنقل البطاقات إلى مجموعة تسمى _!البطاقات المستردة_. إذا حدث ذلك، يرجى نقل البطاقات إلى مجموعة مناسبة من خلال [متصفح البطاقة](Browser.md#findingsearchingbrowsing) وحذف _!!بطاقات استرداد عندما تكون فارغة.
ja: **注意:** 状況によっては、データベースがカードを_!リカバリされたカード_という名前のデッキに移動することを確認してください。 これが発生した場合は、format@@0(browser.md#findingsearchingbrowsing)を経由して適切なデッキにカードを移動し、空の場合は_!Recovered Cards_ を削除してください。
ru: **ПРИМЕЧАНИЕ:** В некоторых случаях проверьте базу данных будет перемещать карты в колоду, названную _!Восстановленные карты_. Если это произойдет, переместите карты в соответствующую колоду через [браузер карты](browser.md#findingsearchingbrowsing), и удалите _!Восстановленные карты_ когда это пусто.

source: Check media
ar: التحقق من الوسائط
ja: メディアを確認する
ru: Проверить медиа

source: Try to run this if you experience any issues with media syncing.
ar: حاول تشغيل هذا إذا واجهت أي مشاكل في مزامنة الوسائط.
ja: メディア同期に問題が発生した場合は、これを実行してください。
ru: Попробуйте запустить эту опцию, если возникли проблемы с синхронизацией медиафайлов.

source: Empty cards
ar: بطاقات فارغة
ja: 空のカード
ru: Пустые карты

source: Remove any empty cards from your collection. See the [desktop documentation](https://docs.ankiweb.net/templates/generation.html#card-generation--deletion) for more.
ar: إزالة أي بطاقات فارغة من مجموعتك. راجع [وثائق سطح المكتب] (https://docs.ankiweb.net/templates/generation.html#card-generation--deletion) للمزيد.
ja: コレクションから空のカードを削除します。詳細については、format@@0(https://docs.ankiweb.net/templates/generation.html#card-generation--deletion)を参照してください。
ru: Удалите все пустые карты из вашей коллекции. Смотрите [документацию для рабочего стола](https://docs.ankiweb.net/templates/generation.html#card-generation--deletion) для получения дополнительной информации.

source: Restore from backup
ar: استعادة من النسخة الاحتياطية
ja: バックアップから復元
ru: Восстановить из резервной копии

source: Allows you to restore from one of AnkiDroid's [automatic backups](backups.md#automatic-backups)
ar: يسمح لك بالاستعادة من أحد [النسخ الاحتياطية التلقائية] لأنكيدرويد (Backups.md#automatic-backups)
ja: AnkiDroidのformat@@0(backups.md#automatic-backups) からリストアできます。
ru: Позволяет восстанавливать данные из [автоматической резервной копии](backups.md#automatic-backups)

source: Manage note types
ar: إدارة أنواع الملاحظات
ja: ノートタイプの管理
ru: Управление типами заметок

source: Allows you to add, edit, and delete note types. See the [customizing card layout](advanced-features/customizing-card-layout.md) section for more help with this advanced feature.Keyboard Shortcuts
ar: يسمح لك بإضافة وتحرير وحذف أنواع الملاحظات. انظر [تخصيص تخطيط البطاقة](المتقدمة-الميزات/التخصيص - card-layout.md) لمزيد من المساعدة في هذه الميزة المتقدمة. اختصارات لوحة المفاتيح
ja: ノートタイプの追加、編集、削除ができます。詳細な機能については、format@@0(advanced-features/customizing-card-layout.md) セクションを参照してください。キーボードショートカット
ru: Позволяет добавлять, редактировать и удалять типы заметок. Смотрите [настройка макета](advanced-features/customizing-card-layout.md), чтобы получить больше помощи с этой расширенной функцией.Keyboard горячих клавиш

source: Import
ar: استيراد
ja: インポート
ru: Импорт

source: Import a .apkg anki file containing a deck. See the [importing](importing/importing-anki-files.md) section for more.
ar: استيراد ملف .apkg anki الذي يحتوي على مجموعة. راجع قسم [importing](الاستيراد/المستورد-anki-files.md) للمزيد.
ja: デッキを含む .apkg anki ファイルをインポートします。詳細は [importing](importing-anki-files.md) セクションを参照してください。
ru: Импортируйте файл .apkg с колодой. Смотрите раздел [importing](importing/importing-anki-files.md) для получения дополнительной информации.

source: Export collection
ar: تصدير المجموعة
ja: コレクションをエクスポート
ru: Экспорт коллекции

source: Export entire collection as a collection.apkg file. See the [exporting](exporting.md) section for more.
ar: تصدير المجموعة بأكملها كملف collection.apkg . راجع قسم [exporting](exporting.md) للمزيد.
ja: コレクション全体を collection.apkg ファイルとしてエクスポートします。詳細は [exporting](exporting.md) セクションを参照してください。
ru: Экспортируйте всю коллекцию в файл collection.apkg. Подробнее см. в разделе [exporting](exporting.md).

source: Deck Counts
ar: عدد المجموعات
ja: デッキの数
ru: Количество колод

source: Next to each deck, three numbers are displayed. The left, blue number, corresponds to how many new cards you have to learn today. Anki will introduce 20 new cards a day by default, and you can customize this number if you'd like. The red number in the middle is for the cards due to be studied today which are currently in the learning phase, and the green number is the cards which are due for review (i.e. cards which have already graduated from the learning phase). On a deck you've never studied before, these numbers will both be zero.
ar: بعد كل مجموعة، يتم عرض ثلاثة أرقام. اليسار، الرقم الأزرق، يتطابق مع عدد البطاقات الجديدة التي يجب أن تتعلمها اليوم. سوف تقدم أنكي 20 بطاقة جديدة في اليوم بشكل افتراضي، ويمكنك تخصيص هذا الرقم إذا أردت. الرقم الأحمر في الوسط هو للبطاقات المقرر دراستها اليوم والتي هي حاليا في مرحلة التعلم، والرقم الأخضر هو البطاقات التي من المقرر استعراضها (أي البطاقات). . البطاقات التي تخرجت بالفعل من مرحلة التعلم). على مجموعة البطاقات لم تدرسها من قبل، هذه الأرقام ستكون صفر.
ja: 各デッキの隣には、3つの数字が表示されます。左の青色の数字は、今日学ばなければならない新しいカードの数に対応します。 Ankiでは1日に20枚の新しいカードをデフォルトで導入し、必要に応じてカスタマイズすることができます。 途中の赤字は現在学習段階にある現在の学習対象カードである。 緑の番号はレビューのカードです (i. を選択します。学習段階から卒業したカードです。これまで勉強したことのないデッキでは、両方ともゼロになります。
ru: Рядом с каждой палубой отображаются три номера. Слева, синий номер, соответствует количеству новых карточек, которые вам нужно изучать сегодня. Анки по умолчанию представит 20 новых карт и вы можете настроить этот номер, если хотите. Красное число в середине для карт должны быть изучены сегодня, которые в настоящее время находятся в стадии обучения, и зеленый номер - это карты, подлежащие рассмотрению (i. карты, которые уже закончили учебную фазу). На колоде, которую вы никогда не изучили ранее, эти цифры будут равны нулю.

source: As explained above, tapping on the counts will take you to the deck overview screen.
ar: كما هو موضح أعلاه، فإن النقر على العد سيأخذك إلى شاشة استعراض المجموعة.
ja: 上記のように、カウントをタップすると、デッキの概要画面に移動します。
ru: Как описано выше, нажатие на счетчики приведет вас к экрану обзора пачки.

source: The navigation drawer can be opened from most places in the application by pressing the left menu icon, or alternatively swiping outwards from anywhere on the far left side of the screen. It is used for quickly navigating between different parts of the application. You can switch to the following screens:
ar: يمكن فتح درج التنقل من معظم الأماكن في التطبيق بالضغط على أيقونة القائمة اليسرى، أو بالسحب للخارج من أي مكان على الجانب الأيسر البعيد من الشاشة. يتم استخدامه للتنقل بسرعة بين أجزاء مختلفة من التطبيق. يمكنك التبديل إلى الشاشات التالية:
ja: 左のメニューアイコンを押すと、アプリケーションのほとんどの場所からナビゲーションドロワーを開くことができます。 画面左端のどこからでも外側にスワイプすることもできます これは、アプリケーションの異なる部分をすばやく移動するために使用されます。次の画面に切り替えることができます。
ru: Навигационная панель может быть открыта из большинства мест в приложении, нажав левый значок меню, или же проведите по экрану с любого места на левой стороне экрана. Используется для быстрого перехода между различными частями приложения. Вы можете переключиться на следующие экраны:

source: Decks
ar: مجموعة
ja: デッキ
ru: Колоды

source: Takes you to the top level of the app where the list of cards are shown ([more info here](deck-picker.md))
ar: يأخذك إلى أعلى مستوى من التطبيق حيث تظهر قائمة البطاقات ([مزيد من المعلومات هنا](deck-picker.md))
ja: カードのリストが表示されるアプリのトップレベルに移動します (format@@0(deck-picker.md))
ru: Переходит на верхний уровень приложения, в котором отображается список карт ([подробнее здесь](deck-picker.md))

source: Card Browser
ar: مستعرض البطاقة
ja: カードブラウザー
ru: Браузер карт

source: Shows a list of all your cards ([more info here](browser.md))
ar: يعرض قائمة بجميع بطاقاتك ([المزيد من المعلومات هنا](rowser.md))
ja: すべてのカードの一覧を表示します (format@@0(browser.md))
ru: Показывает список всех ваших карт ([подробнее здесь](browser.md))

source: Statistics
ar: الإحصائيات
ja: 統計情報
ru: Статистика

source: Helps you track your study progress ([more info in Anki manual](https://docs.ankiweb.net/stats.html#statistics) and [here](advanced-features/advanced-statistics.md))
ar: يساعدك في تتبع تقدمك في الدراسة ([مزيد من المعلومات في Anki manual](https://docs.ankiweb.net/stats.html#statistics) و [here](المتقدمة-features/Advced-statistics.md))
ru: Помогает вам отслеживать прогресс в изучении ([подробная информация в руководстве по Anki](https://docs.ankiweb.net/stats.html#statistics) и [here](advanced-features/advanced-statistics.md))

source: Night mode
ar: الوضع الليلي
ja: 夜間モード
ru: Ночной режим

source: This switches the app to a dark theme which many users find is less straining on the eyes, particularly when reviewing in the dark. See the
ar: هذا يغير التطبيق إلى سمة مظلمة يجدها العديد من المستخدمين أقل إجهادا في العين، خاصة عند مراجعتها في الظلام. انظر
ja: これは、多くのユーザーが見つけるダークテーマにアプリを切り替えます, 特に暗闇の中でレビューするとき、目に負担が少ないです. 参照:
ru: Это переключает приложение на темную тему, которую многие пользователи находят менее напряженных на глазах, особенно при просмотре в темноте. Смотреть

source: wiki
ar: ويكي
ru: вики

source: for instructions on how to customize the card background and font color used in night mode.
ar: للحصول على إرشادات حول كيفية تخصيص خلفية البطاقة ولون الخط المستخدم في الوضع الليلي.
ja: 夜間モードで使用されるカードの背景とフォントの色をカスタマイズする方法について説明します。
ru: для инструкций по настройке фона карты и цвета шрифта, используемого в ночном режиме.

source: Settings
ar: الإعدادات
ja: 設定
ru: Настройки

source: Allows you to customize the app ([more info here](settings.md))
ar: يسمح لك بتخصيص التطبيق ([المزيد من المعلومات هنا](settings.md))
ja: アプリのカスタマイズを許可します（format@@0(settings.md))
ru: Позволяет настроить приложение [подробнее здесь](settings.md))

source: Help
ar: مساعدة
ja: ヘルプ
ru: Справка

source: Opens this web page
ar: فتح صفحة الويب هذه
ja: このウェブページを開く
ru: Открыть эту веб-страницу

source: Send feedback
ar: إرسال الملاحظات
ja: フィードバックを送信
ru: Отправить отзыв

source: Get support from the AnkiDroid team
ar: الحصول على الدعم من فريق أنكيدرويد
ja: AnkiDroidチームのサポートを受ける
ru: Получите поддержку от команды AnkiDroid

source: [App bar](#app-bar)
ar: [شريط التطبيق](#app-bar)
ja: format@@0(#app-bar)
ru: [Панель приложений](#app-bar)

source: [Ordinary decks](#ordinary-decks)
ar: [الطوابق العادية] (#عادي)
ja: format@@0(#普通のデッキ)
ru: [Обычные колоды](#ordinary-колоды)
