Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: [Custom Study](#custom-study)
ar: [دراسة مخصصة](#custom-study)
ja: format@@0(#custom-study)
ru: [Пользовательские исследования](#custom-study)

source: [Filtered decks](#filtered-decks)
ar: [الطوابق المصفوفة](#filtered-decks)
ja: format@@0(#filtered-decks)
ru: [Отфильтрованные колоды](#filtered-decks)

source: [Empty deck](#empty-deck)
ar: [مجموعة فارغة](#empty-deck)
ja: format@@0(#empty-deck)
ru: [Пустая колода](#empty-deck)

source: [Rebuild deck](#rebuild-deck)
ar: [إعادة بناء المجموعة](#rebuild-deck)
ja: format@@0(#rebuild-deck)
ru: [Перестроить колоду](#rebuild-deck)

source: [Deck Options](#deck-options)
ar: [خيارات المجموعة](#deck-Options)
ja: format@@0(#deck-options)
ru: [Опции колоды](#deck-options)

source: From the deck list, if you tap the counts area you will be taken to the deck overview screen. On tablets it is always shown in the area to the right of the deck list.
ar: من قائمة المجموعة، إذا قمت بالنقر على منطقة العد سيتم أخذها إلى شاشة استعراض المجموعة. على الأقراص تظهر دائما في المنطقة إلى يمين قائمة سطح السفينة.
ja: デッキリストから、カウントエリアをタップすると、デッキの概要画面に移動します。 タブレットでは、デッキリストの右側の領域に常に表示されます。
ru: Из списка колоды, если вы нажмёте на область подсчета вы будете приняты на экран обзора пачки. На планшетах всегда отображается в области справа от списка палубы.

source: On this screen you can view a summary of the deck, build custom study sessions, rebuild / empty filtered decks, and change deck options. When visible, pressing the study button will take you to the study screen for that deck.
ar: على هذه الشاشة يمكنك مشاهدة ملخص المجموعة، وبناء جلسات دراسة مخصصة، وإعادة البناء/الطوابق الفارغة، وتغيير خيارات المجموعة. عندما تكون مرئية, الضغط على زر الدراسة سيأخذك إلى شاشة الدراسة لتلك المجموعة.
ja: この画面では、デッキの概要を表示し、カスタム学習セッションを構築し、フィルタリングされた/空のデッキを再構築し、デッキオプションを変更することができます。 format@@0ボタンを押すと、そのデッキの学習画面に移動します。
ru: На этом экране вы можете просмотреть сводку колоды, создать пользовательские сессии обучения, перестроить / очистить отфильтрованные колоды и изменить параметры колоды. При видении, нажатие на кнопку обучения перенесет вас на экран обучения для этой колоды.

source: App bar
ar: شريط التطبيقات
ja: アプリバー
ru: Панель приложений

source: The icons that are shown in the app bar depend on whether your deck is an ordinary deck or a filtered deck.
ar: تعتمد الرموز التي تظهر في شريط التطبيقات على ما إذا كانت مجموعتك هي مجموعة طقم عادية أو مجموعة مفلتة.
ja: アプリバーに表示されるアイコンは、デッキが通常のデッキかフィルターデッキかによって異なります。
ru: Значки, отображаемые в панели приложений, зависят от того, является ли ваша колода обычной или отфильтрованной колодой.

source: Ordinary decks
ar: طواقم عادية
ja: 通常のデッキ
ru: Обычные колоды

source: Custom Study
ar: دراسة مخصصة
ja: カスタム研究
ru: Пользовательская студия

source: Tapping the wrench icon allows you to create a custom session, for example to do extra reviews outside your normal schedule, or study only certain cards inside a deck. See the [filtered deck section](filtered-deck.md) for more information on this.
ar: النقر على أيقونة الإرسال يسمح لك بإنشاء جلسة مخصصة. على سبيل المثال للقيام بمراجعات إضافية خارج الجدول العادي الخاص بك، أو دراسة بطاقات معينة فقط داخل المجموعة. انظر [قسم سطح السفينة المصفى] (filtered-deck.md) لمزيد من المعلومات عن ذلك.
ja: レンチアイコンをタップすると、カスタムセッションを作成できます。 例えば通常のスケジュールの外で 特別なレビューをするとか デッキの中で 特定のカードだけを勉強するとか 詳細については、format@@0(filtered-deck.md) を参照してください。
ru: Нажатие на значок гаечного ключа позволяет создать сеанс Например, делать дополнительные обзоры за пределами вашего обычного расписания или изучать только некоторые карты внутри колоды. Смотрите [раздел отфильтрованной колоды](filtered-deck.md) для получения дополнительной информации об этом.

source: Filtered decks
ar: الطوابق المصفاة
ja: フィルターされたデッキ
ru: Отфильтрованные колоды

source: Empty deck
ar: مجموعة فارغة
ja: 空のデッキ
ru: Пустая колода

source: Tapping the cross icon will empty all of the cards in the current filtered deck (i.e. return them to their original deck).
ar: النقر على أيقونة التقاطع سيفرغ جميع البطاقات في المجموعة المصفاة الحالية (أي إرجاعها إلى سطح السفينة الأصلي).
ja: クロスアイコンをタップすると、現在フィルタリングされているデッキ内のすべてのカードが空になります (つまり、元のデッキに戻ります)。
ru: Нажатие на крестик очистит все карты в текущей отфильтрованной колоде (т.е. верните их в исходную колоду).

source: Rebuild deck
ar: إعادة بناء المجموعة
ja: デッキを再構築
ru: Перестроить колоду

source: Tapping the rebuild icon will rebuild the current filtered deck according to the settings specified in filtered deck options.
ar: النقر على أيقونة إعادة البناء سيعيد بناء المجموعة المصفاة الحالية وفقًا للإعدادات المحددة في خيارات مجموعة التصفية.
ja: 再構築アイコンをタップすると、フィルタリングされたデッキオプションで指定された設定に従って、現在のフィルタリングされたデッキが再構築されます。
ru: При нажатии значка пересборки будет перестроена текущая отфильтрованная колода в соответствии с настройками, указанными в параметрах отфильтрованной колоды.

source: Overflow menu
ar: قائمة فائقة
ja: オーバーフローメニュー
ru: Меню переполнения

source: Deck Options
ar: خيارات المجموعة
ja: デッキオプション
ru: Параметры колоды

source: Allows you to configure some options related to the current deck, such as the number of new cards and reviews to introduce each day. Please see the [desktop documentation](https://docs.ankiweb.net/deck-options.html) for more information about these study options.
ar: يسمح لك بتكوين بعض الخيارات المتعلقة بالمجموعة الحالية، مثل عدد البطاقات والمراجعات الجديدة لتقديمها كل يوم. يرجى الاطلاع على [وثائق سطح المكتب] (https://docs.ankiweb.net/deck-options.html) لمزيد من المعلومات حول خيارات الدراسة هذه.
ja: 毎日紹介する新しいカードの枚数やレビューなど、現在のデッキに関連するいくつかのオプションを設定できます。 これらの学習オプションの詳細については、format@@0(https://docs.ankiweb.net/deck-options.html)を参照してください。
ru: Позволяет настроить некоторые параметры, относящиеся к текущей колоде, такие как количество новых карточек и отзывов для представления каждый день. Пожалуйста, обратитесь к [документации для рабочего стола](https://docs.ankiweb.net/deck-options.html) для получения дополнительной информации об этих возможностях обучения.

source: Tapping on the deck name from the deck list, or the study button from the deck overview screen will take you to the study screen where you do your study.
ar: النقر على اسم المجموعة من قائمة المجموعة، أو زر الدراسة من شاشة العرض العام للمجموعة سيأخذك إلى شاشة الدراسة حيث تقوم بالدراسة.
ja: デッキリストからデッキ名をタップする デッキ概要画面の「勉強」ボタンを押すと、自分の勉強をする画面が表示されます。
ru: касаясь имени пачки из списка пачки, или кнопка обучения с экрана обзора палубы проведет вас на экране обучения, где вы учитесь.

source: Basics
ar: أساسيات
ja: 基本
ru: Основы

source: If you have not used Anki on a computer before, you may like to have a look at the first [intro video](https://docs.ankiweb.net/getting-started.html#videos) before reading on, as it explains the basic review process.
ar: إذا كنت لم تستخدم أنكي على جهاز كمبيوتر من قبل، قد ترغب في إلقاء نظرة على أول [فيديو] (https://docs. nkiweb.net/getting-started.html#videos) قبل القراءة عليها، كما يوضح عملية المراجعة الأساسية.
ja: 以前にコンピュータでAnkiを使用したことがない場合は、最初のformat@@0(https://docs) をご覧ください。 nkiweb.net/getting-started.html#videos) を読む前に、基本的なレビュープロセスを説明します。
ru: Если вы раньше не использовали Anki на компьютере, то можете посмотреть на первое [вводное видео](https://docs. Перед чтением nkiweb.net/getting-started.html#videos), как объясняет базовый процесс обзора.

source: On the top left of the screen you'll see three numbers. From the left, these correspond to new cards, learning cards, and cards to review. These are explained in more detail in the intro videos for the desktop program, so please [check them out](https://docs.ankiweb.net/getting-started.html#videos) if you haven't already.
ar: في الجزء العلوي الأيسر من الشاشة سترى ثلاثة أرقام. من اليسار، تقابل هذه البطاقات الجديدة وبطاقات التعلم والبطاقات للمراجعة. هذه تشرح بمزيد من التفصيل في مقاطع الفيديو المقدمة لبرنامج سطح المكتب، لذا يرجى [التحقق منها] (https://docs.ankiweb.net/getting-started.html#videos) إذا لم تكن قد فعلت ذلك بعد.
ja: 画面の左上には3つの数字が表示されます。左からは、新しいカード、学習カード、およびレビューするカードに対応しています。 これらはデスクトッププログラムのイントロ動画で詳しく説明されていますので、format@@0(https://docs.ankiweb.net/getting-started.html#videos)をお試しください。
ru: В верхнем левом углу экрана видны три числа. Слева от них соответствуют новым картам, обучающим картам и картам для просмотра. Они более подробно описаны в вводных видео для настольной программы, так что пожалуйста, [проверьте их](https://docs.ankiweb.net/getting-started.html#videos), если вы еще не есть.

source: When you've looked at a card's question and remembered the answer, or decided you don't know it, tap the **show answer** button. When you do, the bottom area will change to display 2-4 answer buttons, depending on how you've answered the card previously. The buttons will display the time a card will next be shown, so 10m means **10 minutes** and **5d** means **5 days**. You can tap directly on these buttons to choose a particular answer.
ar: عندما تنظر إلى سؤال بطاقة وتذكر الإجابة، أو قررت عدم معرفته، اضغط على زر **عرض الإجابة**. عندما تفعل ذلك، سيتم تغيير المنطقة السفلى لعرض أزرار الإجابة 2-4، اعتماداً على كيفية الرد على البطاقة سابقاً. ستظهر الأزرار الوقت الذي ستظهر فيه البطاقة لاحقا، لذا فإن 10 م تعني **10 دقائق** و **5 د** تعني **5 أيام**. يمكنك النقر مباشرة على هذه الأزرار لاختيار إجابة معينة.
ja: カードの質問を見て答えを思い出したり、知らないと思ったら、**答えを表示**ボタンをタップします。 これを行うと、下部の領域に2-4回答ボタンが表示されます。以前のカードの回答方法に応じて。 ボタンは次にカードが表示される時間を表示しますので、10mは**10分**、**5d**は**5日**を意味します。 これらのボタンを直接タップして、特定の回答を選択できます。
ru: Когда вы посмотрели вопрос карты и запомнили ответ или решили, что не знаете, нажмите на кнопку **показать ответ**. Когда вы делаете это, нижняя область изменится на отображение кнопок ответа 2-4 в зависимости от того, как вы ответили на карту ранее. Кнопки показывают время следующей карты, а значит, 10m означает **10 минут** и **5d** означает **5 дней**. Вы можете нажать на эти кнопки, чтобы выбрать конкретный ответ.

source: To make reviewing faster, you can configure gestures (for example taps and swipes) to answer cards without using the buttons. See the [preferences section](settings.md) for more information on configuring gestures.
ar: لجعل المراجعة أسرع، يمكنك تكوين الإيماءات (على سبيل المثال النقرات والسحبات) للإجابة على بطاقات دون استخدام الأزرار. راجع [تفضيلات قسم ](settings.md) لمزيد من المعلومات حول تكوين الإيماءات.
ja: レビューをより速くするために、ボタンを使用せずに、ジェスチャー(タップやスワイプなど)を設定することができます。 ジェスチャーの設定については、format@@0(settings.md) を参照してください。
ru: Чтобы сделать отзыв быстрее, вы можете настроить жесты (например, касания и свайпы) для ответа на карты без использования кнопок. Смотрите [раздел настроек](settings.md) для получения дополнительной информации о настройках жестов.

source: The App Bar at the top of the study screen has several buttons for performing various common actions. The number of buttons which are shown is determined automatically by Android based on the size and resolution of your screen. If there is not enough space to show the button for a given action, then the action will be available from the menu instead. If you are unsure what a button does, you can long-tap on it to see the name of the action. The following action are available:
ar: شريط التطبيقات في الجزء العلوي من شاشة الدراسة لديه عدة أزرار لأداء مختلف الإجراءات الشائعة. يتم تحديد عدد الأزرار التي تظهر تلقائياً بواسطة أندرويد استناداً إلى حجم الشاشة الخاصة بك ودقتها. إذا لم يكن هناك مساحة كافية لإظهار الزر لإجراء معين، فسيكون الإجراء متاحا من القائمة بدلا من ذلك. إذا كنت غير متأكد مما يفعله الزر، يمكنك النقر عليه لفترة طويلة لرؤية اسم الإجراء. الإجراء التالي متاح:
ja: 学習画面の上部にあるApp Barには、さまざまな一般的なアクションを実行するためのいくつかのボタンがあります。 表示されるボタンの数は、画面のサイズと解像度に基づいてAndroidによって自動的に決定されます。 与えられたアクションのためのボタンを表示するのに十分なスペースがない場合、アクションは代わりにメニューから利用可能になります。 ボタンが何をしているかがわからない場合は、長押しでアクションの名前を見ることができます。次のアクションが使用可能です:
ru: Панель приложений в верхней части экрана обучения содержит несколько кнопок для выполнения различных общих действий. Количество отображаемых кнопок автоматически определяется Android в зависимости от размера и разрешения экрана. Если не хватает места для отображения кнопки для данного действия, то действие будет доступно из меню. Если вы не уверены в том, что делает кнопка, вы можете удержаться на ней, чтобы увидеть название действия. Доступны следующие действия:

source: Undo the answer you chose for the last card you studied (button always shown).
ar: التراجع عن الإجابة التي اخترتها لآخر بطاقة درست (يظهر الزر دائما).
ja: 最後に学習したカードの解答を元に戻します(ボタンは常に表示されます)。
ru: Отменить выбранный ответ для последней изученной карты (кнопка всегда показывается).

source: Mark Card
ar: بطاقة علامة
ja: カードをマーク
ru: Пометить карточку

source: Adds a **marked** tag to the current note, so it can be easily found in the browser. This is useful when you want to take some action on the note at a later date, such as looking up a word when you get home. Marked cards also show a small star in the upper-right-hand corner during reviews.
ar: يضيف علامة **علامة** إلى الملاحظة الحالية، بحيث يمكن العثور عليها بسهولة في المتصفح. وهذا أمر مفيد عندما ترغب في اتخاذ بعض الإجراءات بشأن المذكرة في موعد لاحق، مثل البحث عن كلمة عندما تصل إلى المنزل. وتظهر البطاقات المعلَّمة أيضا نجمة صغيرة في الزاوية اليمنى العليا أثناء المراجعات.
ja: ブラウザで簡単に見つけられるように、現在のノートに **マーク** タグを追加します。 これは、後日ノートでアクションを起こしたい場合に便利です。 例えば家に帰ったときに言葉を探すとか マークされたカードには、レビュー中に右上隅に小さな星が表示されます。
ru: Добавляет **помеченный** тег к текущей заметке, так что его легко найти в браузере. Это полезно, когда вы хотите предпринять некоторые действия в отношении заметки позднее, например, поиск слова когда вы приедете домой. Помеченные карты также показывают маленькую звезду в верхнем углу в течение обзоров.

source: Flag Card
ar: بطاقة العلم
ja: フラグ カード
ru: Пометить карту

source: Adds a color coded **flag** (red, orange, green, or blue) This can be used as a general purpose indicator to differentiate your cards. Flags are represented by a number from 1-4, corresponding to the previously listed colors.
ar: يضيف لون **علم** (أحمر، برتقال، أخضر أو أزرق) يمكن استخدامه كمؤشر للغرض العام لتمييز بطاقاتك. ويمثّل الأعلام عدد يتراوح بين 1 و4 أعوام، يقابل الألوان المدرجة سابقاً.
ja: 色分けされた **フラグ** (赤、オレンジ、緑、青) を追加します。これは、カードを区別するための汎用的な指標として使用できます。 フラグは、以前にリストされている色に対応する1から4の数字で表されます。
ru: Добавляет кодовый **флаг** (красный, оранжевый, зеленый или синий) Этот флаг может использоваться в качестве индикатора общего назначения для дифференциации карт. Флаги представлены числом от 1-4, что соответствует ранее перечисленным цветам.

source: Edit Card
ar: تحرير البطاقة
ja: カードを編集
ru: Изменить карту

source: Open the edit note screen, where you can change the content displayed on the flashcard (see the [editing notes section](editing-notes.md) for more help)
ar: افتح شاشة ملاحظات التعديل، حيث يمكنك تغيير المحتوى المعروض على الفلاش (أنظر [تحرير قسم الملاحظات](edting-notes.md) للمزيد من المساعدة)
ja: メモの編集画面を開き、フラッシュカードに表示される内容を変更できます(詳細はformat@@0(editing-notes.md) を参照してください)。
ru: Откройте окно примечания для редактирования, где вы можете изменить содержимое, отображаемое на флешкартридже, (см. раздел [Редактирование заметок](editing-notes.md) для получения дополнительной помощи)

source: Hide / Delete
ar: إخفاء / حذف
ja: 非表示/削除
ru: Скрыть / Удалить

source: Give options to bury, suspend, or delete the current note or card
ar: إعطاء خيارات للدفن، تعليق أو حذف الملاحظة الحالية أو البطاقة
ja: 現在のノートまたはカードを埋めたり、一時停止したり、削除したりすることができます。
ru: Дать параметры для удаления, приостановки или записи

source: **Bury card / Bury note:** Hides a card or all of the note’s cards from review until the next day. (If you want to unbury cards before then, you can choose “unbury” from the long-press menu in the [deck list](deck-picker.md), or from the [deck overview screen](deck-overview.md).) This is useful if you cannot answer the card at the moment or you want to come back to it another time. Burying can also happen automatically for cards of the same note. If cards were in learning when they are buried, they are moved back to the new card queue or review queue prior to being buried.
ar: **بطاقة دفن / ملاحظة دفن:** إخفاء بطاقة أو جميع بطاقات الملاحظة من المراجعة حتى اليوم التالي. (إذا كنت ترغب في إلغاء دفن البطاقات قبل ذلك، يمكنك اختيار "إلغاء دفن" من قائمة الضغط المطول في [قائمة المجموعة] (منتقي سطح السفينة). d)، أو من [شاشة عرض المجموعة](deck-overview.md). هذا مفيد إذا لم تستطع الإجابة على البطاقة في هذه اللحظة أو إذا كنت تريد العودة إليها مرة أخرى. الدفن يمكن أن يحدث تلقائياً أيضاً لبطاقات من نفس الملاحظة. وإذا كانت البطاقات تعلم عند دفنها، فإنها تعاد إلى قائمة انتظار البطاقات الجديدة أو قائمة انتظار المراجعة قبل دفنها.
ja: **クレジットカード/クレジットノート：** カードまたはノートのすべてのカードをレビューから翌日まで非表示にします。 (その前にカードをアンベリーにしたい場合は、format@@0(deck-picker) の長押しメニューから「アンベリー」を選択できます。 d)、または format@@0(deck-overview.md) から。 これは、現時点でカードに答えられない場合や、別の時間に戻ってきたい場合に便利です。 埋葬は同じノートのカードに対して自動的に行われることもあります。 カードが埋められたときに学習中であった場合、それらは埋められる前に新しいカードキューまたはレビューキューに戻されます。
ru: **Bury card / Bury note:** Скрывает карточку или все карты ноты с обзоров до следующего дня. (Если вы хотите разобрать карты до этого, вы можете выбрать «нехорошее» из меню долгого нажатия в [списке колод](deck-picker. d) или из экрана [обзора колоды](deck-overview.md). Это полезно, если вы не можете ответить на карту в данный момент или вы хотите вернуться к ней в другое время. Похоронения также могут происходить автоматически для карт той же ноты. Если карты были изучены во время их захоронения, они перемещаются обратно в очередь новых карт или очередь проверок перед их захоронением.

source: **Suspend card / Suspend note:** Hides a card or all of the note’s cards from review until they are manually unsuspended (by long-tapping a card in the [card browser](browser.md)). This is useful if you want to avoid reviewing the note for some time, but don’t want to delete it. If cards were in learning when they are suspended, they are moved back to the new card queue or review queue prior to being suspended.
ar: **تعليق البطاقة / تعليق الملاحظة:** يخفي بطاقة أو جميع بطاقات الملاحظة من المراجعة إلى أن يتم إلغاء تعليقها يدوياً (عن طريق النقر مطولاً على بطاقة في [متصفح البطاقة](المستعرض. د)). هذا مفيد إذا كنت ترغب في تجنب مراجعة الملاحظة لبعض الوقت، ولكن لا تريد حذفها. وإذا كانت البطاقات تعلم عند تعليقها، فإنها تعاد إلى قائمة انتظار البطاقات الجديدة أو قائمة انتظار المراجعة قبل تعليقها.
ja: **カードを一時停止する/ノートを一時停止する:** カードまたはすべてのノートのカードを手動で一時停止解除するまで(format@@0ブラウザでカードを長押しします)。 d) これはしばらくメモを見直すのを避けたいが削除したくない場合に便利です。 一時停止時にカードが学習中であった場合、一時停止前に新しいカードキューまたはレビューキューに戻ります。
ru: **Приостановка карты / примечание приостановки:** Скрывает карту или все карты от проверки до тех пор, пока они не будут заблокированы вручную (при долгом нажатии на карту в [браузере карты](browser). d)). Это полезно, если вы хотите не просматривать заметку в течение некоторого времени, но не хотите удалять его. Если карты участвовали, когда они приостановлены, они перемещаются обратно в очередь новых карт или очередь проверок перед их приостановлением.

source: **Delete note:** Deletes the note and all of its cards.
ar: **حذف الملاحظة:** يحذف الملاحظة وجميع بطاقاتها.
ja: **メモを削除する:** メモとそのカードをすべて削除します。
ru: **Удалить заметку:** Удаляет заметку и все ее карты.

source: Replay Audio
ar: إعادة عرض الصوت
ja: 音声を再生
ru: Повторить аудио

source: If the card has audio on the front or back, it will be played again.
ar: إذا كانت البطاقة تحتوي على صوت في المقدمة أو الخلف، فسيتم تشغيلها مرة أخرى.
ja: カードの前後にオーディオがある場合は、再び再生されます。
ru: Если на карте есть звук спереди или назад, она будет воспроизведена снова.

source: Enable / Disable Whiteboard
ar: تمكين / تعطيل اللوحة البيضاء
ja: ホワイトボードの有効化/無効化
ru: Включить / отключить белую доску

source: This action enables or disables the whiteboard feature for the current deck. The whiteboard feature allows you to draw on the screen, which is particularly useful for practicing drawing characters from languages such as Japanese. When the whiteboard has been enabled for the current deck, two new actions will become available for clearing and hiding the whiteboard. Disabling the whiteboard will hide these actions as well as the whiteboard itself.
ar: هذا الإجراء يمكن أو يعطل ميزة اللوحة البيضاء للمجموعة الحالية. خاصية اللوحة البيضاء تسمح لك بالرسم على الشاشة، وهو أمر مفيد بشكل خاص لممارسة الرسم من لغات مثل اليابانية. عندما يتم تمكين اللوحة البيضاء للمجموعة الحالية، سيصبح هناك إجراءان جديدان متاحان لمسح اللوحة وإخفائها. سيؤدي تعطيل اللوحة البيضاء إلى إخفاء هذه الإجراءات وكذلك اللوحة البيضاء نفسها.
ja: この操作により、現在のデッキのホワイトボード機能が有効または無効になります。 ホワイトボード機能を使うと画面に描くことができ、日本語などの言語から文字を描く練習に特に役立ちます。 現在のデッキでホワイトボードが有効になっていると、ホワイトボードを消去して非表示にするための2つの新しいアクションが利用できるようになります。 ホワイトボードを無効にすると、これらのアクションとホワイトボード自体が非表示になります。
ru: Это действие включает или отключает функцию доски для текущей колоды. Функция "whiteboard" позволяет рисовать на экране, что особенно полезно при занятии рисованием символов с японского языка. Когда доска включена для текущей колоды, станут доступны два новых действия для очистки и скрытия доски. Отключение доски скроет эти действия, а также сама доска.

source: Open the deck specific study options. See the [desktop documentation](https://docs.ankiweb.net/deck-options.html) for more information about these study options.
ar: افتح خيارات الدراسة الخاصة بالمجموعة. راجع [وثائق سطح المكتب] (https://docs.ankiweb.net/deck-options.html) لمزيد من المعلومات حول خيارات الدراسة هذه.
ja: デッキ固有の学習オプションを開きます。format@@0(https://docs.ankiweb.net/deck-options.html)を参照してください。
ru: Откройте настройки для изучения пачки. Смотрите [документацию для рабочего стола](https://docs.ankiweb.net/deck-options.html) для получения дополнительной информации об этих возможностях обучения.

source: Check Pronunciation
ar: تحقق من النطق
ja: 発音を確認
ru: Проверить произношение

source: This action enables or disables the temporary audio recorder toolbar at the top of the card. This feature allows you to record your voice and replay it. It is used primarily to check your pronunciation. This toolbar is composed of three buttons: play, stop playing and record microphone audio. This tool can be used while viewing either the question or the answer.
ar: هذا الإجراء يمكن أو يعطل شريط أدوات تسجيل الصوت المؤقت في الجزء العلوي من البطاقة. هذه الميزة تسمح لك بتسجيل صوتك وإعادة عرضه. يتم استخدامه في المقام الأول للتحقق من نطقك. يتكون شريط الأدوات هذا من ثلاثة أزرار هي: التشغيل والتوقف عن تشغيل وتسجيل صوت الميكروفون. يمكن استخدام هذه الأداة أثناء عرض السؤال، أو الإجابة.
ja: この操作により、カードの上部にある一時的なオーディオレコーダーツールバーを有効または無効にします。 この機能を使用すると、音声を録音して再生できます。主に発音を確認するために使用されます。 このツールバーは、再生、再生停止、マイクオーディオの録音の3つのボタンで構成されています。 このツールは、質問または回答のいずれかを表示しながら使用できます。
ru: Это действие включает или отключает панель инструментов временного аудио в верхней части карты. Эта функция позволяет записывать голос и повторять его. Она используется в первую очередь для проверки произношения. Эта панель состоит из трех кнопок: играть, останавливать воспроизведение и записывать микрофон. Этот инструмент может быть использован при просмотре вопроса или ответа.

source: Reaching the end of the study session
ar: ألف - الوصول إلى نهاية الدورة الدراسية
ja: スタディセッションの終了に達しています
ru: Достижение конца учебной сессии
