Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: **Note 1**: If you have **Fetch media on sync** disabled, you may need to manually copy the font file from Anki Desktop to your AnkiDroid/collection.media folder.
ar: **الملاحظة 1**: إذا كان لديك **جلب الوسائط على المزامنة** معطلة، قد تحتاج إلى نسخ ملف الخط يدوياً من سطح المكتب أنكي إلى AnkiDroid/collection. مجلد edia
ja: **注 1**: **同期時にメディアを取得**が無効になっている場合は、Anki DesktopからAnkiDroid/コレクションに手動でフォントファイルをコピーする必要があります。 メディア フォルダ。
ru: **Примечание 1**: Если у вас **загрузка мультимедиа при синхронизации** отключена, вам может потребоваться вручную скопировать файл шрифта из Anki Desktop в свою коллекцию AnkiDroid/collection. медиа-папка.

source: **Note 2**: If you can't get your font to work after following the steps in here and the Anki Desktop manual, please refer to the FAQ for
ar: **الملاحظة 2**: إذا لم تتمكن من جعل خطك يعمل بعد متابعة الخطوات هنا ودليل سطح المكتب Anki ، يرجى الرجوع إلى الأسئلة الشائعة لـ
ja: **注 2** : ここの手順と Anki Desktop マニュアルに従ってフォントを動作させることができない場合。 こちらのFAQをご覧ください。
ru: **Примечание 2**: Если шрифт не может работать после выполнения шагов здесь и руководства Anki Desktop, обратитесь к FAQ для

source: detailed steps on how to debug font issues
ar: خطوات مفصلة حول كيفية تصحيح مشكلات الخط
ja: フォントの問題をデバッグする方法の詳細な手順
ru: подробные шаги по отладке шрифта

source: The layout of flashcards is completely customizable, although this is an advanced topic with a fairly steep learning curve, and you will probably find it a lot more convenient to do the customization with [Anki Desktop](../anki-desktop.md).
ar: تخطيط بطاقات الفلاش قابل للتخصيص تماما، على الرغم من أن هذا موضوع متقدم مع منحنى تعلم حاد نوعا ما، ومن المحتمل أنك ستجد أنه من الأنسب إجراء التخصيص مع [Anki Desktop](. /anki-desktop.md).
ja: フラッシュカードのレイアウトは完全にカスタマイズ可能ですが、これはかなり急な学習曲線を持つ高度なトピックです。 format@@0(Anki Desktop)でカスタマイズする方がもっと便利かもしれません。 /anki-desktop.md)。
ru: Макет карточки полностью настраиваемый, хотя это и продвинутая тема с довольно крутой кривой обучения, и вы, наверное, найдете гораздо удобнее настраивать [Anki Desktop](. /anki-desktop.md).

source: The [card templates section](https://docs.ankiweb.net/templates/intro.html) of the Anki Desktop manual has detailed instructions on how to edit note types, and most of the actions discussed there are also available from AnkiDroid by tapping **cards** at the bottom of the note editor, or choosing the **manage note types** option in the deck picker. Since detailed information on customizing card layouts is available in the Anki desktop manual, it will not be repeated here.
ar: [قسم قوالب البطاقة](https://docs.ankiweb.net/templates/intro. tml) من دليل حاسوب أنكي يحتوي على تعليمات مفصلة عن كيفية تعديل أنواع الملاحظات، ومعظم الإجراءات التي نوقشت هناك متاحة أيضا من AnkiDroid بالنقر على **البطاقات** في أسفل محرر الملاحظات، أو اختيار خيار **إدارة أنواع الملاحظات** في منتقي المجموعة. بما أن المعلومات التفصيلية عن تخصيص مخططات البطاقات متوفرة في دليل سطح المكتب Anki ، لن تتكرر هنا.
ja: format@@0(https://docs.ankiweb.net/templates/intro) Anki Desktopのマニュアルには、ノートタイプの編集方法についての詳細な説明があります。 そして、そこで議論されているほとんどのアクションは、ノートエディタの下部にある**カード**をタップすることで、AnkiDroidからも利用できます。 またはデッキピッカーで **ノートタイプを管理** オプションを選択します。 カードレイアウトのカスタマイズに関する詳細情報は、Ankiデスクトップマニュアルで入手できますので、ここでは繰り返しません。
ru: [раздел шаблонов карт](https://docs.ankiweb.net/templates/intro. tml) руководства Anki Desktop содержит подробные инструкции по редактированию типов заметок, и большинство обсуждаемых действий также доступны в AnkiDroid, нажав **карты** внизу редактора заметок, или выберите **управление типами заметок** в окне выбора колоды. Так как подробная информация о настройке макетов карт доступна в руководстве Anki для рабочего стола, это не будет повторяться.

source: There is an [advanced formatting page](https://github.com/ankidroid/Anki-Android/wiki/Advanced-formatting) on the AnkiDroid wiki with various hints on how you can get the most out of your card formatting, and we encourage you to read it, and edit it freely if you have any tips that you'd like to share with the community.
ar: هناك [صفحة تنسيق متقدمة](https://github. om/ankidroid/Anki-Android/wiki/Advced-formatting) على ويكي AnkiDroid مع تلميحات مختلفة حول كيفية الحصول على أقصى ما يمكن من تنسيق بطاقتك ونحن نشجعك على قراءتها وتحريرها بحرية إذا كان لديك أي نصائح ترغب في مشاركتها مع المجتمع.
ja: format@@0(https://github) があります。 om/ankidroid/Anki-Android/wiki/Advanced-formatting) AnkiDroidのwikiにあるカードフォーマットを最大限に活用する方法についてのヒントがあります。 コミュニティと共有したいヒントがあれば自由に編集してください
ru: На этой странице [расширенная страница форматирования](https://github. om/ankidroid/Anki-Android/wiki/Advanced-formatting) на вики AnkiDroid с различными подсказками о том, как вы можете получить максимальную отдачу от форматирования вашей карты, и мы рекомендуем вам прочитать и свободно редактировать его, если у вас есть советы, которые вы хотели бы поделиться с сообществом.

source: AnkiDroid allows you to type in the correct answer and then compare it to the right answer. You have to set this up with Anki desktop, as described in the [Anki Desktop manual](https://docs.ankiweb.net/templates/fields.html#checking-your-answer).
ar: يسمح لك أنكيدرويد بكتابة الإجابة الصحيحة ومن ثم مقارنتها بالإجابة الصحيحة. عليك إعداد هذا مع سطح المكتب أنكي، كما هو مبين في [دليل سطح المكتب أنكي](https://docs.ankiweb.net/templates/fields.html#checking-your-answer).
ja: AnkiDroidでは、正解を入力し、正解と比較することができます。 format@@0(https://docs.ankiweb.net/templates/fields.html#checking-your-answer)で説明されているように、これをAnkiデスクトップで設定する必要があります。
ru: AnkiDroid позволяет ввести правильный ответ и сравнить его с правильным ответом. Вы должны настроить это с помощью рабочего стола Anki, как описано в [Anki Desktop manual](https://docs.ankiweb.net/templates/fields.html#checking-your-answer).

source: Anki desktop replaces the **{{type:NN}}** field on the front of a card with an input box in the card. On AnkiDroid it is replaced with a **......** prompt instead, and a text input box is shown at the bottom. The comparison between typed text and the correct text is shown on the answer side in place of the **{{type:NN}}** field there, like on Anki desktop.
ar: يستبدل سطح المكتب أنكي الحقل **{{type:NN}}** الموجود في مقدمة البطاقة بصندوق إدخال في البطاقة. في AnkiDroid يتم استبداله بـ **.......** دعوة بدلاً من ذلك، ويظهر مربع إدخال النص في الأسفل. وترد المقارنة بين النص المكتوب والنص الصحيح على جانب الإجابة بدلا من الحقل **{{type:NN}}** هناك، مثل على سطح مكتب أنكي.
ru: Анки рабочий стол заменяет ** поле{{type:NN}}** на лицевой стороне карты на поле ввода в карте. На AnkiDroid вместо этого он заменяется на подсказку **......**, а нижнее поле ввода отображается. Сопоставление между введенным текстом и корректным текстом показано на стороне ответа вместо поля **{{type:NN}}**, там, как на Anki рабочий стол.

source: The text input box and the soft keyboard can be hidden by ticking **Disable typing in answer** in the preferences.
ar: يمكن إخفاء مربع إدخال النص ولوحة المفاتيح الناعمة عن طريق وضع علامة على **تعطيل الكتابة بالإجابة** في التفضيلات.
ja: テキスト入力ボックスとソフトキーボードは、環境設定の **Disable typing in answer** をチェックすることで非表示にできます。
ru: Текстовое поле ввода и клавиатура могут быть скрыты, отметив **Отключить ввод ответа** в настройках.

source: Even with typing disabled, the correct answer is shown on the answer side. This is done on purpose; otherwise the correct answer might not be shown at all.
ar: حتى مع تعطيل الكتابة، يتم عرض الإجابة الصحيحة على جانب الإجابة. ويتم ذلك عن قصد، وإلا فإن الإجابة الصحيحة قد لا تظهر على الإطلاق.
ja: 入力が無効の場合でも、正しい答えが回答側に表示されます。 これは意図的に行われます。そうでなければ、正しい答えはまったく表示されないかもしれません。
ru: Даже при отключении набора текста верный ответ отображается на стороне ответа. Это делается в конкретных целях; в противном случае можно было бы отобразить правильный ответ.

source: To hide the comparison (e.g. because the correct answer is shown anyway), the HTML id **typeans** can be used. Add following to the [card styling](https://docs.ankiweb.net/templates/styling.html#card-styling) using Anki Desktop.
ar: لإخفاء المقارنة (على سبيل المثال، لأن الإجابة الصحيحة تظهر على أية حال)، يمكن استخدام معرف HTML **typeans**. أضف المتابعة إلى [نمط البطاقة](https://docs.ankiweb.net/templates/styling.html#card-styling) باستخدام مكتب أنكي Anki Desktop.
ja: 比較を非表示にするには (例えば、正解が表示されているため)、HTML id の **type** を使用できます。 Anki Desktopを使用して、format@@0(https://docs.ankiweb.net/templates/styling.html#card-styling)に以下のように追加してください。
ru: Чтобы скрыть сравнение (например, потому, что в любом случае показан правильный ответ), можно использовать HTML ID **типов**. Добавьте следующие сюда [приставки с картами](https://docs.ankiweb.net/templates/styling.html#card-styling) с помощью Anki Desktop.

source: The type answer prompt and the comparison have more classes that can be used to change the way they are displayed. Some of these are the same as on Anki Desktop, some are specific to AnkiDroid.
ar: نوع الجواب موجه والمقارنة تحتوي على عدد أكبر من الفئات التي يمكن استخدامها لتغيير طريقة عرضها. بعض هذه هي نفس تلك الموجودة على سطح المكتب في أنكي، وبعضها خاص بـ AnkiDroid.
ja: 型応答プロンプトと比較には、表示方法を変更するために使用できるクラスがより多くあります。 これらのいくつかはAnki Desktopと同じで、AnkiDroid固有のものもあります。
ru: Тип запроса ответа и сравнение имеют больше классов, которые могут быть использованы для изменения отображения. Некоторые из них те же, что и на Anki Desktop, некоторые специфичны для AnkiDroid.

source: The comparison uses three classes, typeGood, typeBad and typeMissed to add green, red and gray background to the typing comparison. These three classes are used on Anki desktop as well.
ar: تستخدم المقارنة ثلاث فصول، نوع جود، نوع باد وطباعة، لإضافة خلفية خضراء وأحمر ورمادية إلى مقارنة الطباعة. هذه الفصول الثلاث تستخدم على الحاسوب المكتبي أنكي أيضا.
ja: 比較では、typeGood、typeBad、typeMissedの3つのクラスを使用して、タイプ比較に緑、赤、グレーの背景を追加します。 これらの3つのクラスは、Ankiデスクトップでも使用されています。
ru: Сравнение использует три класса, typeGood, typeBad и typeMissed для сравнения зеленых, красных и серых цветов. Эти три класса также используются на рабочем столе.

source: The **......** prompt has the class **typePrompt**.
ar: هذا الطلب **.......** يحتوي على الفئة **typePrompt**.
ja: **......** prompt クラスは **typePrompt** です。
ru: Запрос **......** содержит класс **typePrompt**.

source: When typing is set to off in the preferences, the class **typeOff** is added to the prompt on the question side, and to the div element containing the comparison on the answer side. This class can be used to show the type prompt or to hide the typing comparison in this case.
ar: عند تعيين الكتابة لإيقاف في التفضيلات، تتم إضافة الفئة **typeoff** إلى الموجّه على جانب السؤال. و إلى عنصر Dv الذي يحتوي على المقارنة على جانب الإجابة. يمكن استخدام هذه الفئة لإظهار نوع الموجة أو لإخفاء مقارنة الكتابة في هذه الحالة.
ja: 設定で入力が off に設定されている場合、質問側のプロンプトに **typeOff** クラスが追加されます。 そして答え側の比較を含むdiv要素に このクラスは、タイププロンプトを表示したり、タイプ比較を非表示にしたりするために使用できます。
ru: При вводе номера в настройках класс **typeOff** добавляется в запрос со стороны вопроса, и к элементу div содержащему сравнение со стороны ответа. Этот класс может быть использован для отображения подсказки типа или для скрытия сравнения ввода.

source: If Advanced Statistics are enabled, it changes the **Forecast** graph so that it shows the estimated number of reviews that will be due on a given day in the future taking into account future reviews, learning new cards and failing cards. The bars and the left axis show the number of cards due on each day if you study all cards each day, while the line and the right axis show the number of unseen (shown as **learn**), young and mature cards your deck or collection will consist of if you study all cards each day. The forecast graph does count reviews that are currently overdue. It assumes that the overdue cards will be reviewed according to the **maximum reviews/day** deck option.
ar: إذا تم تمكين الإحصائيات المتقدمة، إنه يغير الرسم البياني **التنبؤات** بحيث يبين العدد التقديري للمراجعات التي سيتم استحقاقها في يوم معين في المستقبل مع مراعاة الاستعراضات المستقبلية، تعلم بطاقات جديدة وبطاقات فاشلة. الحانات والمحور الأيسر تظهر عدد البطاقات المستحقة في كل يوم إذا كنت تدرس جميع البطاقات كل يوم، بينما الخط والمحور الأيمن يظهر عدد غير المشاهدة (يظهر ك**تعلم**)، ستتألف بطاقات الشباب والراشدين الخاصة بك على سطح السفينة أو مجموعة البطاقات من إذا كنت تدرس جميع البطاقات كل يوم. ويحسب الرسم البياني للتنبؤات الاستعراضات التي تأخرت عن موعدها حاليا. ويفترض أنه سيتم استعراض البطاقات المتأخرة وفقاً لخيار **الحد الأقصى للمراجعات/اليوم** على سطح السفينة.
ja: 高度な統計情報が有効な場合。 **Forecast** グラフを変更し、将来のレビューを考慮して、指定された日に支払われる予定のレビューの数を表示します。 新しいカードやカードの失敗を覚えています すべてのカードを毎日勉強する場合、バーと左の軸は毎日のカードの数を示します。 一方、直線と右軸は、見られない数を表示します (**learn**として表示されます)。 毎日すべてのカードを勉強すればデッキやコレクションは 予測グラフは、現在期限が過ぎているレビューをカウントします。 期限切れカードは、**最大レビュー/日**のデッキオプションに従ってレビューされることを前提としています。
ru: Если включена расширенная статистика, на графике **Прогноз** изменяется так, что на диаграмме показано расчетное количество рецензий, которое будет присваиваться на определенный день с учетом будущих рецензий, изучение новых карт и неудачных карт. Панели и левая ось показывают количество карточек, причитающихся каждый день, если вы изучаете все карты каждый день, в то время как линия и правая ось показывают количество незримых (показано как **обучение**), молодые и зрелые карты вашей палубы или коллекции будут состоять из если вы изучаете все карты каждый день. Прогнозируемый график делает количество рецензий, которые в настоящее время просрочены. Предполагается, что просроченные карты будут пересматриваться согласно **максимальному выбору рецензирования** колоды.

source: Advanced Statistics can be enabled in `Settings -> Advanced -> Advanced Statistics` (in plugin section).
ar: يمكن تمكين الإحصاءات المتقدمة في `إعدادات-> متقدم-> إحصاءات متقدمة` (في قسم الإضافة).
ja: 高度な統計は、 `Settings -> Advanced-> Advanced Statistics` (プラグインセクション) で有効にできます。
ru: Расширенная статистика может быть включена в `Settings -> Advanced -> Advanced Statistics` (в разделе плагина).

source: The outcome of future reviewing, learning or failing cards affects reviews after that future review. To take this into account, the probability of each outcome is computed from the review log. Then the outcome is randomly chosen, such that an outcome which is more likely according to the review log is more likely to be chosen than an outcome which is less likely according to the review log. The settings all affect how the effect of the outcome of future reviews on subsequent reviews is taken into account.
ar: وتؤثر نتائج الاستعراض أو التعلم أو البطاقات الفاشلة في المستقبل على الاستعراضات بعد ذلك الاستعراض في المستقبل. ولأخذ ذلك في الاعتبار، يحسب احتمال كل نتيجة من نتائج سجل الاستعراض. ثم يتم اختيار النتيجة عشوائياً، ومن ثم فإن النتيجة التي يرجح أن يتم اختيارها وفقاً لسجل الاستعراض تكون أكثر احتمالاً من النتيجة الأقل احتمالاً وفقاً لسجل الاستعراض. وتؤثر جميع هذه الأطر على كيفية مراعاة أثر نتائج الاستعراضات المقبلة على الاستعراضات اللاحقة.
ja: 今後のレビュー、学習、または失敗したカードの結果は、その後のレビュー後のレビューに影響します。 これを考慮すると、各結果の確率はレビューログから計算されます。 結果はランダムに選択されます レビューログに基づく結果が選択される可能性が高い レビューログに基づく可能性は低く すべての設定は、今後のレビューの結果がその後のレビューにどのように影響するかに影響します。
ru: Результаты будущего обзора, изучения или сбоя карточек влияют на обзоры после этого будущего обзора. Для того чтобы учесть это, вероятность каждого исхода рассчитывается из журнала рассмотрения. Затем исход выбирается случайно, Таким образом, вероятнее всего будет выбран исход обзора, который, по всей вероятности, скорее всего, окажется результатом, чем результатом, который менее вероятен в соответствии с журналом рассмотрения. Все настройки влияют на то, как влияние результатов будущих обзоров на последующие обзоры учитывается.

source: Compute first n days, simulate remainder
ar: حساب n الايام الأولى، محاكاة الباقي
ja: 最初のn日間を計算し、残りをシミュレートする
ru: Вычислить первые n дней, имитируя остаток

source: If this setting is set to a number greater than 0, instead of randomly choosing an outcome, each possible outcome is taken into account in the simulation, together with its probability. The probability is taken into account for the graph and for future reviews in which it results, which also affect the graph. One review has a couple of possible outcomes (say 4), which all result in a review. That review also has a couple of possible outcomes and so on. If many reviews are simulated this way, many reviews (4 x 4 x 4 x ... ) have to be taken into account which increases the time it takes to compose the graph. Therefore, for reviews later than n days from now are simulated by randomly choosing an outcome.
ar: إذا تم تعيين هذا الإعداد إلى عدد أكبر من 0، بدلاً من اختيار النتيجة عشوائياً، وتؤخذ كل نتيجة ممكنة في الاعتبار في عملية المحاكاة مع احتمال حدوثها. ويؤخذ الاحتمال في الاعتبار بالنسبة للرسم البياني ولعمليات الاستعراض التي ستجرى في المستقبل والتي ستؤثر أيضا على الرسم البياني. ولاستعراض واحد نتيجتين محتملتين (مثلا 4) تسفر جميعها عن استعراض. ولذلك الاستعراض أيضا نتيجتان محتملتان وما إلى ذلك. إذا تم محاكاة العديد من المراجعات بهذه الطريقة، العديد من المراجعات (4 x 4 x 4 x 4 x ... ) ينبغي أن يؤخذ في الاعتبار ما يزيد الوقت الذي يستغرقه تكوين الرسم البياني. ولذلك، فإن الاستعراضات التي تجرى في موعد متأخر عن يوم من الآن تتم محاكاتها باختيار نتيجة عشوائية.
ja: 結果をランダムに選択する代わりに、この設定が0より大きい数に設定されている場合。 それぞれの可能性のある結果がシミュレーションで考慮されます 確率は、グラフのために考慮されます, また、グラフにも影響を与える、その結果、将来のレビューのために. 1件のレビューには、いくつかの可能性のあるアウトカム(例えば4)があり、すべてのレビューがレビューになります。 このレビューには、いくつかの可能性のある成果などがあります。 多くのレビューがこのようにシミュレートされている場合、多くのレビュー(4 x 4 x 4 x ... グラフを作成するのにかかる時間が増えることを考慮する必要があります。 したがって、今後n日以降のレビューでは、結果をランダムに選択することによってシミュレートされます。
ru: Если этот параметр имеет значение больше 0, а не случайно выбирает исход при моделировании учитывается каждый возможный исход и его вероятность. Вероятность принимается во внимание на графике и на последующих обзорах, в которых он получается, что также влияет на график. Один из отзывов имеет несколько возможных результатов (скажем, 4), которые все приводят к рецензированию. Этот обзор также имеет несколько возможных результатов и так далее. Если так много отзывов смоделировано много отзывов (4 x 4 x 4 x ... ) необходимо принимать во внимание, что увеличивается время, затраченное на составление графика. Поэтому для отзывов позднее чем через несколько дней после этого мы выбираем случайный исход.

source: In summary, higher n gives a more accurate graph, but it takes more time to compose the graph.
ar: وباختصار، فإن أعلى n يعطي رسم بياني أكثر دقة، ولكن الأمر يحتاج إلى مزيد من الوقت لتكوين الرسم البياني.
ja: 要約すると、より高いnはより正確なグラフになりますが、グラフを構成するのに時間がかかります。
ru: В итоге, выше N дает более точный график, но для написания графика требуется больше времени.

source: Precision of computation
ar: دقة الحساب
ja: 計算の精度
ru: Точность вычислений

source: Reviews which occur with a probability smaller than 100% minus the configured precision of the computation are simulated by randomly choosing an outcome rather than taking into account each possible outcome. This setting is only applicable if the first n days are computed. If Advanced Statistics are disabled, the **Forecast** graph shows the estimated number of reviews that will be due on a given day in the future if you do not review cards, learn no new cards and fail no cards.
ar: يتم محاكاة الاستعراضات التي تحدث مع احتمال أقل من 100% مطروحاً منه الدقة المكونة للحساب عن طريق الاختيار العشوائي للنتيجة بدلاً من مراعاة كل نتيجة ممكنة. ولا ينطبق هذا الإعداد إلا إذا حسبت الأيام الأولى. إذا تم تعطيل الإحصائيات المتقدمة، ويبين الرسم البياني **التوقعات** العدد التقديري للمراجعات التي سوف تكون مستحقة في يوم معين في المستقبل إذا لم تقم بمراجعة البطاقات، تعلم لا بطاقات جديدة ولا تفشل البطاقات.
ja: 100%未満の確率で発生するレビューは、各可能な結果を考慮するのではなく、ランダムに結果を選択することによって計算の精度を設定されたよりも小さい確率で発生します。 この設定は、最初の n 日が計算された場合にのみ適用されます。 高度な統計情報が無効になっている場合 **予測** グラフには、カードをレビューしない場合に予定されているレビューの推定数が表示されます。 新しいカードもカードも失敗しない
ru: Рассмотрения, которые встречаются с вероятностью меньше, чем 100% минус, сконфигурированная точность вычислений имитируются случайным образом при выборе исхода, а не с учетом каждого возможного исхода. Этот параметр применим только в том случае, если вычисляются первые n дней. Если расширенная статистика отключена, на графике **Прогноз** показано расчетное количество отзывов, которое будет запланировано на данный день в будущем, если вы не рассматриваете карты, не выявлять новых карт и не проваливать карты.

source: In summary, higher precision gives a more accurate graph, but it takes more time to compose the graph.
ar: وباختصار، فإن الدقة العالية تعطي رسما بيانيا أكثر دقة، ولكن تكوين الرسم البياني يحتاج إلى مزيد من الوقت.
ja: 要約すると、高精度のグラフはより正確になりますが、グラフを構成するには時間がかかります。
ru: Таким образом, более точная точность дает более точный график, но составление графика занимает больше времени.

source: Number of iterations of the simulation
ar: عدد مرات تكرار المحاكاة
ja: シミュレーションの反復数
ru: Количество итераций моделирования

source: Composes the graph several times and then displays the average of these graphs. Each time the graph is composed, another outcome might be randomly chosen. If we average many outcomes which are randomly chosen taking into account the probabilities from the review log, the average outcome will likely be close to the average of the probabilities from the review log. If we average many graphs, the average graph will likely be close to the graph which is generated by taking into account all possible outcomes. If the number of graphs which are averaged is not too high, it will be faster than taking into account all possible outcomes.
ar: قم بتكوين الرسم البياني عدة مرات ثم يعرض متوسط هذه الرسوم البيانية. في كل مرة يتم تكوين الرسم البياني ، قد يتم اختيار نتيجة أخرى عشوائيا. إذا قمنا بمتوسط العديد من النتائج التي يتم اختيارها عشوائياً مع مراعاة الاحتمالات من سجل المراجعة، ومن المرجح أن يكون متوسط النتيجة قريباً من متوسط الاحتمالات من سجل الاستعراض. إذا قمنا بمتوسط العديد من الرسوم البيانية، فمن المرجح أن يكون متوسط الرسم البياني قريبا من الرسم البياني الذي يتم توليده بمراعاة جميع النتائج الممكنة. وإذا لم يكن متوسط عدد الرسوم البيانية مرتفعا، فإنه سيكون أسرع من مراعاة جميع النتائج الممكنة.
ja: グラフを数回作成してから、これらのグラフの平均を表示します。グラフを作成するたびに、別の結果がランダムに選択される可能性があります。 レビューログからの確率を考慮してランダムに選択された多くのアウトカムを平均した場合 平均的な結果はおそらくレビュー記録からの確率の平均に近いでしょう もし多くのグラフを平均すると、平均グラフは結果を考慮に入れて生成されるグラフに近づく可能性があります。 平均化されたグラフの数が高すぎない場合は、すべての可能な結果を考慮に入れるよりも速くなります。
ru: Накладывает график несколько раз, а затем отображает среднее значение этих графиков. Каждый раз, когда график формируется, может быть выбран другой исход случайным образом. Если мы в среднем выбираем много исходов, которые случайно выбираются с учетом вероятностей из журнала обзора, средний результат, вероятно, будет близок среднему значению вероятностей из журнала обзора. Если в среднем мы будем много графиков, то средний график будет близок к графику, который генерируется с учетом всех возможных результатов. Если количество графиков в среднем не слишком велико, то оно будет быстрее, чем с учетом всех возможных результатов.

source: In summary, a higher number of iterations gives a more accurate graph, but it takes more time to compose the graph.
ar: وباختصار، فإن عددا أكبر من التكرار يعطي رسما بيانيا أكثر دقة، ولكن تكوين الرسم البياني يحتاج إلى مزيد من الوقت.
ja: 要約すると、反復回数が多いほどより正確なグラフになりますが、グラフを作成するには時間がかかります。
ru: Таким образом, большее число итераций дает более точный график, но составление графика занимает больше времени.
