Repository: krmanik/ankidroiddocs
Catalog: po/*.po
Languages: ar, ja, ru

source: When you've finished the cards that are due to be studied today, you'll be taken back to the decks list and shown a congratulations message. From here you can select a different deck, or if you've finished studying for the day, you can simply tap the home button in order to close AnkiDroid (and you can also do this in the middle of reviews if you wish).
ar: عندما تنتهي من البطاقات التي من المقرر دراستها اليوم، سوف تعاد إلى قائمة الأسطح وتظهر لك رسالة تهانئ. من هنا يمكنك تحديد مجموعة مختلفة، أو إذا كنت قد انتهت من الدراسة لهذا اليوم، يمكنك ببساطة النقر على زر الصفحة الرئيسية لإغلاق AnkiDroid (ويمكنك أيضًا القيام بذلك في وسط المراجعات إذا رغبت).
ja: 今日勉強される予定のカードが終了すると、デッキリストに戻っておめでとうメッセージが表示されます。 ここから別のデッキを選ぶこともできますし、その日の勉強が終わった場合もあります。 AnkiDroidを閉じるには、ホームボタンをタップしてください(必要に応じて、レビューの途中でこれを行うこともできます)。
ru: Когда вы закончите карты, которые должны быть изучены сегодня, вы будете возвращены в список колод и показали поздравления сообщению. Отсюда вы можете выбрать другую колоду, или если вы закончили обучение на день, просто нажмите на кнопку "Домой", чтобы закрыть AnkiDroid (и вы также можете сделать это в середине отзывов, если хотите).

source: If you wish to keep studying the same deck further, tap on the deck again which will give you several options for continued study. Please see the [filtered deck](filtered-deck.md) section for more on custom study.
ar: إذا كنت ترغب في مواصلة دراسة نفس المجموعة، انقر على المجموعة مرة أخرى التي ستعطيك عدة خيارات لمواصلة الدراسة. يرجى الاطلاع على قسم [فلتر سطح البحر](filtered-deck.md) لمزيد من الدراسة المخصصة.
ja: 同じデッキをさらに勉強したい場合は、もう一度デッキをタップすると、勉強を続けるためのいくつかの選択肢が得られます。 カスタムスタディの詳細については、format@@0(filtered-deck.md)セクションを参照してください。
ru: Если вы хотите продолжить изучение той же палубы, нажмите на палубу, которая даст вам несколько вариантов для продолжения обучения. Для получения дополнительной информации обратитесь к разделу [filtered-deck.md](filtered-deck.md).

source: [Fields](#fields)
ar: [Fields](#حقول)

source: [Media Buttons](#media-buttons)
ar: [أزرار الوسائط](#media-buttons)
ja: format@@0(#media-buttons)
ru: [Кнопки мультимедиа](#media-buttons)

source: [Tags](#tags)
ar: [Tags](#علامات)

source: [Cards](#cards)
ar: [Cards](#بطاقات )

source: **Note:** _This section onwards assumes you understand what [notes, fields, card templates, and note types](https://docs.ankiweb.net/getting-started.html#notes--fields) are_
ar: **ملاحظة:** هذا القسم تفترض أنك تفهم ما هي [الملاحظات، الحقول، قوالب البطاقات وأنواع الملاحظات](https://docs.ankiweb.net/getting-started.html#notes--fields)
ja: **注意:** _このセクションでは、[ノート、フィールド、カードテンプレート、ノートタイプ](https://docs.ankiweb.net/getting-started.html#notes--fields) が何であるかを理解していることを前提としています。
ru: **Примечание:** В этом разделе подразумевается, что [заметки, поля, шаблоны карт и типы заметок](https://docs.ankiweb.net/getting-started.html#notes--fields) are_

source: To add a new note, tap the **+** button at the bottom of the deck list and choose **Add**.
ar: لإضافة ملاحظة جديدة، انقر على زر **+** في أسفل قائمة المجموعة واختر **إضافة**.
ja: 新しいノートを追加するには、デッキリストの下部にある**+**ボタンをタップし、**追加**を選択します。
ru: Чтобы добавить новую заметку, нажмите на кнопку **+** в нижней части списка колоды и выберите **Добавить**.

source: The following controls are available in the add note screen:
ar: الضوابط التالية متاحة في شاشة الملاحظات المضافة:
ja: ノートの追加画面では、以下のコントロールを使用できます。
ru: На экране добавления заметки доступны следующие элементы:

source: Type
ar: نوع
ja: タイプ
ru: Тип

source: Allows you to select the type of note you'd like to add. For most purposes the **Basic** note type is sufficient, but for example if you would like an extra card generated which is the reverse of the main card (i.e. shows the **Back** field on the front of the card), you could chose the **Basic (and reversed card)** note type.
ar: يسمح لك بتحديد نوع الملاحظة التي ترغب في إضافتها. لمعظم الأغراض، يعتبر نوع الملاحظة **الأساسية** كافياً، ولكن على سبيل المثال إذا كنت ترغب في بطاقة إضافية تم إنشاؤها والتي هي عكس البطاقة الرئيسية (i. . يظهر حقل **الخلف** في مقدمة البطاقة)، يمكنك اختيار نوع الملاحظة **الأساسي (والبطاقة المعكسة)**.
ja: 追加したいノートの種類を選択できます。 ほとんどの場合、**基本**ノートタイプで十分です。 例えばメインカードの逆方向に 生成されたカードが欲しければ をクリックします。 **戻る** フィールドをカードの前面に表示します。 **Basic (および逆カード)** ノートタイプを選択できます。
ru: Позволяет выбрать тип записи, которую вы хотели бы добавить. Для большинства целей **Базовый** тип заметок достаточен, но для примера, если бы вы хотели создать дополнительную карту, которая является обратной главной картой (i. показывает поле **Назад** на лицевой стороне карты), вы можете выбрать тип записи **Базовая (и обратная карта)**.

source: Deck
ar: مجموعة
ja: デッキ
ru: Колода

source: Allows you to change the deck the generated card/cards will be added to.
ar: يسمح لك بتغيير المجموعة التي سيتم إضافة البطاقة / البطاقات التي تم إنشاؤها إليها.
ja: 生成されたカード/カードが追加されるデッキを変更できます。
ru: Позволяет изменить колоду, в которую будут добавлены сгенерированные карты/карты.

source: Fields
ar: الحقول
ja: フィールド
ru: Поля

source: Below the deck selector are the fields for the note (for example the **Basic** note type has two fields **Front** and **Back**). When you tap on a field, a keyboard will come up, allowing you to type in information.
ar: تحت منتقي المجموعة الحقول للملاحظة (على سبيل المثال نوع الملاحظة **الأساسية** يحتوي على حقلين **الواجهة** و **الخلف**). عند النقر على حقل ما، ستظهر لوحة مفاتيح، مما يسمح لك بكتابة المعلومات.
ja: デッキセレクターの下にはノートのフィールドがあります(例えば、**基本**のノートタイプには**Front**と**Back**の2つのフィールドがあります)。 フィールドをタップすると、キーボードが表示され、情報を入力できます。
ru: Ниже приведен селектор пачки поля для заметки (например, тип **Basic** имеет два поля **Front** и **Back**). При нажатии на поле появится клавиатура, позволяющая вводить информацию.

source: Media Buttons
ar: أزرار الوسائط
ja: メディアボタン
ru: Кнопки Медиа

source: Tags
ar: الوسوم
ja: タグ
ru: Теги

source: Brings up a dialog which lets you add / remove tags from the note.
ar: يحضر مربع حوار يسمح لك بإضافة / إزالة العلامات من الملاحظة.
ja: ノートからタグを追加/削除できるダイアログが表示されます。
ru: Добавляет диалоговое окно, которое позволяет добавлять/удалять теги из заметки.

source: Cards
ar: البطاقات
ja: カード
ru: Карты

source: Shows the names of the cards which will be generated for the selected note type. Tapping on this button will bring up a dialog which lets you preview the source code for the card template of the selected note type. From here you can edit, preview, add, and delete card templates. See the [cards and templates section](https://docs.ankiweb.net/templates/intro.html) of the Anki Desktop manual for more information about card templates.
ar: يعرض أسماء البطاقات التي سيتم إنشاؤها لنوع الملاحظة المحدد. النقر على هذا الزر سيثير مربع حوار يتيح لك معاينة رمز المصدر لقالب البطاقة من نوع الملاحظة المحدد. من هنا يمكنك تحرير نماذج البطاقة وعرضها وإضافتها وحذفها. انظر [قسم البطاقات والقوالب](https://docs. nkiweb.net/templates/intro.html) من دليل سطح المكتب أنكي للحصول على مزيد من المعلومات عن قوالب البطاقة.
ja: 選択したノートタイプで生成されるカードの名前が表示されます。 このボタンをタップすると、選択したノートタイプのカードテンプレートのソースコードをプレビューできるダイアログが表示されます。 ここから、カードテンプレートの編集、プレビュー、追加、削除ができます。format@@0(https://docs) をご覧ください。 カードテンプレートの詳細については、Anki Desktopマニュアルのnkiweb.net/templates/intro.htmlを参照してください。
ru: Показывает имена карт, которые будут созданы для выбранного типа заметок. Нажатие на эту кнопку вызовет диалоговое окно, позволяющее предварительно просмотреть исходный код шаблона карты выбранного типа заметок. Отсюда вы можете редактировать, просматривать, добавлять и удалять шаблоны карт. Смотрите раздел [карты и шаблоны](https://docs. nkiweb.net/templates/intro.html) руководства Anki Desktop для более подробной информации о шаблонах карт.

source: Long press in a text entry field to add a cloze deletion around the selected text, or an empty cloze deletion if there is no selected text.
ar: اضغط مطولاً في حقل إدخال النص لإضافة حذف غسيل حول النص المحدد، أو حذف ملابس فارغة إذا لم يكن هناك نص محدد.
ja: テキスト入力フィールドを長押しすると、選択したテキストの周りに閉じた削除が追加されます。 または、選択したテキストがない場合は空の閉じる削除を行います。
ru: Длительное нажатие в текстовом поле записи, чтобы добавить удаление заклинания вокруг выбранного текста, или пустое удаление заклинания, если нет выделенного текста.

source: When you've finished typing in the content of a note, tap the tick icon in the app bar at the top to add it to your collection. Alternatively, if you want to go back to what you were doing without saving, you can tap the app icon, or use the hardware back button.
ar: عند الانتهاء من الكتابة في محتوى الملاحظة، انقر على أيقونة علامة في شريط التطبيقات في الأعلى لإضافتها إلى مجموعتك. بدلاً من ذلك، إذا كنت ترغب في العودة إلى ما كنت تفعله دون حفظ، يمكنك النقر على أيقونة التطبيق، أو استخدام زر عودة الجهاز.
ja: ノートの内容を入力し終えたとき 上部のアプリバーのチェックマークをタップしてコレクションに追加します。 あるいは、保存せずにやっていたことに戻りたい場合は、 アプリのアイコンをタップするか、ハードウェアの戻るボタンを使用します。
ru: Когда вы закончите ввод текста заметки, нажмите на значок галочки в верхней части панели, чтобы добавить его в вашу коллекцию. Альтернативно, если вы хотите вернуться к тому, что вы делали без сохранения, вы можете нажать на значок приложения или использовать аппаратную кнопку обратно.

source: The edit note screen can be opened by choosing edit while reviewing, or by opening a card in the browser. The edit screen is similar to the add new note screen mentioned above, with some key differences:
ar: يمكن فتح شاشة ملاحظات التحرير عن طريق اختيار التعديل أثناء المراجعة، أو عن طريق فتح بطاقة في المتصفح. شاشة التحرير مشابهة لشاشة الملاحظة الجديدة المذكورة أعلاه، مع بعض الاختلافات الرئيسية:
ja: 編集画面は、レビュー中に編集を選択するか、ブラウザでカードを開くことで開くことができます。 編集画面は、上記の新しいノートを追加する画面に似ています。いくつかの重要な違いがあります。
ru: Экран редактирования может быть открыт, выбрав редактирование во время просмотра или открыв карту в браузере. Экран редактирования похож на окно добавления новой заметки, упомянутое выше, с некоторыми ключевыми различиями:

source: Changing the deck operates on the selected card (which is underlined in the **Cards** box). If a note type is chosen which has more than one card, only the currently selected card will be moved to the new deck.
ar: تغيير المجموعة يعمل على البطاقة المختارة (والتي تحتها خط في مربع **البطاقات**). إذا تم اختيار نوع ملاحظة يحتوي على أكثر من بطاقة واحدة، سيتم نقل البطاقة المختارة حاليا فقط إلى المجموعة الجديدة.
ja: デッキの変更は、選択したカード(**カード**ボックスに下線が引かれています)で動作します。 複数のカードを持つノートタイプが選択されている場合、現在選択されているカードのみが新しいデッキに移動されます。
ru: Изменение колоды работает на выбранной карте (что подчеркнуто в коробке **Карты**). Если выбран тип заметки с более чем одной картой, только выбранная карта будет перемещена в новую колоду.

source: Changing the **Type** dropdown selector changes to the note type edit mode. In this mode, editing the content of the note (i.e. deck, fields, etc) is disabled, and if a custom note type with more than two fields is being used, additional buttons will appear which let you control the mapping of the fields to the new note type.
ar: تغيير **نوع** القائمة المنسدلة التغييرات إلى وضع تحرير نوع الملاحظة. في هذا الوضع، تحرير محتوى الملاحظة (أي المجموعة، الحقول، إلخ) معطلة، وإذا تم استخدام نوع ملاحظة مخصص مع أكثر من حقولين، ستظهر أزرار إضافية تسمح لك بالتحكم في خرائط الحقول إلى نوع الملاحظة الجديدة.
ja: **Type** ドロップダウンセレクターをノートタイプの編集モードに変更します。このモードでは、ノートの内容を編集します。 デッキ、項目などが無効になっており、2つ以上の項目を持つカスタムノートタイプが使用されている場合。 新しいノートタイプへのフィールドのマッピングをコントロールできる追加ボタンが表示されます。
ru: Изменение выпадающего списка **Тип** изменяется в режиме редактирования типов заметок. В этом режиме редактирование содержимого заметки (т.е. колода, поля и т. д.) отключены, и если используется пользовательская заметка с более чем двумя полями, появляются дополнительные кнопки, которые позволяют контролировать сопоставление полей с новым типом заметок.

source: If a note type is selected which has less cards than the original note type, only the first n cards will be kept. For example changing from **Basic (and reversed card)** to **Basic** will lead to only the first card being kept. To warn you of this, the text in the **Cards** box will appear red, and a confirmation dialog will be shown before the note is saved.
ar: إذا تم تحديد نوع ملاحظة يحتوي على بطاقات أقل من نوع الملاحظة الأصلية، سيتم الاحتفاظ ببطاقات n الأولى فقط. على سبيل المثال، التغيير من **البطاقة الأساسية (والبطاقة المعكسة)** إلى **الأساسية** سيؤدي إلى الاحتفاظ بالبطاقة الأولى فقط. لتحذيرك من هذا، سيظهر النص الموجود في مربع **البطاقات** أحمر، وسيتم عرض مربع حوار التأكيد قبل حفظ الملاحظة.
ja: 元のノートタイプよりもカードが少ないノートタイプが選択されている場合、最初の n 枚のカードのみが保持されます。 例えば、**Basic (と逆カード)**から**Basic**に変更すると、最初のカードのみが保持されます。 これについて警告するために、**カード** ボックス内のテキストは赤く表示されます。 そして、メモが保存される前に確認ダイアログが表示されます。
ru: Если выбран тип записи, который имеет меньше карточек оригинального типа, то будут сохранены только первые n карты. Например, переход с **Базовой (и обратной карты)** на **Базовый** приведет к тому, что сохранится только первая карта. Чтобы предупредить вас об этом, текст в окне **Карты** появится красным цветом, и будет показано диалоговое окно подтверждения перед сохранением.

source: Hint: to change the type for multiple notes in one go, or to customize the mapping between cards, use the **Change note type** option in the browser on Anki Desktop.
ar: تلميح: لتغيير النوع لملاحظات متعددة في ذهب واحد، أو لتخصيص رسم الخرائط بين البطاقات، استخدم خيار **تغيير نوع الملاحظة** في المتصفح على سطح المكتب في أنكي.
ja: ヒント: 一度に複数のノートのタイプを変更するか、カード間のマッピングをカスタマイズします。 Anki Desktopのブラウザで「ノートタイプを変更」オプションを使用します。
ru: Подсказка: изменить тип для нескольких заметок в одном направлении, или настроить отображение между картами, используйте опцию **Изменить тип записи** в браузере на Anki Desktop.

source: There are also several advanced options available in the main menu:
ar: وهناك أيضا عدة خيارات متقدمة متاحة في القائمة الرئيسية:
ja: メインメニューにはいくつかの高度なオプションもあります。
ru: Есть также несколько расширенных опций в главном меню:

source: Add note
ar: إضافة ملاحظة
ja: メモを追加
ru: Добавить заметку

source: Create a new empty note
ar: إنشاء ملاحظة فارغة جديدة
ja: 新しい空のノートを作成
ru: Создать новую пустую заметку

source: Copy card
ar: نسخ البطاقة
ja: カードをコピー
ru: Копировать карту

source: Copy the current note to a new editable note
ar: نسخ الملاحظة الحالية إلى ملاحظة جديدة قابلة للتعديل
ja: 現在のノートを新しい編集可能なノートにコピー
ru: Скопировать текущую заметку в новую редактируемую заметку

source: Reset progress
ar: إعادة تعيين التقدم
ja: 進行状況をリセット
ru: Сбросить прогресс

source: Move the card to the end of the new card queue. The current state of the card is cleared, but not its revision history.
ar: نقل البطاقة إلى نهاية قائمة انتظار البطاقة الجديدة. تم مسح الحالة الحالية للبطاقة ولكن ليس سجل تنقيحها.
ja: 新しいカードキューの最後にカードを移動します。カードの現在の状態はクリアされますが、リビジョン履歴は表示されません。
ru: Переместить карту в конец очереди на новую карту. Текущее состояние карты очищено, но не история ревизии.

source: Reschedule
ar: إعادة جدولة
ja: スケジュールを変更
ru: Отложенные звонки

source: Allows you to reschedule as a review card on a given date. This is useful if you have imported already-learnt material, and you want to start it off with higher initial intervals.
ar: يسمح لك بإعادة جدولة كبطاقة مراجعة في تاريخ معين. هذا مفيد إذا كنت قد استوردت مواد تعلمت بالفعل، وترغب في البدء بها بفواصل أولية أعلى.
ja: 指定された日付にレビューカードとしてスケジュールを変更できます。 これは、すでに学習済みの教材をインポートしており、より高い初期間隔で始めたい場合に便利です。
ru: Позволяет вам перенести в качестве обзорной карты на указанную дату. Это полезно, если вы импортировали материал уже учтенный, и вы хотите начать его с более высоким начальным интервалом.

source: [Searching](#searching)
ar: [Searching](#البحث)

source: [tag:marked](#tagmarked)
ar: [علامة:marked](#علامة)

source: [is:due](#isdue)
ar: [هو:due](#isdue)
ru: [есть:due](#isdue)

source: [flag:1](#flag1)
ar: [العلم:1](#flag1)

source: You can search for or browse cards by tapping the **Card browser** button from the [navigation drawer](drawer.md).
ar: يمكنك البحث عن أو تصفح البطاقات بالنقر على زر **متصفح البطاقة** من [درج التنقل](درج التنقل).
ja: [navigation drawer](drawer.md)から**Card browser**ボタンをタップすると、カードを検索したり閲覧したりできます。
ru: Вы можете искать или просматривать карты, нажав кнопку **Card browser** в [меню навигации](drawer.md).

source: The browser screen starts by displaying all the cards in the currently selected deck. You can search for cards in the selected deck by tapping the magnifying glass icon in the top. You can change the selected deck (or change to all decks) by choosing the deck from the dropdown list on the top left.
ar: تبدأ شاشة المتصفح بعرض جميع البطاقات في المجموعة المختارة حاليا. يمكنك البحث عن بطاقات في المجموعة المختارة عن طريق النقر على أيقونة الزجاج المكبر في الأعلى. يمكنك تغيير المجموعة المحددة (أو التغيير إلى جميع المجموعات) باختيار المجموعة من القائمة المنسدلة على أعلى اليسار.
ja: ブラウザー画面は、現在選択されているデッキのすべてのカードを表示することによって開始します。 上部にある虫眼鏡アイコンをタップすると、選択したデッキでカードを検索できます。 左上のドロップダウンリストからデッキを選択することで、選択したデッキを変更(またはすべてのデッキに変更)することができます。
ru: Экран браузера начинается с отображения всех карт в текущей колоде. Вы можете искать карты в выбранной колоде, нажав на иконку увеличивающегося стекла вверху. Выбранную колоду можно изменить на все колоды, выбрав колоду из выпадающего списка в левом верхнем углу.

source: By default, the first column in the browser gives the text which will be shown on the question (i.e. front side) of the flashcard, and the second column shows the text from the answer (i.e. the back side) of the flashcard.
ar: بشكل افتراضي، العمود الأول في المتصفح يعطي النص الذي سيتم عرضه على السؤال (أي الجانب الأمامي) للبطاقة الفلاشية، والعمود الثاني يعرض النص من الإجابة (أي الجانب الخلفي) للبطاقة الفلاشية.
ja: デフォルトでは、ブラウザーの最初の列は、質問に表示されるテキストを表示します (例: フラッシュカードの正面、2番目の列にはフラッシュカードの解答(裏面)からのテキストが表示されます。
ru: По умолчанию в первом столбце браузера приводится текст, который будет показан на вопросе (т.е. на передней стороне) флешкартриджа, а во второй колонке показан текст из ответа (то есть обратной стороны) флешкартриджа.

source: The first column can also be configured to show the [sort field](https://docs.ankiweb.net/editing.html#customizing-fields) for a more compact display. The second column can be configured to show many different parameters by tapping the drop down menu in the column heading.
ar: يمكن أيضا تكوين العمود الأول لإظهار [الترتيب] (https://docs.ankiweb.net/editing.html#customizing-fields) لعرض أكثر تركيزا. يمكن تكوين العمود الثاني لإظهار العديد من المعلمات المختلفة عن طريق النقر على القائمة المنسدلة في عنوان العمود.
ja: 最初の列はformat@@0(https://docs.ankiweb.net/editing.html#customizing-fields)を表示するように設定することもできます。 2番目の列は、列見出しのドロップダウンメニューをタップすることで、多くの異なるパラメータを表示するように設定できます。
ru: Первая колонка также может быть настроена на отображение [поля сортировки](https://docs.ankiweb.net/editing.html#customizing-fields) для более компактного отображения. Вторая колонка может быть настроена так, чтобы показать множество различных параметров, нажав на выпадающее меню в заголовке колонок.

source: Note that the content of the columns is dynamically calculated as your scroll through the list of the cards.
ar: لاحظ أن محتوى الأعمدة يتم حسابه بشكل ديناميكي كتمرير من خلال قائمة البطاقات.
ja: 列の内容は、カードのリストをスクロールすると動的に計算されます。
ru: Обратите внимание, что содержимое столбцов динамически рассчитывается как ваш прокрутка по списку карт.

source: From the search results, you can tap on a card to edit it (see the [edit note section](editing-notes.md) above), or long-tapping on it will show a menu allowing you to perform the following actions:
ar: من نتائج البحث، يمكنك النقر على بطاقة لتحريرها (انظر [تحرير قسم الملاحظة](edting-notes. d) أعلاه)، أو الضغط المطول عليه سيظهر قائمة تسمح لك بتنفيذ الإجراءات التالية:
ja: 検索結果から、カードをタップして編集することができます (format@@0(editing-note) を参照してください)。 上記の)または長押しすると、次の操作を行うことができるメニューが表示されます。
ru: Из результатов поиска можно нажать на карту, чтобы отредактировать её (см. раздел [Редактировать заметки](editing-notes. d) выше), или долгое нажатие на нем покажет меню, позволяющее выполнить следующие действия:

source: Mark / unmark note
ar: علامة / إلغاء علامة ملاحظة
ja: ノートのマークを解除
ru: Отметить / снять заметку

source: Add / remove the **marked** tag from the note. Cards with a marked note are highlighted in purple.
ar: إضافة / إزالة العلامة **المعلَّمة** من الملاحظة. البطاقات ذات الملاحظة المعلَّمة يتم ضبطها باللون البنفسجي.
ja: メモから **マークされた** タグを追加/削除します。マークされたノートのカードは、紫色でハイライトされます。
ru: Добавить / удалить **помеченный** тег из заметки. Карточки с помеченной заметкой выделены фиолетовыми.

source: Flag card
ar: بطاقة العلم
ja: フラグ カード
ru: Флаг

source: Change or remove the color coded **flag** on the card. Cards with a flag are highlighted in the flags color.
ar: تغيير أو إزالة اللون المرمز **العلم** على البطاقة. البطاقات التي تحمل العلم واضحة في لون الأعلام.
ja: カードの**フラグ**の色を変更または削除します。フラグ付きのカードはフラグの色でハイライトされます。
ru: Измените или удалите цвет **флаг** на карте. Карточки с флагом подсвечиваются цветом флагов.

source: Suspend / unsuspend card
ar: تعليق / إلغاء تعليق البطاقة
ja: カードの一時停止/停止解除
ru: Приостановка / разблокировка карты

source: Suspended cards are highlighted in yellow, and are not shown during review.
ar: وتسلط الأضواء على البطاقات المعلَّقة باللون الأصفر ولا تظهر أثناء المراجعة.
ja: 一時停止されたカードは黄色でハイライトされ、レビュー中には表示されません。
ru: Заблокированные карты выделены желтым цветом и не отображаются в процессе рассмотрения.

source: Delete note
ar: حذف الملاحظة
ja: ノートを削除
ru: Удалить заметку

source: Delete the note of the currently selected card, and all cards belonging to that note. This action cannot be undone without [restoring from backup](backups.md).
ar: احذف الملاحظة من البطاقة المختارة حاليا وجميع البطاقات التي تنتمي لتلك المذكرة. لا يمكن التراجع عن هذا الإجراء بدون [الاستعادة من النسخة الاحتياطية] (Backups.md).
ja: 現在選択されているカードとそのノートに属するすべてのカードのメモを削除します。format@@0(backups.md) なしでは元に戻すことはできません。
ru: Удалите заметку о выбранной карте и все карты, принадлежащие этой заметке. Это действие нельзя отменить без [восстановления резервной копии](backups.md).

source: Preview
ar: معاينة
ja: プレビュー
ru: Предпросмотр

source: Render the currently selected card so that you can see what it looks like in the reviewer.
ar: عرض البطاقة المختارة حاليا بحيث يمكنك رؤية ما تبدو عليه في المستعرض.
ja: 現在選択されているカードをレンダリングして、レビュアーでどのように見えるかを確認できます。
ru: Визуализировать выбранную карту, чтобы вы могли видеть ее в редакторе.

source: Select multiple cards
ar: حدد بطاقات متعددة
ja: 複数のカードを選択
ru: Выберите несколько карточек

source: Long-tapping on a single card will select the single card. While that card is selected, if you long-tap on another card on your screen, then all of the cards between the first selected card and the last card will be selected. This allows for actions to be performed on multiple cards at once.
ar: النقر الطويل على بطاقة واحدة سيحدد البطاقة الواحدة. بينما يتم تحديد تلك البطاقة، إذا قمت بالضغط مطولا على بطاقة أخرى على شاشتك، ثم سيتم اختيار جميع البطاقات بين أول بطاقة مختارة وآخر بطاقة. وهذا يسمح بتنفيذ الإجراءات على بطاقات متعددة في آن واحد.
ja: 1枚のカードを長押しすると、1枚のカードが選択されます。 そのカードが選択されている間、画面上の別のカードを長押しした場合。 そして、最初に選択したカードと最後のカードの間のすべてのカードが選択されます。 これにより、複数のカードに対して一度にアクションを実行できます。
ru: Долгое нажатие на одной карте выберет одну карту. Пока эта карта выбрана, если вы удерживаете другую карту на экране Затем будут выбраны все карты между первой картой и последней картой. Это позволяет выполнять действия сразу на нескольких картах.

source: Searching
ar: البحث
ja: 検索中
ru: Поиск

source: AnkiDroid supports all the search strings that the desktop version of Anki does, allowing you to perform quite complex searches. Some examples:
ar: AnkiDroid يدعم جميع مقاطع البحث التي تقوم بها نسخة سطح المكتب من أنكي، مما يسمح لك بإجراء عمليات بحث معقدة للغاية. بعض الأمثلة:
ja: AnkiDroidは、Ankiのデスクトップバージョンで行われるすべての検索文字列をサポートしているため、非常に複雑な検索を実行できます。いくつかの例：
ru: AnkiDroid поддерживает все строки поиска, которые делают настольная версия Anki, позволяя вам выполнять довольно сложный поиск. Некоторые примеры:

source: tag:marked
ar: علامة: علامة
ru: метка:отмечено
